{
  "cases": [
     {
    "name": "R (on the application of Begum) (Respondent) v Secretary of State for the Home Department (Appellant) [2021] UKSC 7",
    "keywords": ["immigration", "dual national", "national security", "citizenship", "human rights"],
    "summary": "<strong>Facts</strong><br>• Shamima Begum was a British citizen who left the UK to join ISIS in Syria.<br>• In 2019, the Home Secretary revoked her citizenship on the basis that she was a security threat to the UK.<br>• Begum challenged this decision in court, arguing that it made her stateless and that she could not effectively challenge it from Syria.<br>• The Court of Appeal found that the decision was unlawful because it rendered Begum stateless and because she would not be able to have a fair and effective appeal against it.<br><br><strong>Issues</strong><br>• The main issues in the case were whether the Home Secretary's decision to revoke Begum's citizenship was lawful, and whether it breached her right to a fair and effective appeal.<br>• The Home Secretary argued that the decision was taken in the interests of national security, and that Begum was not rendered stateless because she was entitled to Bangladeshi citizenship through her parents.<br>• Begum argued that she was effectively stateless because she had never been to Bangladesh and did not have any connection to the country.<br>• She also argued that she could not effectively challenge the decision from Syria, where she was living in a refugee camp without access to legal representation or evidence.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously allowed the Home Secretary's appeal against the Court of Appeal's decision.<br>• The Court found that the decision to revoke Begum's citizenship did not breach her right to a fair and effective appeal because she could pursue her case from Syria with the assistance of lawyers and that the decision did not render her stateless as she could claim Bangladeshi citizenship.<br><br><strong>Key passage(s)</strong><br>• 'the right to a fair hearing does not trump all other considerations, such as the safety of the public. If a vital public interest makes it impossible for a case to be fairly heard then the courts cannot ordinarily hear it. The appropriate response to the problem in the present case is for the deprivation appeal to be stayed until Ms Begum is in a position to play an effective part in it without the safety of the public being compromised.' (Lord Reed, paragraph 50)"
     },
    {
      "name": "R (on the application of Miller) (Appellant) v The Prime Minister (Respondent) [2019] UKSC 41",
      "keywords": ["constitutional", "Brexit", "parliamentary sovereignty", "judicial review", "separation of powers"],
      "summary": "<strong>Facts</strong><br>• Following the referendum vote to leave the European Union (EU) in 2016, the UK government triggered Article 50 of the Treaty on European Union, beginning the process of leaving the EU.<br>• The Prime Minister, Boris Johnson, advised the Queen to prorogue (suspend) Parliament for five weeks, claiming it was necessary to prepare a new legislative agenda.<br>• However, the suspension was challenged by Gina Miller, who argued that it was an unlawful abuse of power by the Prime Minister to prevent parliamentary scrutiny of Brexit.<br><br><strong>Issues</strong><br>• The central issue in this case was whether the advice given by the Prime Minister to the Queen to prorogue Parliament was justiciable (capable of being reviewed by the courts) and, if so, whether it was lawful.<br>• Miller argued that the Prime Minister's advice was unlawful because it had the effect of frustrating or preventing the constitutional role of Parliament in holding the government to account.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously held that the Prime Minister's advice to prorogue Parliament was unlawful because it had the effect of frustrating or preventing the constitutional role of Parliament without reasonable justification.<br>• The prorogation was therefore void and of no effect.<br>• The Court also held that the advice was justiciable, meaning that the courts have the power to review it.<br><br><strong>Key passage(s)</strong><br>• 'The Prime Minister's advice to Her Majesty was unlawful, void and of no effect. This means that the Order in Council to which it led was also unlawful, void and of no effect and should be quashed. This means that when the Royal Commissioners walked into the House of Lords it was as if they walked in with a blank sheet of paper. The prorogation was also void and of no effect. Parliament has not been prorogued' (Lady Hale).<br>• 'The longer that Parliament stands prorogued, the greater the risk that responsible government may be replaced by unaccountable government: the antithesis of the democratic model' (Lady Hale)."
    },
    {
      "name": "R (on the application of Privacy International) (Appellant) v Investigatory Powers Tribunal and others (Respondents) [2019] UKSC 22",
      "keywords": ["surveillance", "privacy rights", "human rights", "data protection", "intelligence agencies"],
      "summary": "<strong>Facts</strong><br>• Privacy International, a human rights organization, brought a claim against the Investigatory Powers Tribunal (IPT) and other defendants, challenging the lawfulness of the regime for the interception and use of communications data under the Regulation of Investigatory Powers Act 2000 (RIPA).<br>• The IPT is a judicial body responsible for hearing complaints against the intelligence services.<br>• Privacy International argued that the IPT's decisions were not subject to adequate judicial scrutiny and that RIPA was incompatible with EU law.<br><br><strong>Issues</strong><br>• The main issue was whether RIPA provided an adequate legal framework for the interception and use of communications data, and whether the IPT's decisions were subject to adequate judicial scrutiny.<br>• Privacy International argued that the regime was incompatible with EU law and violated the right to privacy, while the defendants argued that the regime was necessary for national security and subject to sufficient safeguards.<br><br><strong>Decision</strong><br>• The Supreme Court held that RIPA was incompatible with EU law because it did not provide for an independent body to authorize the interception of communications data, and because it did not require prior review by a court or independent administrative body.<br>• The Court also held that the IPT did not provide adequate judicial scrutiny of the intelligence services' activities, as it did not have the power to quash decisions or provide effective remedies for violations of human rights.<br>• However, the Court declined to make a formal declaration of incompatibility, as the relevant provisions had already been replaced by the Investigatory Powers Act 2016.<br><br><strong>Key passage(s)</strong><br>• 'The IPT is not a true court … [it] does not have the power to quash decisions or provide effective remedies for violations of human rights' (Lord Carnwath)<br>• 'The 2000 Act did not lay down clear and precise rules providing for access to and use of communications data … the access and use of that data was not limited to what was strictly necessary' (Lady Hale)"
    },
    {
      "name": "R (on the application of Bancoult No 3) (Appellant) v Secretary of State for Foreign and Commonwealth Affairs (Respondent) [2018] UKSC 3",
      "keywords": ["international law", "territorial sovereignty", "human rights", "colonialism", "Chagossian people"],
      "summary": "<strong>Facts</strong><br>• The Chagossian Islanders were forcibly removed from the Chagos Archipelago by the UK government in the late 1960s and early 1970s in order to make way for a US military base. The UK government declared the Chagos Archipelago a British Indian Ocean Territory (BIOT) in 1965.<br>• The appellant, Bancoult, a Chagossian, sought judicial review of the UK government's decision not to allow Chagossians to resettle in the BIOT.<br><br><strong>Issues</strong><br>• The main issue was whether the decision made by the UK government not to allow resettlement was lawful.<br>• Bancoult argued that the decision was unlawful because it was based on a flawed consultation process and was in breach of the European Convention on Human Rights.<br>• The Secretary of State argued that the decision was lawful and that the European Convention on Human Rights did not apply to the BIOT.</strong><br><br><strong>Decision</strong><br>• The Supreme Court dismissed Bancoult's appeal.<br>• The Court held that the decision not to allow resettlement was lawful and that the European Convention on Human Rights did not apply to the BIOT.<br>• The Court found that the consultation process was flawed, but that this did not render the decision unlawful.<br><br><strong>Key passage(s)</strong><br>• 'The concept of a 'colony' is a relic of the past. The manner in which the Chagossians were removed from the Chagos Archipelago, and the appalling conditions in which they were thereafter forced to live, are a stain on the history of our country. Nevertheless, as a matter of law, the actions of the executive and the legislature, in relation to the designation and governance of the BIOT, cannot be impugned' (Lord Mance, para. 1).<br>• 'The European Convention on Human Rights does not apply to acts or omissions of the Crown in relation to the BIOT or any other overseas territory, except to the extent provided by orders made under section 2(2) of the Human Rights Act 1998' (Lord Mance, para. 65)."
    },
    {
      "name": "R (on the application of UNISON) (Appellant) v Lord Chancellor (Respondent) [2017] UKSC 51",
      "keywords": ["employment law", "trade unions", "collective bargaining", "workers' rights", "judicial review"],
      "summary": "<strong>Facts</strong><br>• The case of R (on the application of UNISON) (Appellant) v Lord Chancellor (Respondent) [2017] UKSC 51 involved a challenge to the lawfulness of employment tribunal fees introduced in 2013.<br>• The fees, which ranged from £390 to £1200, were required to be paid by claimants in order to bring a claim before an employment tribunal.<br>• UNISON argued that the fees hindered access to justice and were discriminatory against women and other protected groups.<br><br><strong>Issues</strong><br>• The main issue in the case was whether the employment tribunal fees were unlawful and discriminatory.<br>• UNISON argued that the fees were a violation of the principle of access to justice, as they prevented workers from enforcing their employment rights.<br>• The Lord Chancellor argued that the fees were necessary to reduce the burden on taxpayers and to deter frivolous claims.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously held that the employment tribunal fees were unlawful and discriminatory.<br>• The court found that the fees had prevented access to justice and discriminated against women, as they were more likely to bring low-value claims that were disproportionately affected by the fees.<br>• The court also found that the fees were not reasonably necessary to achieve the stated policy goals of reducing the burden on taxpayers and deterring frivolous claims.<br><br><strong>Key passage(s)</strong><br>• 'The constitutional right of access to the courts is inherent in the rule of law. The importance of the rule of law is not always understood. Indications of a lack of understanding include the assumption that the administration of justice is merely a public service like any other, that courts and tribunals are providers of services to the “users” who appear before them, and that the provision of those services is of value only to the users themselves and to those who are remunerated for their participation in the proceedings. The extent to which that viewpoint has gained currency in recent times is apparent from the consultation papers and reports discussed earlier. It sometimes seems as though Lord Woolf’s reforms, which were designed to enable the courts to serve the people better, have turned into a mechanism for the management of the justice system in the interests of the efficiency of the courts rather than in the interests of the people for whose benefit the courts exist.' (para. 64, Lord Reed)"
    },
    {
      "name": "R (on the application of Miller and another) (Respondents) v Secretary of State for Exiting the European Union (Appellant) [2017] UKSC 5",
      "keywords": ["constitutional", "Brexit", "parliamentary sovereignty", "EU law", "triggering Article 50"],
      "summary": "<strong>Facts</strong><br>• This case concerned the legality of the UK government triggering Article 50 of the Treaty on European Union, which would begin the process of leaving the EU.<br>• The claimants argued that the government could not trigger Article 50 without an Act of Parliament.<br>• The government argued that it had the power to trigger Article 50 under the royal prerogative.<br><br><strong>Issues</strong><br>• The main issue was whether the government had the power to trigger Article 50 without an Act of Parliament.<br>• The claimants argued that triggering Article 50 would result in a change in domestic law and therefore required parliamentary approval.<br>• The government argued that the royal prerogative allowed it to make and unmake treaties without the need for parliamentary approval.<br><br><strong>Decision</strong><br>• The Supreme Court ruled in favour of the claimants, stating that an Act of Parliament was required before the government could trigger Article 50.<br>• The court held that triggering Article 50 would result in a change in domestic law, and that the royal prerogative could not be used to change domestic law.<br>• The court also held that the European Communities Act 1972, which gave effect to EU law in the UK, could not be repealed without an Act of Parliament.<br><br><strong>Key passage(s)</strong><br>• 'The change in the law required to implement the referendum's outcome must be made in the only way permitted by the UK constitution, namely by legislation' - Lord Neuberger (para. 26)<br>• 'The 1972 Act provides that rights enjoyed by UK residents by virtue of the UK's membership of the EU were created by a source of law which also forms part of UK law. Hence, withdrawal from the EU would remove some existing domestic rights of UK residents, and the government cannot lawfully remove rights granted by Parliament unless Parliament permits it to do so' - Lord Clarke (para. 114)"
    },
    {
      "name": "R v Jogee (Appellant) [2016] UKSC 8",
      "keywords": ["criminal law", "joint enterprise", "accessorial liability", "mens rea", "overturning precedent"],
      "summary": "<strong>Facts</strong><br>• In R v Jogee (Appellant) [2016] UKSC 8, two men, Jogee and Ruddock, were convicted of murder after they burgled a house and Ruddock fatally stabbed the homeowner.<br>• The trial judge instructed the jury that if they found that Jogee was a party to the crime, he would be guilty of murder as well.<br>• This was based on the doctrine of joint enterprise, which holds that if two or more people are jointly involved in a crime, they are all equally responsible for any foreseeable consequences, including murder.<br><br><strong>Issues</strong><br>• The central issue in the case was whether the doctrine of joint enterprise had been applied too widely.<br>• Jogee argued that the law had been misinterpreted and that he should not have been convicted of murder simply on the basis of his involvement in the burglary.<br>• The prosecution argued that the doctrine was an important tool for holding criminals accountable and should not be abolished or restricted.<br><br><strong>Decision</strong><br>• The UK Supreme Court ruled that the doctrine of joint enterprise had been wrongly interpreted by the courts for over 30 years.<br>• They held that the doctrine had been applied too widely and that it was not enough to simply prove that someone was involved in a crime in order to convict them of murder.<br>• Instead, the prosecution needed to prove that the defendant had intended to commit murder or had foreseen that murder was a possible consequence of their actions.<br>• The court also held that the doctrine should not be abolished entirely, as it played an important role in certain cases.<br><br><strong>Key passage(s)</strong><br>• 'The law took a wrong turn in 1984 when the Privy Council decided in Chan Wing-Siu that foresight of consequences was sufficient to establish the necessary intent for secondary liability in murder.' (Lord Neuberger, para. 20)<br>• 'In our judgment, the correct interpretation of the law is that a person who assists or encourages another to commit a crime is criminally liable for any acts committed in the course of that crime which are a natural and foreseeable consequence of what was agreed between them.' (Lord Hughes, para. 95)"
    },
    {
      "name": "Montgomery (Appellant) v Lanarkshire Health Board (Respondent) (Scotland) [2015] UKSC 11",
      "keywords": ["medical law", "informed consent", "doctor's duty", "patient autonomy", "medical negligence"],
      "summary": "<strong>Facts</strong><br>• Nadine Montgomery has diabetes and was pregnant with her son during 1999.<br>• Her son was born with severe disabilities after a difficult delivery.<br>• Montgomery claimed that the doctors did not inform her of the risk of shoulder dystocia, which is a condition where the baby’s shoulder gets stuck during delivery. This condition is more likely to occur in women with diabetes.<br><br><strong>Issues</strong><br>• The key issue was whether the doctors had a duty to disclose the risk of shoulder dystocia to Montgomery.<br>• The doctors argued that they had acted in accordance with their usual practice, which did not include informing patients of the risk of shoulder dystocia.<br>• They also argued that a warning would have led to Montgomery requesting a caesarean section, which would have been riskier for her and her baby.<br><br><strong>Decision</strong><br>• The Supreme Court held that the doctors had a duty to disclose the risk of shoulder dystocia to Montgomery.<br>• The court stated that doctors have a duty to take reasonable care to ensure that patients are aware of any material risks involved in any recommended treatment, and of any reasonable alternative or variant treatments.<br>• The court also held that the doctor's usual practice was not enough to discharge their duty to provide Montgomery with the information she needed to make an informed decision about her treatment.<br>• The court found that Montgomery would have chosen to have a caesarean section if she had been informed of the risks.<br><br><strong>Key passage(s)</strong><br>• 'An adult person of sound mind is entitled to decide which, if any, of the available forms of treatment to undergo, and her consent must be obtained before treatment interfering with her bodily integrity is undertaken. The doctor is therefore under a duty to take reasonable care to ensure that the patient is aware of any material risks involved in any recommended treatment, and of any reasonable alternative or variant treatments. The test of materiality is whether, in the circumstances of the particular case, a reasonable person in the patient's position would be likely to attach significance to the risk, or the doctor is or should reasonably be aware that the particular patient would be likely to attach significance to it.' (Lord Kerr)<br>• 'Neither the doctor nor the patient is the arbiter of objective reasonableness. The assessment of what risks and benefits would be reasonable to disclose, and how they should be presented and assessed, in any given case is a matter for expert judgment. In making that assessment, the doctor must take into account the characteristics of the patient, including her age, her sex, her state of health, and all other relevant aspects of her medical condition. He must also take into account any other medication which she is currently taking.' (Lord Kerr)"
    },
    {
      "name": "R (on the application of Evans) and another (Respondents) v Attorney General (Appellant) [2015] UKSC 21",
      "keywords": ["freedom of information", "transparency", "government records", "national security", "public interest"],
      "summary": "<strong>Facts</strong><br>• The case of R (on the application of Evans) and another (Respondents) v Attorney General (Appellant) [2015] UKSC 21 concerns the disclosure of the “black spider memos” written by Prince Charles to government officials.<br>• The memos contained the Prince’s views on a range of topics, including architecture, the environment, and healthcare.<br><br><strong>Issues</strong><br>• The main issue in the case was whether the Attorney General acted lawfully in refusing to disclose the memos in response to a Freedom of Information Act request.<br>• The respondents argued that the memos were of public interest and should be disclosed, while the appellant argued that the memos were part of the Prince’s private correspondence and therefore exempt from disclosure.<br><br><strong>Decision</strong><br>• The Supreme Court held that the Attorney General’s decision to refuse disclosure was unlawful.<br>• The Court found that the memos were “advocacy correspondence” rather than purely private correspondence, and therefore subject to disclosure under the Freedom of Information Act.<br>• The Court rejected the appellant’s argument that disclosure of the memos would harm the Prince’s ability to perform his duties as heir to the throne, stating that the public has a legitimate interest in knowing the views expressed by the Prince on matters of public policy.<br><br><strong>Key passage(s)</strong><br>• '...advocacy correspondence is not the same as ordinary correspondence. It is written by the Prince of Wales in order to advance the work of charities, to promote views and to seek feedback. In general, it is sent to government ministers and officials, and it is marked ‘not for publication’. It is not part of the normal system of communication between a private individual and public authorities. Rather, it is a means by which the Prince of Wales can express his views and seek to influence the government on matters about which he feels strongly, either through his own experiences or as a result of the concerns expressed to him by others' (Lord Mance).<br>• 'However, the public interest will not usually justify the disclosure of purely personal or confidential information or opinions, or exchanges intended to be confidential. Nor will it usually justify the disclosure of information or opinions relating to internal discussions and consultations within government, or between government departments and other public bodies' (Lord Neuberger)."
    },
    {
      "name": "R (on the application of Moseley) (in substitution of Stirling (Deceased)) (AP) (Appellant) v London Borough of Haringey (Respondent) [2014] UKSC 56",
      "keywords": ["property law", "inheritance", "human rights", "housing", "right to family life"],
      "summary": "<strong>Facts</strong><br>• Mr. Stirling was a tenant of the London Borough of Haringey.<br>• After his death, Ms. Moseley applied to the council to succeed the tenancy.<br>• However, the council refused to grant her the tenancy on the basis that she had not been living with Mr. Stirling for the required period of time as per the Housing Act 1985.<br>• Ms. Moseley challenged the decision in the courts, arguing that the council's decision was discriminatory under the Human Rights Act 1998.<br><br><strong>Issues</strong><br>• The main issue in the case was whether the council's refusal to grant Ms. Moseley the tenancy was discriminatory under the Human Rights Act 1998.<br>• Ms. Moseley argued that the decision breached her right to respect for her home and family life under Article 8 of the European Convention on Human Rights.<br>• The council argued that its decision was justified under the public interest in ensuring that social housing is allocated fairly.<br><br><strong>Decision</strong><br>• The Supreme Court held that the council's decision was discriminatory and breached Ms. Moseley's right to respect for her home and family life under Article 8 of the European Convention on Human Rights.<br>• The court noted that the council's policy of requiring a certain period of cohabitation for succession to a tenancy disproportionately affected unmarried partners and discriminated against them.<br>• The court also held that the public interest in ensuring fair allocation of social housing did not justify the discriminatory impact of the policy.<br><br><strong>Key passages</strong><br>• 'the Council's requirement of a two-year period of cohabitation as a condition of succession disproportionately affects unmarried partners and their children, and that it therefore discriminates against them in comparison with married couples and those in civil partnerships' (Lord Neuberger)<br>• 'the public interest in ensuring that social housing is allocated fairly does not justify the discriminatory impact of a requirement that only unmarried partners must have lived together for two years before a tenancy can be succeeded to' (Lord Wilson)"
    },
{
"name": "R (on the application of Nicklinson and another) (AP) (Appellants) v Ministry of Justice (Respondent) [2014] UKSC 38",
"keywords": ["medical law", "end of life", "assisted dying", "right to die", "human rights"],
  "summary": "<strong>Facts</strong><br>• Tony Nicklinson suffered a stroke that left him with locked-in syndrome, a condition that left him unable to move or communicate.<br>• He wanted to end his life but was unable to do so without assistance due to the Suicide Act 1961.<br>• Nicklinson and another individual, Paul Lamb, brought a case before the court seeking a declaration that the Suicide Act 1961 was incompatible with their right to a private life under Article 8 of the European Convention on Human Rights.<br><br><strong>Issues</strong><br>• The main issue was whether the Suicide Act 1961 was incompatible with the appellants' right to a private life under Article 8 of the European Convention on Human Rights.<br>• The appellants argued that the law violated their right to autonomy and self-determination.<br>• The respondent, the Ministry of Justice, argued that it was not for the courts to change the law on assisted suicide.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously dismissed the appeal.<br>• The court held that it was not for the courts to change the law on assisted suicide, as it was a matter for Parliament to decide.<br>• The court noted that Parliament had considered the issue of assisted suicide on several occasions but had chosen not to change the law.<br>• The court also noted that the European Court of Human Rights had not found that the right to a private life under Article 8 included a right to assisted suicide.<br><br><strong>Key passage(s)</strong><br>• 'The question for the court is whether the blanket ban on assisted suicide imposed by section 2(1) of the Suicide Act 1961 is a proportionate means of achieving the legitimate aim of the protection of the weak and vulnerable in society.' (Lord Neuberger)<br>• 'The question of whether the law should permit assisted suicide is a matter for Parliament to decide, not the courts.' (Lord Neuberger)"
},
    {
      "name": "R (on the application of HS2 Action Alliance Limited) (Appellant) v The Secretary of State for Transport and another (Respondents) [2014] UKSC 3",
      "keywords": ["administrative law", "environmental impact", "infrastructure", "public interest", "judicial review"],
  "summary": "<strong>Facts</strong><br>• The HS2 Action Alliance challenged the decision-making process of the Secretary of State for Transport and another in relation to the development of the High Speed 2 railway network.<br>• The challenge related to the Secretary of State's failure to carry out a Strategic Environmental Assessment (SEA) under the Environmental Assessment of Plans and Programmes Regulations 2004 (the SEA Regulations).<br><br><strong>Issues</strong><br>• The main issue was whether the Secretary of State had a legal obligation to carry out an SEA in relation to the HS2 project, and if so, whether that obligation had been fulfilled.<br>• The HS2 Action Alliance argued that an SEA was required under the SEA Regulations, whereas the Secretary of State argued that it was not necessary.<br><br><strong>Decision</strong><br>• The Supreme Court held that an SEA was required in relation to HS2 and that the Secretary of State had failed to fulfil this obligation.<br>• The court held that the HS2 project fell within the definition of a 'plan or programme' under the SEA Regulations and that the Secretary of State had failed to comply with the requirement to carry out an SEA.<br><br><strong>Key passage(s)</strong><br>• 'The Secretary of State did not appreciate that the duty to assess the environmental effects of the HS2 project arose at the stage of deciding whether to include it in the list of projects requiring assessment under the SEA Directive. He wrongly believed that the duty would only arise at a later stage.' (Lord Carnwath)<br>• 'The purpose of the SEA Directive is to ensure that environmental considerations are integrated into the preparation and adoption of plans and programmes which are likely to have a significant effect on the environment. That is a process which is essentially forward-looking, and calls for a broad consideration of the likely environmental effects of different options at an early stage in the decision-making process.' (Lord Carnwath)"
    },
    {
      "name": "R (on the application of Chester) (Appellant) v Secretary of State for Justice (Respondent) [2013] UKSC 63",
      "keywords": ["family law", "same-sex marriage", "civil partnership", "discrimination", "human rights"],
      "summary": "<strong>Facts</strong><br>• The appellant, Chester, was a convicted sex offender who had completed his custodial sentence but was subject to a lifelong notification requirement under the Sexual Offences Act 2003.<br>• Chester argued that the notification requirement violated his human rights, specifically his right to respect for private and family life under Article 8 of the European Convention on Human Rights (ECHR).<br><br><strong>Issues</strong><br>• The main issue was whether the notification requirement under the Sexual Offences Act 2003 was compatible with Article 8 of the ECHR.<br>• Chester argued that it was not, while the Secretary of State for Justice argued that it was necessary for the protection of the public.<br><br><strong>Decision</strong><br>• The Supreme Court held that the notification requirement under the Sexual Offences Act 2003 was incompatible with Article 8 of the ECHR.<br>• The Court found that the notification requirement was disproportionate and unjustified, and that it imposed a blanket requirement without regard to individual circumstances.<br>• The Court also noted that there was no evidence to support the effectiveness of the notification requirement in reducing reoffending.<br><br><strong>Key passage(s)</strong><br>• 'The notification requirements have a very significant impact on the article 8 rights of those affected by them. They are open-ended, potentially lasting for life, and there is a significant stigma attached to them, in terms of the adverse effect on the offender's relationship with his family and in society generally. Moreover, they are imposed on offenders who have served the sentences imposed on them by the courts and who, in many cases, have been assessed as posing no significant risk of reoffending' (para. 50, Lord Reed).<br>• 'The imposition of the notification requirements on the appellant, in the absence of any consideration of his individual circumstances, was disproportionate and unjustified. It follows that the requirements were incompatible with his article 8 rights' (para. 97, Lord Reed)."
    },
    {
      "name": "Walumba Lumba (Congo) 1 and 2 (Appellants) v Secretary of State for the Home Department (Respondent) [2011] UKSC 12",
      "keywords": ["immigration law", "asylum seekers", "refugees", "human rights", "deportation"],
  "summary": "<strong>Facts</strong><br>• Walumba Lumba (Congo) 1 and 2 were Congolese nationals who arrived in the UK in 2002 and claimed asylum on the basis of political persecution.<br>• Their asylum claim was refused, and they were issued with removal directions.<br>• Lumba 1 was later arrested and convicted of drug offences and sentenced to six years in prison.<br>• Lumba 2 was pregnant and gave birth to a child who was later diagnosed with a serious medical condition.<br><br><strong>Issues</strong><br>• The main issue was whether the Secretary of State for the Home Department (Respondent) had breached the appellants' (Walumba Lumba 1 and 2) rights under Article 8 of the European Convention on Human Rights (ECHR) by refusing to grant them leave to remain in the UK on the basis of their family and private life.<br>• The appellants argued that the decision to remove them from the UK would breach their rights under Article 8 of the ECHR as they had established a family and private life in the UK.<br>• The respondent argued that the decision was in line with the immigration rules and that the appellants could continue their family life outside the UK.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously allowed the appeal and held that the respondent's decision breached the appellants' rights under Article 8 of the ECHR.<br>• The court held that the respondent's policy failed to give sufficient weight to the best interests of the child, who had been born and raised in the UK and had medical needs that could not be adequately met in the Congo.<br><br><strong>Key passage(s)</strong><br>• 'the Secretary of State's policy failed to give sufficient weight to the best interests of the child, and thus was not in accordance with the law' (Lord Dyson)<br>• 'In the present case, the appellants' private and family life had been established at a time when there was no question of their status being precarious, and the best interests of the child were plainly a primary consideration' (Lord Hope)"
    },
    {
      "name": "Axa General Insurance Ltd v HM Advocate and others (Scotland) [2011] UKSC 46",
      "keywords": ["criminal law", "insurance fraud", "prosecution", "evidence", "fraudulent claims"],
  "summary": "<strong>Facts</strong><br>• Axa General Insurance Ltd (Axa) provided insurance to a haulage company, which covered the theft of its vehicles and their contents.<br>• Between 2003 and 2005, several thefts occurred, and Axa made payments to the haulage company.<br>• It later emerged that the haulage company had staged the thefts, and several individuals were convicted of fraudulently obtaining insurance payments.<br>• Axa sought to recover the payments it had made, arguing that the policy had been procured by fraud.<br><br><strong>Issues</strong><br>• The main issue was whether Axa was entitled to recover the payments it had made under the insurance policy.<br>• Axa argued that the policy had been procured by fraud, and therefore was voidable.<br>• The respondents argued that the policy was not voidable, because the fraud had not been committed by Axa or the insured party.<br><br><strong>Decision</strong><br>• The Supreme Court held that Axa was entitled to recover the payments it had made under the insurance policy.<br>• The policy had been procured by fraud, and therefore was voidable.<br>• The fraud of the haulage company was imputed to Axa, because it had been induced to enter into the insurance contract by the fraud.<br>• The Court also held that the respondents were not entitled to rely on the principle of 'innocent co-insured', because they had not paid any premiums under the policy.<br><br><strong>Key passage(s)</strong><br>• Lord Mance 'Where a policy of insurance is procured by fraud, it is voidable and not void ab initio. It is open to the insurer to affirm the policy and to sue on it, or to avoid it and refuse to pay out under it...An insurer who has been induced to enter into a policy by the fraud of the insured is entitled to avoid it, and to recover money paid under it, unless the fraud is of a kind which should not be visited on the innocent co-insured' (paragraph 23).<br>• Lord Kerr 'It is true that the fraud in this case was perpetrated by the insured, but the insurer was induced to enter into the contract by the fraud...It seems to me that the fraud of the insured must be imputed to the insurer, where the insurer has been induced to enter into the contract by the fraud' (paragraph 36)."
    },
    {
      "name": "Radmacher (formerly Granatino) v Granatino [2010] UKSC 42",
      "keywords": ["family law", "prenuptial agreements", "financial settlements", "divorce", "marital assets"],
  "summary": "<strong>Facts</strong><br>• Katrin Radmacher (Radmacher), a German national, and Nicolas Granatino (Granatino), a French national, met in London in 1997.<br>• Radmacher was a wealthy heiress, while Granatino was a banker.<br>• They married in 1998 and had two children.<br>• Prior to their wedding, Radmacher asked Granatino to sign a prenuptial agreement (PNA) to protect her assets in the event of a divorce.<br>• Granatino signed the agreement without seeking legal advice.<br>• In 2006, the couple separated and divorced.<br>• Granatino contested the validity of the PNA, arguing that it was unfair and that he had signed it under duress.<br><br><strong>Issues</strong><br>• The main issue was whether the PNA should be enforced, given that Granatino had signed it without seeking legal advice and claimed that he had done so under duress.<br>• The Court of Appeal had held that the PNA was unenforceable, while Radmacher had appealed to the Supreme Court.<br><br><strong>Decision</strong><br>• The Supreme Court allowed Radmacher's appeal and held that the PNA was enforceable.<br>• The court noted that PNAs were not contrary to public policy and that the parties should be held to their agreements unless there were good reasons not to do so.<br>• The court held that the existence of the PNA did not indicate that the parties did not intend to be bound by it, and that Granatino had failed to establish that he had signed it under duress.<br>• The court also held that the fact that Granatino had not sought legal advice was not sufficient to render the agreement unenforceable.<br><br><strong>Key passage(s)</strong><br>• 'The court should give effect to a nuptial agreement that is freely entered into by each party with a full appreciation of its implications unless in the circumstances prevailing it would not be fair to hold the parties to their agreement' (Lord Phillips)<br>• 'In the present case, in my view, it is impossible to say that it was unfair to hold the husband to the agreement that he freely made and that was clearly understood by both parties to regulate their financial affairs in the event of divorce' (Lord Collins)"
    },
    {
      "name": "R (on the application of Cart) v The Upper Tribunal [2011] UKSC 28",
      "keywords": ["administrative law", "tribunals", "judicial review", "human rights", "procedural fairness"],
  "summary": "<strong>Facts</strong><br>• This case concerns the judicial review of a decision made by the Upper Tribunal (Immigration and Asylum Chamber) dismissing the appellant's appeal against the refusal of her asylum claim.<br>• The appellant, Ms. Cart, is a Ugandan national who claimed asylum in the UK on the basis of her sexuality.<br><br><strong>Issues</strong><br>• The main issue in this case is whether the Upper Tribunal's decision was flawed because it failed to take into account relevant evidence about the appellant's sexuality and the conditions for gay people in Uganda.<br>• The appellant argued that the Upper Tribunal's decision was irrational and in breach of her right to a fair hearing under Article 6 of the European Convention on Human Rights (ECHR).<br><br><strong>Decision</strong><br>• The Supreme Court held that the Upper Tribunal's decision was flawed and should be quashed.<br>• The Court noted that the Upper Tribunal had failed to take into account relevant evidence about the appellant's sexuality and the conditions for gay people in Uganda.<br>• The Court also held that this failure amounted to a breach of the appellant's right to a fair hearing under Article 6 of the ECHR.<br>• As a result, the Court remitted the case back to the Upper Tribunal for reconsideration.<br><br><strong>Key passage(s)</strong><br>• 'The Upper Tribunal's decision was flawed because it did not take into account evidence that was relevant to the appellant's claim and that could have had a material effect on the outcome of the appeal. This failure amounted to a breach of the appellant's right to a fair hearing under Article 6 of the ECHR.' (Lord Dyson)<br>• 'The Upper Tribunal was required to give reasons for its decision that showed that it had taken into account all the material evidence before it and had applied the correct legal test. In this case, the Upper Tribunal failed to do so.' (Lord Kerr)"
    },
    {
      "name": "R (on the application of E) (Respondent) v JFS Governing Body (Appellant) [2009] UKSC 15",
      "keywords": ["education law", "religious discrimination", "admissions policy", "equality", "religious freedom"],
  "summary": "<strong>Facts</strong><br>• The JFS Governing Body (JFS) is an Orthodox Jewish school in London that gives priority to children who are Jewish according to the Orthodox definition.<br>• E applied for admission to JFS but was rejected as her mother's mother was not Jewish according to the Orthodox definition.<br>• E challenged the decision, arguing that it was discriminatory.<br><br><strong>Issues</strong><br>• The main issue in this case was whether JFS's admissions policy, which gave priority to children who are Jewish according to the Orthodox definition, was discriminatory under the Race Relations Act 1976 (RRA) and the Equality Act 2006 (EA).<br>• E argued that the policy was discriminatory, while JFS argued that it was a legitimate way of maintaining a Jewish ethos.<br><br><strong>Decision</strong><br>• The Supreme Court held that JFS's admissions policy was discriminatory under the RRA and the EA.<br>• The Court found that the policy was not a proportionate means of achieving a legitimate aim, as it discriminated against children who were Jewish but did not meet the Orthodox definition.<br>• The Court also found that the policy was not necessary to maintain a Jewish ethos, as there were other ways of doing so that did not involve discrimination.<br><br><strong>Key passage(s)</strong><br>• Lord Phillips 'Direct discrimination on grounds of race or ethnic or national origins is unlawful. It is unlawful regardless of whether it is conscious or unconscious, intentional or unintentional. The fact that the criterion applied by JFS may have a religious connotation does not mean that it is not discriminatory' [para. 21].<br>• Lady Hale 'If a school such as JFS admits any pupils who are not Jewish according to the Orthodox definition, then the argument that it is necessary to admit only those who are in order to maintain a Jewish ethos is weakened. It is not the religion of the pupil which matters, but the religion of the school' [para. 88]."
    },
    {
      "name": "R (on the application of Purdy) v Director of Public Prosecutions [2009] UKHL 45",
      "keywords": ["criminal law", "assisted suicide", "prosecution policy", "human rights", "end of life"],
  "summary": "<strong>Facts</strong><br>• Debbie Purdy suffered from multiple sclerosis and wished to end her life at a time of her choosing.<br>• She sought clarification from the Director of Public Prosecutions (DPP) on whether her husband would be prosecuted for assisting her suicide if she travelled to Switzerland to end her life.<br>• The DPP refused to provide clarification, stating that each case would be decided on its own facts.<br>• Purdy brought a case seeking clarification on the law of assisted suicide.<br><br><strong>Issues</strong><br>• The issue in this case was whether the DPP's refusal to provide clarification on the law of assisted suicide was a breach of Purdy's right to respect for private life under Article 8 of the European Convention on Human Rights (ECHR).<br>• Purdy argued that the lack of clarity on the law made it impossible for her to make an informed decision about whether to end her life.<br><br><strong>Decision</strong><br>• The House of Lords held that the DPP's refusal to provide clarification on the law of assisted suicide was a breach of Purdy's Article 8 rights.<br>• The court held that the DPP had a duty to clarify the law to enable individuals to make an informed decision about whether to end their life.<br>• The court outlined a set of factors that the DPP should consider when deciding whether to prosecute someone for assisting suicide, including the motivation of the person assisting, the final acts of the deceased, and the overall circumstances of the case.<br><br><strong>Key passage(s)</strong><br>• 'Article 8 of the ECHR is engaged because the DPP's policy has an impact on the manner in which the applicant can exercise her right to autonomy and self-determination when deciding whether to end her life.' - Lord Hope (para. 9)<br>• 'The DPP must provide an indication of the factors that he would take into account in deciding whether or not to consent to a prosecution in cases of assisted suicide.' - Lord Hope (para. 40)"
    },
    {
      "name": "R (on the application of Gentle) v Prime Minister [2008] UKHL 20",
      "keywords": ["human rights", "armed conflict", "Iraq War", "state responsibility", "right to life"],
      "summary": ""
    },
        {
      "name": "Stack v Dowden [2007] UKHL 17",
      "keywords": ["property law", "cohabitation", "trusts", "ownership", "family home"],
      "summary": "<strong>Facts</strong><br>• Stack v Dowden [2007] UKHL 17 concerns the division of the proceeds from the sale of a property between two cohabitants, Ms Dowden and Mr Stack.<br>• They had lived together for 18 years, had three children together, and had purchased the property in joint names.<br><br><strong>Issues</strong><br>• The main issue was the nature and extent of the parties' beneficial interests in the property.<br>• Ms Dowden argued that their interests were equal, as they had purchased the property in joint names and had contributed equally to the purchase price and mortgage payments.<br>• Mr Stack argued that he was entitled to a greater share of the proceeds, as he had made larger contributions to the property's purchase and maintenance.<br><br><strong>Decision</strong><br>• The House of Lords held that there was no presumption of joint beneficial ownership of the property, and that the extent of each party's interest would depend on their common intention at the time of purchase.<br>• In this case, the parties had intended to own the property jointly and equally, and therefore their beneficial interests were equal.<br>• However, the court recognized that the parties had conducted their financial affairs separately, and that this might indicate a contrary intention.<br>• Therefore, the court considered the parties' whole course of conduct, including their financial arrangements and contributions, to determine their common intention.<br><br><strong>Key passage(s)</strong><br>• 'It is not possible to lay down any hard and fast rule as to the identification of the relevant common intention. Everything depends on the context in which the question arises.' (Lord Walker)<br>• 'In most cases where there is evidence of joint legal ownership, it will readily be inferred, in the absence of evidence to the contrary, that the parties intended to beneficially own the property in equal shares.' (Baroness Hale)"
    },
    {
      "name": "R (on the application of Jackson) v Attorney General [2005] UKHL 56",
      "keywords": ["constitutional", "parliamentary sovereignty", "legislation", "judicial review", "Human Rights Act"],
      "summary": "<strong>Facts</strong><br>• The Hunting Act 2004 (the Act) banned hunting wild mammals with dogs.<br>• Mr Jackson challenged the Act, arguing that it was incompatible with the European Convention on Human Rights (ECHR) and that it was enacted using an improper parliamentary procedure.<br>• The case was heard by the House of Lords, which is now known as the Supreme Court.<br><br><strong>Issues</strong><br>• The main issues in the case were whether the Act was incompatible with the ECHR, particularly Article 1 of the First Protocol (A1P1), which protects the right to peaceful enjoyment of possessions, and whether the Act was enacted using an improper parliamentary procedure.<br><br><strong>Decision</strong><br>• The House of Lords held that the Act was not incompatible with A1P1 as it did not interfere with any existing property rights.<br>• The court also held that the Act was enacted using a proper parliamentary procedure and that the Parliament Act 1949 (which allows the House of Commons to override the House of Lords in certain circumstances) was not unconstitutional.<br><br><strong>Key passage(s)</strong><br>• Lord Hope, in his judgment, stated 'The question whether the Hunting Act 2004 is compatible with the Convention is one of substance, not procedure. The court is concerned with whether the effect of the legislation is to interfere with the rights protected by the Convention, not with whether the appropriate procedures have been followed in Parliament' [para. 49].<br>• Lord Bingham, in his judgment, stated 'The Hunting Act 2004 was passed in the way that Parliament prescribed for it. It has not been suggested that any provision of the Act was beyond the legislative competence of Parliament. The Act is not incompatible with the Convention. It must be accepted as law' [para. 1]."
    },
    {
      "name": "Campbell v Mirror Group Newspapers Ltd [2004] UKHL 22",
      "keywords": ["media law", "privacy", "defamation", "freedom of the press", "public interest"],
      "summary": "<strong>Facts</strong><br>• Naomi Campbell, a well-known model, attended Narcotics Anonymous meetings and it was reported in the Mirror newspaper that she was attending these meetings.<br>• Campbell sued the Mirror Group Newspapers Ltd for breach of confidence and claimed that her privacy had been violated.<br>• The Mirror Group Newspapers argued that Naomi Campbell had sought publicity of her attendance at the meetings in order to gain positive publicity for her image.<br><br><strong>Issues</strong><br>• The main issue in this case was whether Naomi Campbell's privacy had been violated when the Mirror Group Newspapers reported on her attendance at Narcotics Anonymous meetings.<br>• Additionally, the case raised questions about the balance between freedom of expression and the right to privacy.<br><br><strong>Decision</strong><br>• The House of Lords held that Naomi Campbell's privacy had been violated by the Mirror Group Newspapers.<br>• The court found that there was no public interest in publishing the information about Campbell's attendance at the meetings.<br>• The court also found that even if there was a public interest, it did not outweigh Campbell's right to privacy.<br><br><strong>Key passage(s)</strong><br>• 'Whether something is private must depend on all the circumstances. Although the circumstances in which the information comes into the public domain may be relevant, they are not determinative. For example, in some cases, the fact that information is already known to a section of the public may make it more likely that its further dissemination will not give rise to a reasonable expectation of privacy. But the fact that information is in the public domain does not necessarily mean that there is no reasonable expectation of privacy in relation to further dissemination of that information.' (Lord Nicholls)<br>• 'The touchstone of private life is not whether a person is in a public place or a private place but whether in all the circumstances the person has a reasonable expectation of privacy.' (Lord Hope)<br>• 'It is not necessary to show that the disclosure was motivated by a desire to injure the claimant or for any other improper purpose. It is sufficient if the disclosure is offensive to a reasonable person of ordinary sensibilities.' (Lord Nicholls)"
    },
    {
      "name": "R (on the application of Limbuela) v Secretary of State for the Home Department [2005] UKHL 66",
      "keywords": ["immigration law", "asylum seekers", "human rights", "destitution", "right to work"],
      "summary": "<strong>Facts</strong><br>• The appellant, Mr. Limbuela, was a Tanzanian citizen who sought asylum in the UK.<br>• He had been living in the UK for six years and was unable to return to Tanzania because he feared persecution due to his political beliefs.<br>• However, his claim for asylum was refused by the Secretary of State for the Home Department, and he was subsequently detained under the Immigration Act 1971.<br>• Mr. Limbuela brought a judicial review claim, arguing that his detention was unlawful under both domestic and international law.<br><br><strong>Issues</strong><br>• The main issue in this case was whether the detention of Mr. Limbuela was lawful under the Immigration Act 1971 and the European Convention on Human Rights (ECHR).<br>• The appellant argued that his detention was a breach of his right to liberty under Article 5 of the ECHR, while the respondent argued that the detention was lawful under the Immigration Act 1971 and justified on the grounds of immigration control.<br><br><strong>Decision</strong><br>• The House of Lords held that the detention of Mr. Limbuela was unlawful and a breach of his right to liberty under Article 5 of the ECHR.<br>• The Court held that the Immigration Act 1971 did not provide sufficient legal basis for detention that was likely to be indefinite, and that such detention was not proportionate to the aim of immigration control.<br>• The Court also held that the Secretary of State had failed to consider alternatives to detention, such as bail or reporting requirements.<br>• As a result, the Court found that Mr. Limbuela's detention was arbitrary and unlawful under both domestic and international law.<br><br><strong>Key passage(s)</strong><br>• 'The power to detain, being an interference with the right to liberty, must be clearly conferred by statute. The power must be exercised in accordance with the purposes for which it is conferred. The purposes must be sufficiently compelling to override the fundamental right to liberty. The detention must also be proportionate to the purpose of detention.' - Lord Hope of Craighead<br>• 'Detention in such cases must be a measure of last resort, because the harm which it does to the individual's mental and physical health is so very great. In order to justify it as a proportionate measure, it is necessary to show that there is no less invasive means of achieving the end which the measure is designed to achieve.' - Baroness Hale of Richmond"
    },
    {
      "name": "A v Secretary of State for the Home Department [2004] UKHL 56",
      "keywords": ["immigration law", "deportation", "refugees", "human rights", "statelessness"],
      "summary": "<strong>Facts</strong><br>• A was a Libyan national who had been granted indefinite leave to remain in the UK.<br>• In 1995, he was arrested and detained on suspicion of involvement in terrorism.<br>• Following the 9/11 attacks, A was certified as a threat to national security and detained without trial under the Anti-terrorism, Crime and Security Act 2001.<br>• A challenged his detention arguing that it was incompatible with the European Convention on Human Rights (ECHR).<br><br><strong>Issues</strong><br>• The main issue in this case was whether the indefinite detention of foreign nationals without trial under the Anti-terrorism, Crime and Security Act 2001 was compatible with the ECHR.<br>• A also argued that the provisions were discriminatory and contrary to EU law.<br><br><strong>Decision</strong><br>• The House of Lords held that the indefinite detention of foreign nationals without trial under the Anti-terrorism, Crime and Security Act 2001 was incompatible with the ECHR.<br>• However, the majority held that the provisions were not discriminatory or contrary to EU law.<br>• The House of Lords made a declaration of incompatibility, which meant that it was up to the government to decide whether to amend the legislation.<br><br><strong>Key passage(s)</strong><br>• Lord Hoffmann 'This is a nation which has been tested in adversity, which has survived physical destruction and catastrophic loss of life. I do not underestimate the ability of fanatical groups of terrorists to kill and destroy, but they do not threaten the life of the nation. Whether we would survive Hitler hung in the balance, but there is no doubt that we shall survive Al-Qaeda. The Spanish people have not said that what happened in Madrid, hideous crime as it was, threatened the life of the Spanish nation. Their legendary pride would not allow it. Terrorist violence, serious as it is, does not threaten our institutions of government or our existence as a civil community.' (para. 73)<br>• Lord Hope 'I am quite satisfied that the derogation is disproportionate in the sense that it impinges to an unacceptable degree upon the fundamental rights of the individual. It is not, as the government contends, a case in which the individual's right to liberty has to be balanced against the collective interest of the community, for the individual's only link with this country is that he is detained here.' (para. 135)"
    },
    {
      "name": "R (on the application of H) v Mental Health Review Tribunal for the North and East London Region and the Secretary of State for Health [2005] UKHL 60",
      "keywords": ["mental health law", "detention", "human rights", "treatment", "patient rights"],
      "summary": "<strong>Facts</strong><br>• H was detained under Section 3 of the Mental Health Act 1983 due to his mental illness.<br>• He was diagnosed with a personality disorder and was found to be a risk to himself and others.<br>• H was prescribed medication, but he refused to take it.<br>• The Mental Health Review Tribunal for the North and East London Region (Tribunal) decided to discharge H from detention, but the Secretary of State for Health (Secretary) appealed the decision.<br><br><strong>Issues</strong><br>• The issue was whether the Tribunal had the power to order the discharge of a patient who refused to take prescribed medication, or whether the Tribunal could only discharge a patient who was willing to comply with the medication.<br>• H argued that the Tribunal had the power to discharge him, regardless of his refusal to take medication.<br>• The Secretary argued that the Tribunal could only discharge a patient who was willing to comply with the medication.<br><br><strong>Decision</strong><br>• The House of Lords held that the Tribunal had the power to order the discharge of a patient who refused to take prescribed medication.<br>• The Tribunal had to consider whether the patient’s mental disorder was under control and whether it was necessary for the patient to remain in hospital.<br>• The Tribunal had to balance the patient’s rights against the public interest in protecting the patient and others from harm.<br><br><strong>Key passage(s)</strong><br>• Lord Bingham 'The Tribunal has to consider whether the criteria for detention continue to be met and whether it is necessary for the patient to remain liable to be detained in hospital for the purpose of medical treatment. If the Tribunal concludes that the criteria for detention are no longer satisfied, it must order the discharge of the patient. If it concludes that the criteria continue to be satisfied, it may not order discharge. But if it concludes that the criteria continue to be satisfied and that medical treatment is necessary, it must balance the competing interests, giving particular weight to the paramount need to protect the patient and the public against the risks posed by the patient, and decide whether the patient should be discharged or should remain in hospital for further treatment.' (para. 4)<br>• Lord Rodger 'In this case, the majority of the Tribunal clearly thought that, if H were discharged, the risk of his committing suicide would be significantly increased. The Tribunal was plainly entitled to take that view, based on its own assessment of the evidence. But it was not entitled to say that, because of the risk, it could not make the order for discharge. On the contrary, it was its duty to make the order unless, balancing the risks and benefits, it concluded that it would not be in H's interests to do so.' (para. 44)"
    },
        {
      "name": "Regina v Bartle and the Commissioner of Police for the Metropolis and Others, Ex Parte Pinochet [1999] UKHL 1",
      "keywords": ["international law", "extradition", "crimes against humanity", "immunity", "universal jurisdiction"],
      "summary": "<strong>Facts</strong><br>• Augusto Pinochet, the former president of Chile, was arrested in London in 1998 on a Spanish warrant seeking his extradition to Spain to face charges of torture and conspiracy to torture during his regime.<br>• Pinochet claimed immunity as a former head of state.<br>• The case went to the House of Lords, which had to decide whether Pinochet was entitled to immunity from prosecution under international law.<br><br><strong>Issues</strong><br>• The main issue in this case was whether Pinochet was entitled to immunity from prosecution under international law.<br>• Pinochet argued that he was entitled to immunity as a former head of state.<br>• The other issue was whether the crimes Pinochet was accused of were extraditable offenses.<br><br><strong>Decision</strong><br>• The House of Lords ruled that Pinochet was not entitled to immunity from prosecution as a former head of state.<br>• The Lords held that the nature of the crimes Pinochet was accused of, namely torture and conspiracy to torture, were not covered by the doctrine of state immunity.<br>• Therefore, Pinochet could be extradited to Spain to face trial.<br>• However, the Lords also ruled that Pinochet was entitled to immunity in relation to acts committed in the exercise of his functions as a head of state.<br><br><strong>Key passage(s)</strong><br>• Lord Browne-Wilkinson 'Crimes such as torture, hostage-taking and genocide are crimes under international law, whether committed by rulers or private individuals. The principle of international law which excludes state immunity from jurisdiction in respect of such crimes thus reflects the fundamental moral principle that no state, no ruler, no official and no individual has licence to commit such crimes' (para. 13).<br>• Lord Millett 'Crimes against humanity are crimes against all mankind. No sovereign or head of state can claim immunity from the jurisdiction of the courts of another state where he is accused of committing such crimes' (para. 98)."
    },
    {
      "name": "Fairchild v Glenhaven Funeral Services Ltd and others [2002] UKHL 22",
      "keywords": ["tort law", "negligence", "causation", "liability", "asbestos-related diseases"],
      "summary": "<strong>Facts</strong><br>• Fairchild worked as an apprentice for various firms, including Glenhaven Funeral Services Ltd.<br>• During his employment, he was exposed to asbestos, which ultimately led to his contracting mesothelioma, a cancer of the lining of the lungs.<br>• The exposure to asbestos occurred during different periods of employment, and it was impossible to determine which exposure caused the illness.<br>• Fairchild brought a claim against all the firms he had worked for, alleging that each of them had contributed to his illness.<br><br><strong>Issues</strong><br>• The main issue was whether Fairchild could succeed in his claim against his employers despite the inability to prove which employer's exposure caused his illness.<br>• The employers argued that they should not be held liable for Fairchild's mesothelioma because it was impossible to establish which of them had caused the harm.<br>• Fairchild, on the other hand, argued that because he had contracted the illness due to the employers' negligence, each employer should be held liable for his injuries.<br><br><strong>Decision</strong><br>• The House of Lords held that in mesothelioma cases, where a claimant had been exposed to asbestos by more than one employer, and it was impossible to prove which exposure had caused the illness, each employer should be held liable for the full extent of the damage caused.<br>• This decision departed from the traditional 'but for' causation test, which requires a claimant to prove that the defendant's actions were the cause of the harm suffered.<br>• The court held that the burden of proof should be reversed in such cases, and the employers should bear the burden of proving that they did not cause the harm.<br><br><strong>Key passage(s)</strong><br>• 'The defendants' submission is that the chain of causation is broken because the mesothelioma could have been caused by exposure not attributable to any of them. I reject that submission. The mesothelioma was caused by a combination of factors, including the exposure to asbestos dust of each employer. Each exposure contributed to the mesothelioma and so to the damage suffered by the Claimant.' (Lord Bingham)<br>• 'In my view, the law should recognize that there are exceptional cases in which the 'but for' test of causation may properly be relaxed. The present case, in which the Claimant has worked for a number of different employers, each of whom has materially increased the risk of his developing mesothelioma, is one such case.' (Lord Hoffmann)"
    },
    {
      "name": "R (on the application of Anderson) v Secretary of State for the Home Department [2002] UKHL 46",
      "keywords": ["immigration law", "detention", "human rights", "asylum seekers", "unlawful detention"],
      "summary": "<strong>Facts</strong><br>• Ms Anderson was a Jamaican national who had been living in the UK since she was six years old.<br>• She had two young children and was married to a British citizen.<br>• Ms Anderson was convicted of an offence and sentenced to 15 months in prison.<br>• The Secretary of State for the Home Department decided to deport her to Jamaica on the basis that her presence in the UK was not conducive to the public good.<br>• Ms Anderson challenged the decision.<br><br><strong>Issues</strong><br>• The main issue was whether the Secretary of State's decision to deport Ms Anderson was compatible with her right to respect for private and family life under Article 8 of the European Convention on Human Rights (ECHR).<br>• Ms Anderson argued that her deportation would disproportionately interfere with her family life and that the Secretary of State had failed to give proper consideration to the impact on her children.<br><br><strong>Decision</strong><br>• The House of Lords held that the Secretary of State's decision was incompatible with Ms Anderson's right to respect for private and family life under Article 8 of the ECHR.<br>• The Lords found that the Secretary of State had not given proper weight to the impact of the decision on Ms Anderson's children and had failed to take into account factors such as the length of time she had been living in the UK and her strong ties to the country.<br>• The decision to deport Ms Anderson was therefore quashed.<br><br><strong>Key passages</strong><br>• 'The need to protect the public from the consequences of serious crime is a strong factor to be weighed in the balance. But it is not the only factor. The decision-maker must have regard to all relevant factors and must strike a fair balance between the rights of the individual and the interests of the community which he is called upon to protect.' - Lord Hope of Craighead<br>• 'Although the public interest in deporting a person who has committed a criminal offence is a weighty one, it is not an absolute interest. It has to be balanced against the Article 8 rights of the individual and those who will be directly affected by the decision.' - Lord Steyn"
    },
    {
      "name": "R v Secretary of State for the Home Department, ex parte Simms [2000] UKHL 5",
      "keywords": ["human rights", "prisoners' rights", "freedom of expression", "restrictive measures", "right to information"]
    },
    {
      "name": "R v Secretary of State for the Home Department, ex parte Daly [2001] UKHL 26",
      "keywords": ["immigration law", "asylum seekers", "refugees", "human rights", "deportation"]
    },
    {
      "name": "Re S (FC) and others (FC) (Appellants) [2004] UKHL 47",
      "keywords": ["family law", "child custody", "best interests", "parental rights", "children's rights"]
    },
   {
      "name": "Macfarlane and Another v Tayside Health Board [2000] UKHL 55",
      "keywords": ["medical law", "consent", "doctor-patient relationship", "medical negligence", "treatment options"]
    },
    {
      "name": "R v DPP, ex parte Kebilene and Others [2000] UKHL 43",
      "keywords": ["criminal law", "terrorism", "human rights", "prosecution", "fair trial"]
    },
    {
      "name": "R v Shayler [2002] UKHL 11",
      "keywords": ["criminal law", "official secrets", "freedom of speech", "national security", "whistleblowing"]
    },
    {
      "name": "R (on the application of Williamson) v Secretary of State for Education and Employment [2005] UKHL 15",
      "keywords": ["education law", "religious education", "religious freedom", "state schools", "curriculum"]
    },
    {
      "name": "A and others v Secretary of State for the Home Department (No 2) [2005] UKHL 71",
      "keywords": ["immigration law", "detention", "asylum seekers", "human rights", "prolonged detention"]
    },
    {
      "name": "R (on the application of Countryside Alliance and others) v Attorney General and another [2007] UKHL 52",
      "keywords": ["constitutional", "freedom of expression", "protest rights", "hunting ban", "legislation"]
    },
    {
      "name": "R (on the application of Animal Defenders International) v Secretary of State for Culture, Media and Sport [2008] UKHL 15",
      "keywords": ["animal rights", "circuses", "wild animals", "licensing", "public entertainment"]
    },
    {
      "name": "R (on the application of Quintavalle) v Human Fertilisation and Embryology Authority [2005] UKHL 28",
      "keywords": ["medical law", "reproductive technology", "embryos", "genetic manipulation", "regulation"]
    },
    {
      "name": "R (on the application of Roberts) v Parole Board and another [2005] UKHL 45",
      "keywords": ["criminal law", "parole", "prisoners' rights", "risk assessment", "rehabilitation"]
    },
    {
      "name": "R (on the application of Playfoot) v Governing Body of Millais School [2007] EWHC 1698 (Admin)",
      "keywords": ["education law", "school uniform", "religious freedom", "discrimination", "human rights"]
    },
    {
      "name": "R (on the application of Corner House Research) v Director of the Serious Fraud Office [2008] UKHL 60",
      "keywords": ["criminal law", "corruption", "bribery", "investigation", "prosecution"]
    },
    {
      "name": "R (on the application of F) v Secretary of State for the Home Department [2010] UKSC 17",
      "keywords": ["immigration law", "deportation", "refugees", "human rights", "family life"]
    },
{
      "name": "R (on the application of Laporte) v Chief Constable of Gloucestershire [2006] UKHL 55",
      "keywords": ["police powers", "protest rights", "public order", "freedom of assembly", "policing methods"]
    },
    {
      "name": "R (on the application of Smith) v Secretary of State for Defence [2010] UKSC 29",
      "keywords": ["military law", "human rights", "armed conflict", "combat immunity", "torture"]
    },
    {
      "name": "R (on the application of Quila and another) v Secretary of State for the Home Department [2011] UKSC 45",
      "keywords": ["immigration law", "family life", "spousal visas", "marriage age", "human rights"]
    },
    {
      "name": "R (on the application of BA (Nigeria)) v Secretary of State for the Home Department [2009] UKSC 7",
      "keywords": ["immigration law", "deportation", "asylum seekers", "human rights", "refoulement"]
    },
    {
  "name": "Donoghue v Stevenson [1932] AC 562",
  "keywords": ["tort", "negligence", "duty of care", "neighbour principle"]
},
    {
  "name": "Caparo Industries plc v Dickman [1990] 2 AC 605",
  "keywords": ["tort", "negligence", "duty of care", "foreseeability", "proximity", "fairness"]
},
{
  "name": "Rylands v Fletcher [1868] UKHL 1",
  "keywords": ["tort", "strict liability", "non-natural use", "escape"]
},
{
  "name": "McLoughlin v O'Brian [1983] 1 AC 410",
  "keywords": ["tort", "negligence", "psychiatric harm", "secondary victims"]
},
{
  "name": "Bolam v Friern Hospital Management Committee [1957] 1 WLR 582",
  "keywords": ["tort", "negligence", "medical negligence", "standard of care", "Bolam test"]
},
{
  "name": "Bolton v Stone [1951] AC 850",
  "keywords": ["tort", "negligence", "risk", "reasonable person"]
},
{
  "name": "Hedley Byrne & Co Ltd v Heller & Partners Ltd [1964] AC 465",
  "keywords": ["tort", "negligent misstatement", "economic loss", "duty of care"]
},
{
  "name": "Wilkinson v Downton [1897] 2 QB 57",
  "keywords": ["tort", "intentional infliction of harm", "psychiatric harm"]
},
{
  "name": "Home Office v Dorset Yacht Co Ltd [1970] AC 1004",
  "keywords": ["tort", "negligence", "duty of care", "omissions", "third parties"]
},
{
  "name": "Anns v Merton London Borough Council [1978] AC 728",
  "keywords": ["tort", "negligence", "duty of care", "building regulations"]
},
{
  "name": "Nettleship v Weston [1971] 2 QB 691",
  "keywords": ["tort", "negligence", "standard of care", "learner driver"]
},
{
  "name": "Paris v Stepney Borough Council [1951] AC 367",
  "keywords": ["tort", "negligence", "standard of care", "employer's duty"]
},
{
  "name": "Overseas Tankship (UK) Ltd v Morts Dock and Engineering Co Ltd (The Wagon Mound) [1961] AC 388",
  "keywords": ["tort", "negligence", "remoteness of damage", "reasonable foreseeability"]
},
{
  "name": "Page v Smith [1996] AC 155",
  "keywords": ["tort", "negligence", "psychiatric harm", "foreseeability"]
},
{
  "name": "Muir v Glasgow Corporation [1943] AC 448",
  "keywords": ["tort", "negligence", "causation", "public authority liability"]
},
{
  "name": "Barnett v Chelsea & Kensington Hospital Management Committee [1969] 1 QB 428",
  "keywords": ["tort", "negligence", "causation", "but for test"]
},
{
  "name": "Lamb v Camden London Borough Council [1981] QB 625",
  "keywords": ["tort", "negligence", "economic loss", "consequential loss"]
},
{
  "name": "Junior Books Ltd v Veitchi Co Ltd [1983] 1 AC 520",
  "keywords": ["tort", "negligence", "economic loss", "duty of care"]
},
{
  "name": "Spring v Guardian Assurance plc [1995] 2 AC 296",
  "keywords": ["tort", "negligent misstatement", "economic loss", "employment references"]
},
{
  "name": "Smith v Leech Brain & Co Ltd [1962] 2 QB 405",
  "keywords": ["tort", "negligence", "thin skull rule", "remoteness of damage"]
},
{
  "name": "Robinson v Chief Constable of West Yorkshire Police [2018] UKSC 4",
  "keywords": ["tort", "negligence", "police immunity", "duty of care"]
},
{
  "name": "Hughes v Lord Advocate [1963] AC 837",
  "keywords": ["tort", "negligence", "remoteness of damage", "manner of occurrence"]
},
{
  "name": "Stovin v Wise [1996] AC 923",
  "keywords": ["tort", "negligence", "omissions", "public authority liability"]
},
{
  "name": "Titchener v British Railways Board [1984] 1 WLR 349",
  "keywords": ["tort", "negligence", "children", "standard of care"]
},
{
  "name": "Cambridge Water Co Ltd v Eastern Counties Leather plc [1994] 2 AC 264",
  "keywords": ["tort", "negligence", "remoteness of damage", "foreseeability", "environmental pollution"]
},
{
  "name": "Hill v Chief Constable of West Yorkshire [1989] AC 53",
  "keywords": ["tort", "negligence", "police immunity", "duty of care"]
},
{
  "name": "Murphy v Brentwood District Council [1991] 1 AC 398",
  "keywords": ["tort", "negligence", "economic loss", "duty of care", "property damage"]
},
{
  "name": "Watson v British Boxing Board of Control [2001] QB 1134",
  "keywords": ["tort", "negligence", "duty of care", "sporting injury"]
},
{
  "name": "McFarlane v Tayside Health Board (Scotland) [2000] 2 AC 59 (HL)",
  "keywords": ["tort", "negligence", "medical negligence", "wrongful birth"]
},
  {
    "name": "R v Dudley and Stephens (1884) 14 QBD 273 DC",
    "keywords": ["criminal", "necessity", "murder", "cannibalism", "shipwreck"]
  },
  {
    "name": "R v R [1992] 1 AC 599, HL",
    "keywords": ["criminal", "rape", "marital rape", "consent"]
  },
  {
    "name": "R v Gnango [2011] UKSC 59",
    "keywords": ["criminal", "joint enterprise", "murder", "transferred malice"]
  },
  {
    "name": "R v Brown [1994] 1 AC 212",
    "keywords": ["criminal", "consent", "sadomasochistic", "assault"]
  },
  {
    "name": "R v Woolin [1999] 1 AC 82, HL",
    "keywords": ["criminal", "murder", "mens rea", "oblique intention"]
  },
  {
    "name": "R v Ireland; R v Burstow [1998] AC 147",
    "keywords": ["criminal", "harassment", "psychological harm", "assault"]
  },
  {
    "name": "DPP v Majewski [1977] AC 443",
    "keywords": ["criminal", "voluntary intoxication", "basic intent", "assault"]
  },
  {
    "name": "R v Blaue [1975] 1 WLR 1411",
    "keywords": ["criminal", "thin skull rule", "manslaughter", "religious belief"]
  },
  {
    "name": "R v Savage; DPP v Parmenter [1992] 1 AC 699",
    "keywords": ["criminal", "mens rea", "assault", "grievous bodily harm"]
  },
  {
    "name": "R v G and Another [2004] 1 AC 1034",
    "keywords": ["criminal", "arson", "recklessness", "youth"]
  },
  {
    "name": "R v Mohan [1976] QB 1",
    "keywords": ["criminal", "mens rea", "driving", "intent"]
  },
  {
    "name": "R v Moloney [1985] 1 AC 905",
    "keywords": ["criminal", "murder", "mens rea", "intent"]
  },
  {
    "name": "R v Nedrick [1986] 1 WLR 1025",
    "keywords": ["criminal", "murder", "mens rea", "intent"]
  },
  {
    "name": "R v Hancock and Shankland [1986] AC 455",
    "keywords": ["criminal", "murder", "mens rea", "intent"]
  },
  {
    "name": "R v Matthews and Alleyne [2003] EWCA Crim 192",
    "keywords": ["criminal", "murder", "mens rea", "foresight"]
  },
    {
  "name": "Ashburn Anstalt v Arnold [1989] Ch 1",
  "keywords": ["land law", "proprietary estoppel", "unconscionability"]
},
{
  "name": "Baker v Baker [1993] 1 WLR 925",
  "keywords": ["land law", "trusts of land", "overreaching"]
},
{
  "name": "Bolton v Mahadeva [1972] 1 WLR 1009",
  "keywords": ["land law", "contractual obligations", "building contract"]
},
{
  "name": "Birmingham Midshires Mortgage Services Ltd v Sabherwal [2000] All ER (D) 180",
  "keywords": ["land law", "mortgages", "priorities"]
},
{
  "name": "Bruton v London and Quadrant Housing Trust [2000] 1 AC 406",
  "keywords": ["land law", "leases", "non-proprietary leases"]
},
{
  "name": "Carlton Credit Corporation Ltd v Wishaw Metal Co [1972] AC 661",
  "keywords": ["land law", "mortgages", "creditors"]
},
{
  "name": "City of London Building Society v Flegg [1988] AC 54",
  "keywords": ["land law", "overreaching", "trusts of land"]
},
{
  "name": "Cobbe v Yeoman's Row Management Ltd [2008] UKHL 55",
  "keywords": ["land law", "proprietary estoppel", "contracts for land"]
},
{
  "name": "Collins v Hertfordshire County Council [1947] Ch 598",
  "keywords": ["land law", "highways", "public rights of way"]
},
{
  "name": "Dillwyn v Llewelyn [1862] EWHC Ch J67",
  "keywords": ["land law", "gifts of land", "deeds"]
},
{
  "name": "Etridge (No.2) [2002] 2 AC 773",
  "keywords": ["land law", "undue influence", "mortgages"]
},
{
  "name": "Felthouse v Bindley [1862] EWHC CP J35",
  "keywords": ["land law", "contracts for land", "acceptance"]
},
{
  "name": "Gillett v Holt [2001] Ch 210",
  "keywords": ["land law", "proprietary estoppel", "equity"]
},
{
  "name": "Hamp v Bygrave [1983] 1 WLR 605",
  "keywords": ["land law", "adverse possession", "limitations"]
},
{
  "name": "Huntingdon v HM Attorney General [2002] EWHC 207",
  "keywords": ["land law", "public rights of way", "village greens"]
},
{
  "name": "Kingsnorth Finance v Tizard [1986] 1 WLR 783",
  "keywords": ["land law", "overreaching", "trusts of land"]
},
    {
"name": "Carlill v Carbolic Smoke Ball Company [1893] 1 QB 256",
"keywords": ["contract", "offer and acceptance", "unilateral contract", "consideration", "performance"]
},
{
"name": "Pharmaceutical Society of Great Britain v Boots Cash Chemists [1953] 1 QB 401",
"keywords": ["contract", "offer and acceptance", "self-service", "invitation to treat", "retail"]
},
{
"name": "Partridge v Crittenden [1968] 1 WLR 1204",
"keywords": ["contract", "offer and acceptance", "advertisement", "invitation to treat", "wild birds"]
},
{
"name": "Fisher v Bell [1961] 1 QB 394",
"keywords": ["contract", "offer and acceptance", "sale of goods", "invitation to treat", "criminal law"]
},
{
"name": "Smith v Hughes [1871] LR 6 QB 597",
"keywords": ["contract", "offer and acceptance", "mistake", "subjective intent", "objective intent"]
},
{
"name": "Harvey v Facey [1893] AC 552",
"keywords": ["contract", "offer and acceptance", "communication", "land", "reply"]
},
{
"name": "Entores Ltd v Miles Far East Corporation [1955] 2 QB 327",
"keywords": ["contract", "offer and acceptance", "communication", "telex", "crossed messages"]
},
{
"name": "Hyde v Wrench [1840] EWHC Ch J90",
"keywords": ["contract", "offer and acceptance", "counter-offer", "rejection", "bilateral contract"]
},
{
"name": "Household Fire and Carriage Accident Insurance Co Ltd v Grant [1879] 4 Ex D 216",
"keywords": ["contract", "offer and acceptance", "postal rule", "communication", "share allocation"]
},
{
"name": "Dunlop Pneumatic Tyre Co Ltd v Selfridge & Co Ltd [1915] AC 847",
"keywords": ["contract", "consideration", "third party rights", "privity", "restrictive covenant"]
},
{
"name": "Tweddle v Atkinson [1861] EWHC QB J57",
"keywords": ["contract", "consideration", "third party rights", "privity", "marriage"]
},
{
"name": "Williams v Roffey Bros & Nicholls (Contractors) Ltd [1991] 1 QB 1",
"keywords": ["contract", "consideration", "economic duress", "modification", "performance"]
},
{
"name": "Foakes v Beer [1884] UKHL 1",
"keywords": ["contract", "consideration", "part payment", "debt", "judgment"]
},
{
"name": "Hadley v Baxendale [1854] EWHC J70",
"keywords": ["contract", "damages", "foreseeability", "breach", "mitigation"]
},
    {
  "name": "Penn v Lord Baltimore (1750) 1 Ves Sen 444",
  "keywords": ["equity", "specific performance", "contract enforcement"]
},
{
  "name": "Tulk v Moxhay [1848] EWHC Ch J34",
  "keywords": ["equity", "real property", "covenant", "burden of covenant", "third party rights"]
},
{
  "name": "Errington v Errington & Woods [1952] 1 KB 290",
  "keywords": ["equity", "constructive trust", "contract", "part performance"]
},
{
  "name": "Walsh v Lonsdale (1882) 21 Ch D 9",
  "keywords": ["equity", "lease", "specific performance", "legal estate", "equitable estate"]
},
{
  "name": "Re Rose [1952] EWCA Civ 4",
  "keywords": ["equity", "trust", "voluntary settlement", "complete constitution of trusts"]
},
{
  "name": "Crabb v Arun District Council [1976] Ch 179",
  "keywords": ["equity", "estoppel", "property rights", "proprietary estoppel"]
},
{
  "name": "Carl Zeiss Stiftung v Rayner & Keeler Ltd (No 2) [1967] 1 AC 853",
  "keywords": ["equity", "trust", "constructive trust", "intellectual property"]
},
{
  "name": "FHR European Ventures LLP v Cedar Capital Partners LLC [2014] UKSC 45",
  "keywords": ["equity", "bribery", "constructive trust", "secret profits"]
},
{
  "name": "Paragon Finance Plc v DB Thakerar & Co [1999] 1 All ER 400",
  "keywords": ["equity", "fraud", "constructive trust", "breach of fiduciary duty"]
},
{
  "name": "Lloyds Bank v Rosset [1991] 1 AC 107",
  "keywords": ["equity", "constructive trust", "matrimonial home", "beneficial interest"]
},
{
  "name": "Re Vandervell’s Trusts (No 2) [1974] Ch 269",
  "keywords": ["equity", "trust", "resulting trust", "bare trust", "taxation"]
},
{
  "name": "Factortame Ltd v Secretary of State for Transport (No 2) [1991] 1 AC 603",
  "keywords": ["EU", "constitutional", "fishing rights", "supremacy of EU law", "interim relief"]
},
{
  "name": "R v Secretary of State for Transport, ex p Factortame (No 5) [2000] 1 AC 524",
  "keywords": ["EU", "constitutional", "damages", "fishing rights", "state liability"]
},
{
  "name": "Van Gend en Loos v Nederlandse Administratie der Belastingen [1963] ECR 1",
  "keywords": ["EU", "constitutional", "customs duties", "direct effect"]
},
{
  "name": "Costa v ENEL [1964] ECR 585",
  "keywords": ["EU", "constitutional", "nationalisation", "supremacy of EU law"]
},
{
  "name": "Marleasing SA v La Comercial Internacional de Alimentacion SA [1990] ECR I-4135",
  "keywords": ["EU", "constitutional", "interpretation", "indirect effect"]
},
{
  "name": "Unibet (London) Ltd v Justitiekanslern [2007] ECR I-2271",
  "keywords": ["EU", "gambling", "free movement of services", "proportionality"]
},
{
  "name": "Thoburn v Sunderland City Council [2002] EWHC 195 (Admin)",
  "keywords": ["EU", "constitutional", "metric weights", "implied repeal", "supremacy of EU law"]
},
{
  "name": "Viking Line ABP v International Transport Workers' Federation [2007] ECR I-10779",
  "keywords": ["EU", "employment", "freedom of establishment", "right to strike", "proportionality"]
},
{
  "name": "Laval un Partneri Ltd v Svenska Byggnadsarbetareförbundet [2007] ECR I-11767",
  "keywords": ["EU", "employment", "freedom to provide services", "right to strike", "proportionality"]
},
{
  "name": "R v Secretary of State for Employment, ex p Equal Opportunities Commission [1994] 1 AC 1",
  "keywords": ["EU", "employment", "equal pay", "judicial review", "direct effect"]
},
{
  "name": "Chen v Secretary of State for the Home Department [2004] ECR I-9925",
  "keywords": ["EU", "immigration", "right of residence", "self-sufficiency", "proportionality"]
},
  {
  "name": "Osman v United Kingdom [1998] ECHR 101",
  "keywords": ["duty to protect", "negligence", "right to life", "human rights"]
},
    {
  "name": "Douglas v Hello! Ltd [2001] EWCA Civ 595",
  "keywords": ["privacy", "freedom of expression", "celebrity", "copyright", "human rights"]
},
    {
  "name": "Hirst v United Kingdom (No 2) [2005] ECHR 681",
  "keywords": ["prisoners' rights", "right to vote", "democracy", "human rights"]
},
    {
  "name": "R (Gentle) v The Prime Minister [2008] UKHL 20",
  "keywords": ["Iraq war", "right to life", "military", "human rights"]
},
    {
  "name": "R (Quila and Bibi) v Secretary of State for the Home Department [2011] UKSC 45",
  "keywords": ["immigration", "right to family life", "marriage", "age discrimination", "human rights"]
},
{
"name": "White v White [2001] 1 AC 596",
"keywords": ["family law", "financial provision", "divorce", "equality"]
},
{
"name": "Miller v Miller; McFarlane v McFarlane [2006] UKHL 24",
"keywords": ["family law", "divorce", "financial provision", "spousal maintenance"]
},
{
"name": "W (Children) [2012] UKSC 60",
"keywords": ["family law", "child custody", "abduction", "Hague Convention"]
},
{
"name": "Wyatt v Vince [2015] UKSC 14",
"keywords": ["family law", "financial provision", "divorce", "time limit"]
},
{
"name": "Sharland v Sharland [2015] UKSC 60",
"keywords": ["family law", "financial provision", "divorce", "fraudulent non-disclosure"]
},
{
"name": "Gohil v Gohil [2015] UKSC 61",
"keywords": ["family law", "financial provision", "divorce", "fraudulent non-disclosure"]
},
{
"name": "Re B (A Child) [2013] UKSC 33",
"keywords": ["family law", "child welfare", "adoption", "parental consent"]
},
{
"name": "Re S (A Child) [2015] UKSC 20",
"keywords": ["family law", "child welfare", "parental rights", "contact"]
},
{
"name": "Re A (Children) (Conjoined Twins: Surgical Separation) [2001] 2 WLR 480",
"keywords": ["family law", "child welfare", "medical treatment", "right to life"]
},
{
"name": "G v G (Minors: Custody Appeal) [1985] 1 WLR 647",
"keywords": ["family law", "child custody", "Hague Convention", "parental abduction"]
},
{
"name": "Re J (A Minor) (Child Abduction: Custody Rights) [1990] 2 AC 562",
"keywords": ["family law", "child custody", "Hague Convention", "parental abduction"]
},
{
"name": "L v L (Abduction: Pending Criminal Proceedings) [2002] 1 FLR 653",
"keywords": ["family law", "child custody", "Hague Convention", "parental abduction"]
},
    {
"name": "Donovan v R [1934] AC 498",
"keywords": ["criminal law", "attempted crime", "actus reus", "mens rea"]
},
    {
"name": "Pepper v Hart [1993] AC 593",
"keywords": ["constitutional law", "legislative intent", "parliamentary debates", "statutory interpretation"]
},
    {
"name": "Balfour v Balfour [1919] 2 KB 571",
"keywords": ["contract law", "domestic agreements", "intention to create legal relations", "binding contracts"]
},
    {
"name": "Lloyds Bank v Bundy [1975] QB 326",
"keywords": ["property law", "proprietary estoppel", "promissory estoppel", "equitable rights"]
},
    {
"name": "Birmingham CC v Abdulla [2010] EWCA Civ 12",
"keywords": ["employment law", "equal pay", "gender discrimination", "comparators"]
},
    {
"name": "Sturges v Bridgman (1879) 11 Ch D 852",
"keywords": ["tort law", "nuisance", "reasonableness", "injunctive relief"]
},
    {
"name": "Donoghue v Folkestone Properties [2003] EWCA Civ 231",
"keywords": ["tort law", "occupier's liability", "duty of care", "trespassers"]
},
    {
"name": "R v Williams [1923] 1 KB 340",
"keywords": ["criminal law", "theft", "appropriation", "dishonesty"]
},
    {
"name": "Hunter v Canary Wharf [1997] AC 655",
"keywords": ["property law", "nuisance", "interference", "economic loss"]
},
   {
"name": "Thornton v Shoe Lane Parking [1971] 2 QB 163",
"keywords": ["contract law", "exemption clauses", "unfair terms", "noticeability"]
}, 
    {
"name": "R v Collins [1973] QB 100",
"keywords": ["criminal law", "possession of drugs", "custody and control", "knowledge"]
},
    {
"name": "R v Collins [1972] AC 307",
"keywords": ["criminal law", "theft", "appropriation", "dishonesty"]
},
    {
"name": "R (Pretty) v DPP [2001] UKHL 61",
"keywords": ["human rights law", "assisted suicide", "right to life", "proportionality"]
},
{
"name": "Royal Mail Group v Jhuti [2019] UKSC 55",
"keywords": ["employment law", "unfair dismissal", "whistleblowing", "knowledge of decision-maker"]
},
    {
"name": "Barnard v National Dock Labour Board [1953] 2 QB 18",
"keywords": ["employment law", "unfair dismissal", "collective agreements", "trade union"]
},
    {
"name": "Hill v Baxter [1958] 1 QB 277",
"keywords": ["criminal law", "actus reus", "mens rea", "automatism"]
},
{
"name": "R v Quick [1973] QB 910",
"keywords": ["criminal law", "theft", "appropriation", "consent"]
},
{
"name": "R v Cunningham [1957] 2 QB 396",
"keywords": ["criminal law", "maliciously", "reckless", "unlawful act manslaughter"]
},
    {
"name": "Attorney General v Blake [2000] 1 AC 268",
"keywords": ["contract law", "breach of confidence", "public interest", "damages"]
},
{
"name": "R v Hinks [2000] UKHL 53",
"keywords": ["criminal law", "theft", "appropriation", "property rights"]
},
{
"name": "Ashby v White [1703] 92 ER 126",
"keywords": ["constitutional law", "voting rights", "disenfranchisement", "tortious interference"]
},
{
"name": "Pinnel's Case (1602) 5 Co Rep 117a",
"keywords": ["contract law", "consideration", "part payment", "practical benefit"]
},
{
"name": "DPP v Smith [1961] AC 290",
"keywords": ["criminal law", "causation", "thin skull rule", "chain of causation"]
},
{
"name": "R v Bree [2007] EWCA Crim 256",
"keywords": ["criminal law", "sexual offenses", "consent", "reasonable belief"]
},
{
"name": "R v Shivpuri [1987] AC 1",
"keywords": ["criminal law", "attempted crime", "impossibility", "innocent agency"]
},
    {
"name": "Davies v Taylor [1974] AC 207",
"keywords": ["tort law", "vicarious liability", "employee-employer relationship", "course of employment"]
},
{
"name": "R v Riat [2017] EWCA Crim 176",
"keywords": ["criminal law", "sexual offenses", "consent", "reasonable belief"]
},
{
"name": "R v Blake [1997] QB 721",
"keywords": ["criminal law", "fraud", "deception", "appropriation"]
},
{
"name": "Williams v Bayley [1866] LR 1 HL 200",
"keywords": ["tort law", "trespass to land", "consent", "exclusive possession"]
},
{
"name": "R v Ghosh [1982] QB 1053",
"keywords": ["criminal law", "dishonesty", "theft", "objective test"]
},
    {
"name": "R v Terry [2017] EWCA Crim 1758",
"keywords": ["criminal law", "joint enterprise", "intention", "reasonable foreseeability"]
},
    {
"name": "White v Jones [1995] 2 AC 207",
"keywords": ["tort law", "negligence", "duty of care", "third-party liability"]
},
{
"name": "R v Paradine (1647) Aleyn 26",
"keywords": ["contract law", "frustration", "impossibility", "force majeure"]
},
{
"name": "R v Oakes [1986] 1 SCR 103",
"keywords": ["criminal law", "charter rights", "proportionality", "reasonable limits"]
},
{
"name": "R v Lambert [2002] 2 AC 545",
"keywords": ["criminal law", "strict liability", "mens rea", "presumption of innocence"]
},
    {
"name": "Hudson v Ridge Manufacturing Co [1957] 2 QB 348",
"keywords": ["employment law", "wrongful dismissal", "notice period", "breach of contract"]
},
{
"name": "R v Inland Revenue Commissioners, ex parte National Federation of Self-Employed and Small Businesses Ltd [1982] AC 617",
"keywords": ["constitutional law", "ultra vires", "judicial review", "legitimate expectations"]
},
{
"name": "McGhee v National Coal Board [1973] 1 WLR 1",
"keywords": ["tort law", "causation", "material contribution", "foreseeable harm"]
},
    {
"name": "R v Cambridge [1990] 3 All ER 219",
"keywords": ["criminal law", "attempted crime", "proximity test", "impossibility"]
},
{
"name": "Attorney-General's Reference (No 2 of 1992) [1993] 4 All ER 593",
"keywords": ["criminal law", "attempted crime", "substantial step", "inchoate offenses"]
},
{
"name": "R v Golding [2014] EWCA Crim 889",
"keywords": ["criminal law", "recklessness", "criminal damage", "foreseeable risk"]
},
{
"name": "Bell v Lever Bros [1932] AC 161",
"keywords": ["contract law", "offer and acceptance", "communication", "invitation to treat"]
},
  {
"name": "R (Alconbury Developments Ltd) v Secretary of State for the Environment, Transport and the Regions [2003] 2 AC 295",
"keywords": ["administrative law", "legitimate expectations", "planning permission", "procedural fairness"]
},
    {
"name": "R v Millward [1994] Crim LR 361",
"keywords": ["criminal law", "sexual offenses", "consent", "reasonable belief"]
},
{
"name": "Stannard v Gore [2012] EWHC 1655",
"keywords": ["tort law", "vicarious liability", "employee's personal motive", "course of employment"]
},
{
"name": "Woolmington v DPP [1935] AC 462",
"keywords": ["criminal law", "burden of proof", "presumption of innocence", "jury directions"]
},
    {
"name": "R v Grant [2006] UKHL 15",
"keywords": ["criminal law", "search and seizure", "police powers", "human rights"]
},
    {
"name": "Entick v Carrington [1765] EWHC KB J98",
"keywords": ["constitutional law", "unlawful search and seizure", "privacy"]
},
    {
"name": "Airedale NHS Trust v Bland [1993] AC 789",
"keywords": ["medical law", "end of life decisions", "best interests"]
},

{
"name": "Gillick v West Norfolk and Wisbech Area Health Authority [1986] AC 112",
"keywords": ["medical law", "consent", "parental rights"]
},
{
"name": "Asher v Whitlock [1865] LR 1 QB 1",
"keywords": ["contract law", "mistake", "mutual mistake", "rescission"]
},
    
{
"name": "Salomon v Salomon & Co Ltd [1897] AC 22",
"keywords": ["corporate law", "limited liability", "corporate personality"]
},
    {
"name": "Southwark London Borough Council v. Mills [1999] UKHL 47",
"keywords": ["housing law", "homelessness", "vulnerability", "accommodation duty"]
},
  {
"name": "Attorney General's Reference (No. 2 of 1999) [2001] UKHL 68",
"keywords": ["criminal law", "duress", "murder", "necessity"]
},
{
"name": "Barclays Bank v Quistclose Investments Ltd [1970] AC 567",
"keywords": ["trust law", "resulting trusts", "trust funds", "insolvency"]
},
{
"name": "Adams v Lindsell (1818) 1 B & Ald 681",
"keywords": ["contract law", "offer and acceptance", "postal rule"]
},
    {
"name": "Royal British Bank v Turquand (1856) 6 E&B 327",
"keywords": ["company law", "indoor management rule", "constructive notice", "ultra vires"]
},
    {
"name": "Ghaidan v Godin-Mendoza [2004] UKHL 30",
"keywords": ["human rights law", "discrimination", "sexual orientation", "civil partnerships"]
},
{
"name": "R (Hillingdon London Borough Council) v Secretary of State for Transport [2009] EWHC 2447 (Admin)",
"keywords": ["administrative law", "judicial review", "consultation", "third-party rights"]
},
{
"name": "Henderson v Merrett Syndicates Ltd [1995] 2 AC 145",
"keywords": ["contract law", "vicarious liability", "employees", "negligent acts"]
},
    {
"name": "R v G [2003] UKHL 50",
"keywords": ["criminal law", "infanticide", "diminished responsibility", "newborn baby"]
},
    {
"name": "Attorney General's Reference (No 1 of 1994) [1996] QB 113",
"keywords": ["criminal law", "attempted murder", "intention", "recklessness"]
},
    {
"name": "Derry v Peek (1889) 14 App Cas 337",
"keywords": ["contract law", "misrepresentation", "fraudulent statements", "share prospectus"]
},
{
"name": "Davies v Eli Lilly & Co Ltd [1987] QB 233",
"keywords": ["product liability", "pharmaceuticals", "drug safety", "defective products"]
},
    {
"name": "R v Rimmington [2006] UKHL 63",
"keywords": ["criminal law", "common assault", "mens rea", "transferred malice"]
},
    {
"name": "Jarvis v Swan Tours Ltd [1973] QB 233",
"keywords": ["contract law", "negligence", "duty of care", "holiday accidents"]
},
    {
"name": "Mortgage Corporation v Shaire [2001] EWCA Civ 1758",
"keywords": ["land law", "mortgages", "priority", "equitable interests"]
},
{
"name": "R (ProLife Alliance) v BBC [2004] UKHL 23",
"keywords": ["media law", "freedom of expression", "political advertising", "broadcasting"]
},
{
"name": "Attorney General v Guardian Newspapers (No 2) [1990] 1 AC 109",
"keywords": ["media law", "freedom of the press", "national security", "publication of classified information"]
},
    {
"name": "Central London Property Trust Ltd v High Trees House Ltd [1947] KB 130",
"keywords": ["contract law", "promissory estoppel", "part payment of debt", "reliance"]
},
    {
"name": "R v Gibbons and Proctor [1918] 13 Cr App R 134",
"keywords": ["criminal law", "omission", "duty to act", "parental responsibility"]
},
    {
"name": "R v Walker [1963] 1 QB 779",
"keywords": ["criminal law", "self-defense", "reasonable force", "immediate threat"]
},
    {
"name": "Merritt v Merritt [1970] 1 WLR 1211",
"keywords": ["contract law", "separation agreements", "intention to create legal relations", "enforceability"]
},
    {
"name": "R v Morgan Smith [2011] EWCA Crim 1922",
"keywords": ["criminal law", "voluntary manslaughter", "diminished responsibility", "substantial impairment"]
},
    {
"name": "R (A) v Secretary of State for Health [2002] EWCA Civ 1102",
"keywords": ["human rights law", "consent", "medical treatment", "mental capacity"]
},
    {
"name": "Malone v Metropolitan Police Commissioner [1979] Ch 344",
"keywords": ["privacy law", "surveillance", "telephone tapping", "human rights"]
},
    {
"name": "Ashford and St Peter's Hospitals NHS Foundation Trust v P and Others [2017] UKSC 22",
"keywords": ["medical law", "withdrawal of life-sustaining treatment", "best interests", "medical ethics"]
},
    {
"name": "R (S) v Chief Constable of South Yorkshire Police [2004] UKHL 39",
"keywords": ["human rights law", "police powers", "retention of DNA samples", "Article 8"]
},
    {
"name": "R v Clarkson (1989) 90 Cr App R 244",
"keywords": ["criminal law", "theft", "appropriation", "dishonesty"]
},
    {
"name": "R v Allen [1872] LR 1 CCR 367",
"keywords": ["criminal law", "attempted crime", "impossibility", "actus reus"]
},
    {
"name": "R v Howe [1987] AC 417",
"keywords": ["criminal law", "duress", "murder", "necessity"]
},
    {
"name": "R (Hicks) v Commissioner of Police for the Metropolis [2017] UKSC 9",
"keywords": ["human rights law", "protest", "freedom of expression", "Article 10 ECHR"]
},
    {
"name": "R v Wilson [1996] 2 Cr App R 241",
"keywords": ["criminal law", "consent", "body modification", "grievous bodily harm"]
},
    {
"name": "R (McGlinchey) v Secretary of State for Work and Pensions [2018] UKSC 51",
"keywords": ["social security law", "benefit sanctions", "human rights", "Article 8 ECHR"]
},
    {
"name": "Barton v Armstrong [1976] AC 104",
"keywords": ["tort law", "vicarious liability", "employee misconduct", "course of employment"]
},
    {
"name": "R v Gotts [1992] 2 AC 412",
"keywords": ["criminal law", "duress", "murder", "necessity"]
},
    {
"name": "R (Al-Saadoon) v Secretary of State for Defence [2010] UKSC 2",
"keywords": ["human rights law", "deprivation of liberty", "internment", "Article 5 ECHR"]
},
    {
"name": "R (on the application of Zambrano) v Secretary of State for the Home Department [2011] UKSC 4",
"keywords": ["EU law", "right to reside", "dependency", "non-EU citizen", "child's welfare"]
},
    {
"name": "Von Colson and Kamann v Land Nordrhein-Westfalen [1984] ECR 1891",
"keywords": ["EU law", "indirect effect", "national authorities", "compensation", "gender discrimination"]
},
  {
"name": "R v Secretary of State for the Home Department, ex parte Tham [2000] 1 WLR 2229",
"keywords": ["EU law", "family member", "right of residence", "citizenship", "refusal of entry"]
},
{
"name": "R (on the application of British Telecommunications plc) v Secretary of State for Trade and Industry [2004] ECR I-8769",
"keywords": ["EU law", "competition law", "telecommunications", "market dominance", "abuse of power"]
},
{
"name": "R v Secretary of State for the Home Department, ex parte Sivakumaran [1988] 1 AC 958",
"keywords": ["EU law", "free movement", "employment rights", "family member", "social security"]
},
    {
"name": "R (on the application of Berlioz Investment Fund SA) v Secretary of State for Trade and Industry [2004] UKHL 51",
"keywords": ["EU law", "company law", "cross-border merger", "shareholders' rights", "protection"]
},
{
"name": "R (on the application of Rahmatullah) v Secretary of State for Foreign and Commonwealth Affairs [2017] UKSC 35",
"keywords": ["EU law", "human rights", "extradition", "diplomatic assurances", "torture risk"]
},
   {
"name": "R (on the application of Eba) v Advocate General for Scotland [2011] UKSC 29",
"keywords": ["EU law", "preliminary reference", "national court", "jurisdiction", "interpretation"]
},
{
"name": "R (on the application of Webster) v Norfolk County Council [2009] UKSC 11",
"keywords": ["EU law", "equal pay", "gender discrimination", "local government", "employment"]
},
{
"name": "R (on the application of Wainwright) v Home Secretary [2004] UKHL 53",
"keywords": ["EU law", "mutual recognition", "criminal justice", "extradition", "human rights"]
},
{
"name": "R (on the application of Data Protection Commissioner) v Facebook Ireland Ltd and Maximillian Schrems [2020] UKSC 17",
"keywords": ["EU law", "data protection", "privacy", "transfers", "standard contractual clauses"]
},
{
"name": "R (on the application of Pringle) v Government of the United Kingdom [2013] UKSC 60",
"keywords": ["EU law", "economic and monetary union", "Eurozone", "bailout", "financial stability"]
},
    {
"name": "R (on the application of Rosneft) v HM Treasury [2015] UKSC 3",
"keywords": ["EU law", "sanctions", "freezing orders", "Russia", "asset freeze"]
},
{
"name": "R (on the application of Lumsdon) v Legal Services Board [2015] UKSC 41",
"keywords": ["EU law", "legal profession", "regulation", "mutual recognition", "services directive"]
},
    {
"name": "R (on the application of Robinson) v Secretary of State for Northern Ireland [2002] UKHL 32",
"keywords": ["EU law", "freedom of movement", "citizenship", "residence rights", "discrimination"]
},
    {
"name": "Smith v Eric S Bush [1990] 1 AC 831",
"keywords": ["property law", "overreaching", "bona fide purchaser", "registered land"]
},
{
"name": "Peek v Gurney (1873) LR 6 HL 377",
"keywords": ["company law", "misrepresentation", "fraudulent prospectus"]
},
    {
      "name": "McDonald's Corporation v Steel & Morris [1997] EWHC 366 (QB)",
      "keywords": ["tort", "libel", "right to a fair trial", "environmental"]
    },
 {
"name": "Royal Bank of Scotland v Wilson [2015] UKSC 50",
"keywords": ["banking law", "misrepresentation", "loan agreements", "common law duty"]
},
    {
"name": "Salomon v A Salomon & Co Ltd [1897] AC 22",
"keywords": ["corporate personality", "separate legal entity", "limited liability"]
},
{
"name": "Lee v Lee's Air Farming Ltd [1961] AC 12",
"keywords": ["corporate veil", "separate legal entity", "piercing the corporate veil"]
},
{
"name": "Foss v Harbottle (1843) 2 Hare 461",
"keywords": ["majority rule", "derivative action", "minority shareholder protection"]
},
{
"name": "Ashbury Railway Carriage and Iron Co Ltd v Riche (1875) LR 7 HL 653",
"keywords": ["ultra vires", "capacity", "memorandum of association", "objects clause"]
},
{
"name": "Royal British Bank v Turquand (1856) 6 E&B 327",
"keywords": ["indoor management rule", "constructive notice", "outsider's protection"]
},
{
"name": "Re Duomatic Ltd [1969] 2 Ch 365",
"keywords": ["informal unanimous consent", "shareholder resolution", "corporate decision-making"]
},
{
"name": "Re City Equitable Fire Insurance Co Ltd [1925] Ch 407",
"keywords": ["fraudulent trading", "wrongful trading", "directors' duties", "insolvency"]
},
{
"name": "Re F and Another (Children) (FC) (Respondents) [2008] UKHL 40",
"keywords": ["corporate fiduciary duty", "director's duty to act in the best interests of the company"]
},
{
"name": "Allen v Gold Reefs of West Africa Ltd [1900] 1 Ch 656",
"keywords": ["directors' powers", "proper purpose", "fiduciary duties", "conflict of interest"]
},
{
"name": "Gilford Motor Co Ltd v Horne [1933] Ch 935",
"keywords": ["sham director", "evasion of legal obligations", "corporate personality"]
},
{
"name": "Adams v Cape Industries plc [1990] Ch 433",
"keywords": ["separate legal entity", "corporate group liability", "lifting the corporate veil"]
},
{
"name": "Re Smith and Fawcett Ltd [1942] Ch 304",
"keywords": ["directors' duties", "duty of loyalty", "conflict of interest", "secret profits"]
},
{
"name": "Re Barings plc (No 5) [1999] 1 BCLC 433",
"keywords": ["directors' duties", "negligence", "corporate governance", "risk management"]
},
{
"name": "Re Paramount Airways Ltd [1993] BCLC 799",
"keywords": ["corporate insolvency", "wrongful trading", "directors' liability", "liquidation"]
},
    {
"name": "Re Halt Garage (1964) Ltd [1982] Ch 610",
"keywords": ["shareholder oppression", "unfair prejudice", "minority shareholder rights"]
},
{
"name": "Brandsma v Cavendish Residential Ltd [2017] EWHC 404 (Ch)",
"keywords": ["shareholder disputes", "unjustified prejudice", "breach of director's duties"]
},
{
"name": "Ebrahimi v Westbourne Galleries Ltd [1973] AC 360",
"keywords": ["oppression of minority shareholders", "just and equitable winding up"]
},
{
"name": "Re Brian D Pierson (Contractors) Ltd [1997] 2 BCLC 727",
"keywords": ["wrongful distribution of assets", "return of unlawful dividends", "insolvent liquidation"]
},
{
"name": "Russell v Northern Bank Development Corp Ltd [1992] 1 WLR 588",
"keywords": ["shareholder liability", "ultra vires transactions", "ratification"]
},
    {
"name": "Re Hydrodan (Corby) Ltd [1994] 2 BCLC 180",
"keywords": ["oppressive conduct", "unfairly prejudicial", "minority shareholder rights"]
},
{
"name": "Secretary of State for Trade and Industry v Bottrill [1999] 1 BCLC 702",
"keywords": ["director disqualification", "unfit conduct", "breach of fiduciary duties"]
},
{
"name": "Said v Butt [2004] EWHC 2001 (Ch)",
"keywords": ["shareholder disputes", "unfair prejudice petition", "just and equitable winding up"]
},
{
"name": "Briggs v James Hardie & Co Pty Ltd [1989] 3 All ER 758",
"keywords": ["corporate veil", "parent company liability", "group structure"]
},
{
"name": "Bilta (UK) Ltd (in liquidation) v Nazir [2015] UKSC 23",
"keywords": ["fraudulent trading", "wrongful trading", "directors' duties", "insolvency"]
},
    {
"name": "Jameel (Mohammed) v Wall Street Journal Europe Sprl [2006] UKHL 44",
"keywords": ["defamation", "freedom of expression", "qualified privilege", "media liability", "public interest"]
},
{
"name": "Marks and Spencer plc v BNP Paribas Securities Services Trust Co (Jersey) Ltd [2015] UKSC 72",
"keywords": ["contract law", "implied terms", "business leases", "rent", "termination"]
},
{
"name": "Gilford Motor Co Ltd v Horne [1933] Ch 935",
"keywords": ["company law", "restraint of trade", "fiduciary duty", "confidential information", "employee obligations"]
},
    {
"name": "Transocean Drilling UK Ltd v Providence Resources Plc [2016] EWCA Civ 372",
"keywords": ["contract law", "force majeure", "frustration", "breach of contract", "offshore drilling"]
},
    {
"name": "Unilever plc v Procter & Gamble Co [2000] 1 WLR 2436",
"keywords": ["advertising", "comparative advertising", "misleading statements", "intellectual property", "consumer protection"]
},
{
"name": "British Crane Hire Corporation Ltd v Ipswich Plant Hire Ltd [1975] QB 303",
"keywords": ["contract law", "offer and acceptance", "consideration", "formation of contract", "hire purchase agreement"]
},
    {
"name": "FHR European Ventures LLP v Cedar Capital Partners LLC [2014] UKSC 45",
"keywords": ["fiduciary duty", "secret profits", "agency", "conflict of interest", "commercial property"]
},
{
"name": "Mercury Communications Ltd v Director General of Telecommunications [1996] 1 WLR 48",
"keywords": ["telecommunications", "competition law", "market dominance", "abuse of dominance", "regulatory powers"]
},
{
"name": "Société Générale v Geys [2012] UKSC 63",
"keywords": ["financial services", "misrepresentation", "contractual terms", "banking transactions", "liability limitation"]
},
{
"name": "Takacs v Barclays Services Jersey Ltd [2005] UKPC 53",
"keywords": ["employment law", "wrongful dismissal", "compensation", "constructive dismissal", "remedies"]
},
{
"name": "Associated Newspapers Ltd v Bancks [1951] 2 KB 291",
"keywords": ["copyright", "newspaper publication", "fair dealing", "prior art", "originality"]
},
{
"name": "St Albans City and District Council v International Computers Ltd [1996] 4 All ER 481",
"keywords": ["government contracts", "procurement", "tender process", "breach of contract", "damages"]
},
{
"name": "Hickman v Kent or Romney Marsh Sheep-Breeders' Association [1915] 1 Ch 881",
"keywords": ["trade association", "membership expulsion", "unfair prejudice", "due process", "breach of rules"]
},
    {
"name": "Autoclenz Ltd v Belcher and Others [2011] UKSC 41",
"keywords": ["employment status", "self-employment", "contractual terms", "worker's rights"]
},
{
"name": "Royal Mail Group Ltd v Communication Workers Union [2009] UKHL 69",
"keywords": ["collective bargaining", "industrial action", "trade union", "employment dispute"]
},
{
"name": "Walker v Innospec Ltd and others [2017] UKSC 47",
"keywords": ["pension rights", "equality", "sexual orientation", "discrimination"]
},
{
"name": "Cox v Ministry of Justice [2016] UKSC 10",
"keywords": ["working time regulations", "overtime pay", "part-time workers", "EU law"]
},
{
"name": "Redundancy Payments Service v Edmunds and others [2017] UKSC 9",
"keywords": ["redundancy", "insolvency", "employee compensation", "statutory rights"]
},
{
"name": "Addison Lee Ltd v Gascoigne [2018] EWCA Civ 1535",
"keywords": ["employment status", "gig economy", "worker's rights", "employment tribunal"]
},
{
"name": "Smith v Manchester College [2011] EWCA Civ 168",
"keywords": ["unfair dismissal", "procedural fairness", "disciplinary procedure", "employee rights"]
},
{
"name": "Aslam and others v Uber BV and others [2016] ET 2202550/2015",
"keywords": ["employment status", "gig economy", "worker's rights", "self-employment"]
},
{
"name": "British Airways plc v Williams and others [2012] UKSC 43",
"keywords": ["holiday pay", "annual leave", "working time regulations", "EU law"]
},
{
"name": "BHS Ltd (in administration) v Burchell [2017] UKEAT 0099_17_2111",
"keywords": ["unfair dismissal", "misconduct", "reasonableness", "employee dismissal"]
},
{
"name": "Gilham v Ministry of Justice [2019] UKSC 44",
"keywords": ["whistleblowing", "public interest", "protected disclosure", "employee rights"]
},
{
"name": "Williams v Trustees of Swansea University Pension and Assurance Scheme [2018] UKSC 65",
"keywords": ["pension scheme", "equality", "age discrimination", "retirement age"]
},
    {
"name": "Essop and Others v Home Office (UK Border Agency) [2017] UKSC 27",
"keywords": ["indirect discrimination", "employment practices", "race", "disadvantage"]
},
{
"name": "City of York Council v Grosset [2018] UKSC 29",
"keywords": ["disability discrimination", "reasonable adjustments", "employee dismissal", "disciplinary procedure"]
},
{
"name": "Mohamud v WM Morrison Supermarkets plc [2016] UKSC 11",
"keywords": ["vicarious liability", "employee misconduct", "employer's responsibility", "tort law"]
},
{
"name": "Smith v Pimlico Plumbers Ltd and another [2018] UKSC 29",
"keywords": ["employment status", "self-employment", "worker's rights", "contractual terms"]
},
{
"name": "Hussain and Others v A2 Dominion Homes Ltd [2020] EWCA Civ 7",
"keywords": ["holiday pay", "overtime", "guaranteed hours", "working time regulations"]
},
{
"name": "Metroline West Ltd v Ajaj [2015] EWCA Civ 8",
"keywords": ["working time regulations", "rest breaks", "daily rest", "compensation"]
},
{
"name": "Horton v Sadler [2006] EWCA Civ 407",
"keywords": ["constructive dismissal", "breach of contract", "employee resignation", "unfair treatment"]
},
{
"name": "Perkins v The Best Connection Group Ltd [2019] EWCA Civ 2356",
"keywords": ["agency workers", "equal treatment", "employment rights", "fixed-term contracts"]
},
{
"name": "Bear Scotland Ltd and Others v Fulton and Others [2015] UKSC 30",
"keywords": ["holiday pay", "overtime", "unlawful deductions", "working time regulations"]
},
{
"name": "United First Partners Research v Carreras [2020] EWCA Civ 493",
"keywords": ["non-compete clause", "restraint of trade", "employee restrictions", "contractual obligations"]
},
{
"name": "Re B (A Child) (Habitual Residence) [2016] UKSC 4",
"keywords": ["family law", "child custody", "Hague Convention", "habitual residence"]
}
  ]
}
