{
  "cases": [
     {
    "name": "R (on the application of Begum) (Respondent) v Secretary of State for the Home Department (Appellant) [2021] UKSC 7",
    "keywords": ["immigration", "dual national", "national security", "citizenship", "human rights"],
    "summary": "<strong>Facts</strong><br>• Shamima Begum was a British citizen who left the UK to join ISIS in Syria.<br>• In 2019, the Home Secretary revoked her citizenship on the basis that she was a security threat to the UK.<br>• Begum challenged this decision in court, arguing that it made her stateless and that she could not effectively challenge it from Syria.<br>• The Court of Appeal found that the decision was unlawful because it rendered Begum stateless and because she would not be able to have a fair and effective appeal against it.<br><br><strong>Issues</strong><br>• The main issues in the case were whether the Home Secretary's decision to revoke Begum's citizenship was lawful, and whether it breached her right to a fair and effective appeal.<br>• The Home Secretary argued that the decision was taken in the interests of national security, and that Begum was not rendered stateless because she was entitled to Bangladeshi citizenship through her parents.<br>• Begum argued that she was effectively stateless because she had never been to Bangladesh and did not have any connection to the country.<br>• She also argued that she could not effectively challenge the decision from Syria, where she was living in a refugee camp without access to legal representation or evidence.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously allowed the Home Secretary's appeal against the Court of Appeal's decision.<br>• The Court found that the decision to revoke Begum's citizenship did not breach her right to a fair and effective appeal because she could pursue her case from Syria with the assistance of lawyers and that the decision did not render her stateless as she could claim Bangladeshi citizenship.<br><br><strong>Key passage(s)</strong><br>• 'the right to a fair hearing does not trump all other considerations, such as the safety of the public. If a vital public interest makes it impossible for a case to be fairly heard then the courts cannot ordinarily hear it. The appropriate response to the problem in the present case is for the deprivation appeal to be stayed until Ms Begum is in a position to play an effective part in it without the safety of the public being compromised.' (Lord Reed, paragraph 50)"
     },
    {
      "name": "R (on the application of Miller) (Appellant) v The Prime Minister (Respondent) [2019] UKSC 41",
      "keywords": ["constitutional", "Brexit", "parliamentary sovereignty", "judicial review", "separation of powers"],
      "summary": "<strong>Facts</strong><br>• Following the referendum vote to leave the European Union (EU) in 2016, the UK government triggered Article 50 of the Treaty on European Union, beginning the process of leaving the EU.<br>• The Prime Minister, Boris Johnson, advised the Queen to prorogue (suspend) Parliament for five weeks, claiming it was necessary to prepare a new legislative agenda.<br>• However, the suspension was challenged by Gina Miller, who argued that it was an unlawful abuse of power by the Prime Minister to prevent parliamentary scrutiny of Brexit.<br><br><strong>Issues</strong><br>• The central issue in this case was whether the advice given by the Prime Minister to the Queen to prorogue Parliament was justiciable (capable of being reviewed by the courts) and, if so, whether it was lawful.<br>• Miller argued that the Prime Minister's advice was unlawful because it had the effect of frustrating or preventing the constitutional role of Parliament in holding the government to account.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously held that the Prime Minister's advice to prorogue Parliament was unlawful because it had the effect of frustrating or preventing the constitutional role of Parliament without reasonable justification.<br>• The prorogation was therefore void and of no effect.<br>• The Court also held that the advice was justiciable, meaning that the courts have the power to review it.<br><br><strong>Key passage(s)</strong><br>• 'The Prime Minister's advice to Her Majesty was unlawful, void and of no effect. This means that the Order in Council to which it led was also unlawful, void and of no effect and should be quashed. This means that when the Royal Commissioners walked into the House of Lords it was as if they walked in with a blank sheet of paper. The prorogation was also void and of no effect. Parliament has not been prorogued' (Lady Hale).<br>• 'The longer that Parliament stands prorogued, the greater the risk that responsible government may be replaced by unaccountable government: the antithesis of the democratic model' (Lady Hale)."
    },
    {
      "name": "R (on the application of Privacy International) (Appellant) v Investigatory Powers Tribunal and others (Respondents) [2019] UKSC 22",
      "keywords": ["surveillance", "privacy rights", "human rights", "data protection", "intelligence agencies"],
      "summary": "<strong>Facts</strong><br>• Privacy International, a human rights organization, brought a claim against the Investigatory Powers Tribunal (IPT) and other defendants, challenging the lawfulness of the regime for the interception and use of communications data under the Regulation of Investigatory Powers Act 2000 (RIPA).<br>• The IPT is a judicial body responsible for hearing complaints against the intelligence services.<br>• Privacy International argued that the IPT's decisions were not subject to adequate judicial scrutiny and that RIPA was incompatible with EU law.<br><br><strong>Issues</strong><br>• The main issue was whether RIPA provided an adequate legal framework for the interception and use of communications data, and whether the IPT's decisions were subject to adequate judicial scrutiny.<br>• Privacy International argued that the regime was incompatible with EU law and violated the right to privacy, while the defendants argued that the regime was necessary for national security and subject to sufficient safeguards.<br><br><strong>Decision</strong><br>• The Supreme Court held that RIPA was incompatible with EU law because it did not provide for an independent body to authorize the interception of communications data, and because it did not require prior review by a court or independent administrative body.<br>• The Court also held that the IPT did not provide adequate judicial scrutiny of the intelligence services' activities, as it did not have the power to quash decisions or provide effective remedies for violations of human rights.<br>• However, the Court declined to make a formal declaration of incompatibility, as the relevant provisions had already been replaced by the Investigatory Powers Act 2016.<br><br><strong>Key passage(s)</strong><br>• 'The IPT is not a true court … [it] does not have the power to quash decisions or provide effective remedies for violations of human rights' (Lord Carnwath)<br>• 'The 2000 Act did not lay down clear and precise rules providing for access to and use of communications data … the access and use of that data was not limited to what was strictly necessary' (Lady Hale)"
    },
    {
      "name": "R (on the application of Bancoult No 3) (Appellant) v Secretary of State for Foreign and Commonwealth Affairs (Respondent) [2018] UKSC 3",
      "keywords": ["international law", "territorial sovereignty", "human rights", "colonialism", "Chagossian people"],
      "summary": "<strong>Facts</strong><br>• The Chagossian Islanders were forcibly removed from the Chagos Archipelago by the UK government in the late 1960s and early 1970s in order to make way for a US military base. The UK government declared the Chagos Archipelago a British Indian Ocean Territory (BIOT) in 1965.<br>• The appellant, Bancoult, a Chagossian, sought judicial review of the UK government's decision not to allow Chagossians to resettle in the BIOT.<br><br><strong>Issues</strong><br>• The main issue was whether the decision made by the UK government not to allow resettlement was lawful.<br>• Bancoult argued that the decision was unlawful because it was based on a flawed consultation process and was in breach of the European Convention on Human Rights.<br>• The Secretary of State argued that the decision was lawful and that the European Convention on Human Rights did not apply to the BIOT.</strong><br><br><strong>Decision</strong><br>• The Supreme Court dismissed Bancoult's appeal.<br>• The Court held that the decision not to allow resettlement was lawful and that the European Convention on Human Rights did not apply to the BIOT.<br>• The Court found that the consultation process was flawed, but that this did not render the decision unlawful.<br><br><strong>Key passage(s)</strong><br>• 'The concept of a 'colony' is a relic of the past. The manner in which the Chagossians were removed from the Chagos Archipelago, and the appalling conditions in which they were thereafter forced to live, are a stain on the history of our country. Nevertheless, as a matter of law, the actions of the executive and the legislature, in relation to the designation and governance of the BIOT, cannot be impugned' (Lord Mance, para. 1).<br>• 'The European Convention on Human Rights does not apply to acts or omissions of the Crown in relation to the BIOT or any other overseas territory, except to the extent provided by orders made under section 2(2) of the Human Rights Act 1998' (Lord Mance, para. 65)."
    },
    {
      "name": "R (on the application of UNISON) (Appellant) v Lord Chancellor (Respondent) [2017] UKSC 51",
      "keywords": ["employment law", "trade unions", "collective bargaining", "workers' rights", "judicial review"],
      "summary": "<strong>Facts</strong><br>• The case of R (on the application of UNISON) (Appellant) v Lord Chancellor (Respondent) [2017] UKSC 51 involved a challenge to the lawfulness of employment tribunal fees introduced in 2013.<br>• The fees, which ranged from £390 to £1200, were required to be paid by claimants in order to bring a claim before an employment tribunal.<br>• UNISON argued that the fees hindered access to justice and were discriminatory against women and other protected groups.<br><br><strong>Issues</strong><br>• The main issue in the case was whether the employment tribunal fees were unlawful and discriminatory.<br>• UNISON argued that the fees were a violation of the principle of access to justice, as they prevented workers from enforcing their employment rights.<br>• The Lord Chancellor argued that the fees were necessary to reduce the burden on taxpayers and to deter frivolous claims.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously held that the employment tribunal fees were unlawful and discriminatory.<br>• The court found that the fees had prevented access to justice and discriminated against women, as they were more likely to bring low-value claims that were disproportionately affected by the fees.<br>• The court also found that the fees were not reasonably necessary to achieve the stated policy goals of reducing the burden on taxpayers and deterring frivolous claims.<br><br><strong>Key passage(s)</strong><br>• 'The constitutional right of access to the courts is inherent in the rule of law. The importance of the rule of law is not always understood. Indications of a lack of understanding include the assumption that the administration of justice is merely a public service like any other, that courts and tribunals are providers of services to the “users” who appear before them, and that the provision of those services is of value only to the users themselves and to those who are remunerated for their participation in the proceedings. The extent to which that viewpoint has gained currency in recent times is apparent from the consultation papers and reports discussed earlier. It sometimes seems as though Lord Woolf’s reforms, which were designed to enable the courts to serve the people better, have turned into a mechanism for the management of the justice system in the interests of the efficiency of the courts rather than in the interests of the people for whose benefit the courts exist.' (para. 64, Lord Reed)"
    },
    {
      "name": "R (on the application of Miller and another) (Respondents) v Secretary of State for Exiting the European Union (Appellant) [2017] UKSC 5",
      "keywords": ["constitutional", "Brexit", "parliamentary sovereignty", "EU law", "triggering Article 50"],
      "summary": "<strong>Facts</strong><br>• This case concerned the legality of the UK government triggering Article 50 of the Treaty on European Union, which would begin the process of leaving the EU.<br>• The claimants argued that the government could not trigger Article 50 without an Act of Parliament.<br>• The government argued that it had the power to trigger Article 50 under the royal prerogative.<br><br><strong>Issues</strong><br>• The main issue was whether the government had the power to trigger Article 50 without an Act of Parliament.<br>• The claimants argued that triggering Article 50 would result in a change in domestic law and therefore required parliamentary approval.<br>• The government argued that the royal prerogative allowed it to make and unmake treaties without the need for parliamentary approval.<br><br><strong>Decision</strong><br>• The Supreme Court ruled in favour of the claimants, stating that an Act of Parliament was required before the government could trigger Article 50.<br>• The court held that triggering Article 50 would result in a change in domestic law, and that the royal prerogative could not be used to change domestic law.<br>• The court also held that the European Communities Act 1972, which gave effect to EU law in the UK, could not be repealed without an Act of Parliament.<br><br><strong>Key passage(s)</strong><br>• 'The change in the law required to implement the referendum's outcome must be made in the only way permitted by the UK constitution, namely by legislation' - Lord Neuberger (para. 26)<br>• 'The 1972 Act provides that rights enjoyed by UK residents by virtue of the UK's membership of the EU were created by a source of law which also forms part of UK law. Hence, withdrawal from the EU would remove some existing domestic rights of UK residents, and the government cannot lawfully remove rights granted by Parliament unless Parliament permits it to do so' - Lord Clarke (para. 114)"
    },
    {
      "name": "R v Jogee (Appellant) [2016] UKSC 8",
      "keywords": ["criminal law", "joint enterprise", "accessorial liability", "mens rea", "overturning precedent"],
      "summary": "<strong>Facts</strong><br>• In R v Jogee (Appellant) [2016] UKSC 8, two men, Jogee and Ruddock, were convicted of murder after they burgled a house and Ruddock fatally stabbed the homeowner.<br>• The trial judge instructed the jury that if they found that Jogee was a party to the crime, he would be guilty of murder as well.<br>• This was based on the doctrine of joint enterprise, which holds that if two or more people are jointly involved in a crime, they are all equally responsible for any foreseeable consequences, including murder.<br><br><strong>Issues</strong><br>• The central issue in the case was whether the doctrine of joint enterprise had been applied too widely.<br>• Jogee argued that the law had been misinterpreted and that he should not have been convicted of murder simply on the basis of his involvement in the burglary.<br>• The prosecution argued that the doctrine was an important tool for holding criminals accountable and should not be abolished or restricted.<br><br><strong>Decision</strong><br>• The UK Supreme Court ruled that the doctrine of joint enterprise had been wrongly interpreted by the courts for over 30 years.<br>• They held that the doctrine had been applied too widely and that it was not enough to simply prove that someone was involved in a crime in order to convict them of murder.<br>• Instead, the prosecution needed to prove that the defendant had intended to commit murder or had foreseen that murder was a possible consequence of their actions.<br>• The court also held that the doctrine should not be abolished entirely, as it played an important role in certain cases.<br><br><strong>Key passage(s)</strong><br>• 'The law took a wrong turn in 1984 when the Privy Council decided in Chan Wing-Siu that foresight of consequences was sufficient to establish the necessary intent for secondary liability in murder.' (Lord Neuberger, para. 20)<br>• 'In our judgment, the correct interpretation of the law is that a person who assists or encourages another to commit a crime is criminally liable for any acts committed in the course of that crime which are a natural and foreseeable consequence of what was agreed between them.' (Lord Hughes, para. 95)"
    },
    {
      "name": "Montgomery (Appellant) v Lanarkshire Health Board (Respondent) (Scotland) [2015] UKSC 11",
      "keywords": ["medical law", "informed consent", "doctor's duty", "patient autonomy", "medical negligence"],
      "summary": "<strong>Facts</strong><br>• Nadine Montgomery has diabetes and was pregnant with her son during 1999.<br>• Her son was born with severe disabilities after a difficult delivery.<br>• Montgomery claimed that the doctors did not inform her of the risk of shoulder dystocia, which is a condition where the baby’s shoulder gets stuck during delivery. This condition is more likely to occur in women with diabetes.<br><br><strong>Issues</strong><br>• The key issue was whether the doctors had a duty to disclose the risk of shoulder dystocia to Montgomery.<br>• The doctors argued that they had acted in accordance with their usual practice, which did not include informing patients of the risk of shoulder dystocia.<br>• They also argued that a warning would have led to Montgomery requesting a caesarean section, which would have been riskier for her and her baby.<br><br><strong>Decision</strong><br>• The Supreme Court held that the doctors had a duty to disclose the risk of shoulder dystocia to Montgomery.<br>• The court stated that doctors have a duty to take reasonable care to ensure that patients are aware of any material risks involved in any recommended treatment, and of any reasonable alternative or variant treatments.<br>• The court also held that the doctor's usual practice was not enough to discharge their duty to provide Montgomery with the information she needed to make an informed decision about her treatment.<br>• The court found that Montgomery would have chosen to have a caesarean section if she had been informed of the risks.<br><br><strong>Key passage(s)</strong><br>• 'An adult person of sound mind is entitled to decide which, if any, of the available forms of treatment to undergo, and her consent must be obtained before treatment interfering with her bodily integrity is undertaken. The doctor is therefore under a duty to take reasonable care to ensure that the patient is aware of any material risks involved in any recommended treatment, and of any reasonable alternative or variant treatments. The test of materiality is whether, in the circumstances of the particular case, a reasonable person in the patient's position would be likely to attach significance to the risk, or the doctor is or should reasonably be aware that the particular patient would be likely to attach significance to it.' (Lord Kerr)<br>• 'Neither the doctor nor the patient is the arbiter of objective reasonableness. The assessment of what risks and benefits would be reasonable to disclose, and how they should be presented and assessed, in any given case is a matter for expert judgment. In making that assessment, the doctor must take into account the characteristics of the patient, including her age, her sex, her state of health, and all other relevant aspects of her medical condition. He must also take into account any other medication which she is currently taking.' (Lord Kerr)"
    },
    {
      "name": "R (on the application of Evans) and another (Respondents) v Attorney General (Appellant) [2015] UKSC 21",
      "keywords": ["freedom of information", "transparency", "government records", "national security", "public interest"],
      "summary": "<strong>Facts</strong><br>• The case of R (on the application of Evans) and another (Respondents) v Attorney General (Appellant) [2015] UKSC 21 concerns the disclosure of the “black spider memos” written by Prince Charles to government officials.<br>• The memos contained the Prince’s views on a range of topics, including architecture, the environment, and healthcare.<br><br><strong>Issues</strong><br>• The main issue in the case was whether the Attorney General acted lawfully in refusing to disclose the memos in response to a Freedom of Information Act request.<br>• The respondents argued that the memos were of public interest and should be disclosed, while the appellant argued that the memos were part of the Prince’s private correspondence and therefore exempt from disclosure.<br><br><strong>Decision</strong><br>• The Supreme Court held that the Attorney General’s decision to refuse disclosure was unlawful.<br>• The Court found that the memos were “advocacy correspondence” rather than purely private correspondence, and therefore subject to disclosure under the Freedom of Information Act.<br>• The Court rejected the appellant’s argument that disclosure of the memos would harm the Prince’s ability to perform his duties as heir to the throne, stating that the public has a legitimate interest in knowing the views expressed by the Prince on matters of public policy.<br><br><strong>Key passage(s)</strong><br>• '...advocacy correspondence is not the same as ordinary correspondence. It is written by the Prince of Wales in order to advance the work of charities, to promote views and to seek feedback. In general, it is sent to government ministers and officials, and it is marked ‘not for publication’. It is not part of the normal system of communication between a private individual and public authorities. Rather, it is a means by which the Prince of Wales can express his views and seek to influence the government on matters about which he feels strongly, either through his own experiences or as a result of the concerns expressed to him by others' (Lord Mance).<br>• 'However, the public interest will not usually justify the disclosure of purely personal or confidential information or opinions, or exchanges intended to be confidential. Nor will it usually justify the disclosure of information or opinions relating to internal discussions and consultations within government, or between government departments and other public bodies' (Lord Neuberger)."
    },
    {
      "name": "R (on the application of Moseley) (in substitution of Stirling (Deceased)) (AP) (Appellant) v London Borough of Haringey (Respondent) [2014] UKSC 56",
      "keywords": ["property law", "inheritance", "human rights", "housing", "right to family life"],
      "summary": "<strong>Facts</strong><br>• The London Borough of Haringey ('the Council') introduced a council tax reduction scheme following a decrease in central government funding for the tax.<br>• The Council sought public opinions before implementing the scheme.<br>• Moseley, a citizen of Haringey, sought judicial review of the process on the grounds that the consultation process was unfair in accordance with R (Morgan) v Richmond-upon-Thames LBC [2011] EWCA Civ 904 ('Morgan').<br><br><strong>Issues</strong><br>• Moseley argued that the consultation process was inadequate and the Council failed to present other possible alternatives, which breached public fairness requirements.<br>• The Council contended that they abided by the standards established in Morgan, and they had sufficiently informed consultees of the proposed changes.<br><br><strong>Decision</strong><br>• The UK Supreme Court allowed Moseley's appeal.<br>• The court found that the Council had breached public fairness requirements as they failed to provide enough information in the consultation process and failed to consider alternatives.<br>• The court established new principles on consultation standards to ensure a fair process for public decision-making.<br><br><strong>Key passage(s)</strong><br>• 'The demands of fairness are likely to be somewhat higher when consultation of individuals is required by statute than when it is embarked on as a matter of discretion.' (Lord Reed)<br>• 'The purpose of consultation is not to enable informed criticism of a decision which has already been taken, but to enable consultation responses to be 'taken into account' when the decision is ultimately taken.' (Lord Wilson)<br>• 'Fairness requires that, if the council chooses to consult, it must consult properly. Its consultation must be a genuine opportunity for the consultees to express their views on the proposal and for the authority to take those views into account when finalising its proposals.' (Lord Hodge)"
    },
{
"name": "R (on the application of Nicklinson and another) (AP) (Appellants) v Ministry of Justice (Respondent) [2014] UKSC 38",
"keywords": ["medical law", "end of life", "assisted dying", "right to die", "human rights"],
  "summary": "<strong>Facts</strong><br>• Tony Nicklinson suffered a stroke that left him with locked-in syndrome, a condition that left him unable to move or communicate.<br>• He wanted to end his life but was unable to do so without assistance due to the Suicide Act 1961.<br>• Nicklinson and another individual, Paul Lamb, brought a case before the court seeking a declaration that the Suicide Act 1961 was incompatible with their right to a private life under Article 8 of the European Convention on Human Rights.<br><br><strong>Issues</strong><br>• The main issue was whether the Suicide Act 1961 was incompatible with the appellants' right to a private life under Article 8 of the European Convention on Human Rights.<br>• The appellants argued that the law violated their right to autonomy and self-determination.<br>• The respondent, the Ministry of Justice, argued that it was not for the courts to change the law on assisted suicide.<br><br><strong>Decision</strong><br>• The Supreme Court unanimously dismissed the appeal.<br>• The court held that it was not for the courts to change the law on assisted suicide, as it was a matter for Parliament to decide.<br>• The court noted that Parliament had considered the issue of assisted suicide on several occasions but had chosen not to change the law.<br>• The court also noted that the European Court of Human Rights had not found that the right to a private life under Article 8 included a right to assisted suicide.<br><br><strong>Key passage(s)</strong><br>• 'The question for the court is whether the blanket ban on assisted suicide imposed by section 2(1) of the Suicide Act 1961 is a proportionate means of achieving the legitimate aim of the protection of the weak and vulnerable in society.' (Lord Neuberger)<br>• 'The question of whether the law should permit assisted suicide is a matter for Parliament to decide, not the courts.' (Lord Neuberger)"
},
    {
      "name": "R (on the application of HS2 Action Alliance Limited) (Appellant) v The Secretary of State for Transport and another (Respondents) [2014] UKSC 3",
      "keywords": ["administrative law", "environmental impact", "infrastructure", "public interest", "judicial review"],
  "summary": "<strong>Facts:</strong><br>• The Secretary of State for Transport issued the HS2 high-speed rail project's command paper and environmental statement.<br>• HS2 Action Alliance Limited, a group of local authorities and residents, challenged the legality of the decisions based on: 1) the Strategic Environmental Assessment (SEA) Directive and 2) the Aarhus Convention.<br>• The High Court rejected the claim, and the Court of Appeal upheld the decision.<br><br><strong>Issues:</strong><br>• The appellant argued that the command paper should have been subjected to an SEA before adoption.<br>• The respondent countered that an SEA was not required because the command paper was not a 'plan or programme within the meaning of the SEA Directive.<br>• Lastly, the appellant claimed a breach of the Aarhus Convention due to insufficient public participation.<br><br><strong>Decision:</strong><br>• The Supreme Court unanimously dismissed the appeal.<br>• The Court ruled that the command paper was not a 'plan or programme' subject to an SEA, in line with<em>Save Historic Newmarket Ltd v Forest Heath District Council [2011] EWHC 606 (Admin)</em><br>• Additionally, the Court found no breach of the Aarhus Convention relating to public participation.<br><br><strong>Key passage(s):</strong><br>• 'It is to be treated as established by [Save Historic Newmarket], that a national policy statement, whether designated or not, is not a plan or programme setting the framework for future development consent within the meaning of article 3(2)(a) of the SEA Directive.' - Lord Carnwath<br>• 'The defendant's decision to introduce a Hybrid Bill incorporating safeguarding directions of the kind described in his Command Paper was not in any event a decision within article 7 (as the claimants contend) but a decision within article 8.' - Lord Carnwath<br>• 'The court should be slow to intervene in the process of Parliamentary scrutiny of the legislative proposals: that is the constitutional role of Parliament.' - Lord Reed"
    },
    {
      "name": "R (on the application of Chester) (Appellant) v Secretary of State for Justice (Respondent) [2013] UKSC 63",
      "keywords": ["family law", "same-sex marriage", "civil partnership", "discrimination", "human rights"],
      "summary": "<strong>Facts</strong><br>• The appellant, Chester, was a convicted sex offender who had completed his custodial sentence but was subject to a lifelong notification requirement under the Sexual Offences Act 2003.<br>• Chester argued that the notification requirement violated his human rights, specifically his right to respect for private and family life under Article 8 of the European Convention on Human Rights (ECHR).<br><br><strong>Issues</strong><br>• The main issue was whether the notification requirement under the Sexual Offences Act 2003 was compatible with Article 8 of the ECHR.<br>• Chester argued that it was not, while the Secretary of State for Justice argued that it was necessary for the protection of the public.<br><br><strong>Decision</strong><br>• The Supreme Court held that the notification requirement under the Sexual Offences Act 2003 was incompatible with Article 8 of the ECHR.<br>• The Court found that the notification requirement was disproportionate and unjustified, and that it imposed a blanket requirement without regard to individual circumstances.<br>• The Court also noted that there was no evidence to support the effectiveness of the notification requirement in reducing reoffending.<br><br><strong>Key passage(s)</strong><br>• 'The notification requirements have a very significant impact on the article 8 rights of those affected by them. They are open-ended, potentially lasting for life, and there is a significant stigma attached to them, in terms of the adverse effect on the offender's relationship with his family and in society generally. Moreover, they are imposed on offenders who have served the sentences imposed on them by the courts and who, in many cases, have been assessed as posing no significant risk of reoffending' (para. 50, Lord Reed).<br>• 'The imposition of the notification requirements on the appellant, in the absence of any consideration of his individual circumstances, was disproportionate and unjustified. It follows that the requirements were incompatible with his article 8 rights' (para. 97, Lord Reed)."
    },
    {
      "name": "Walumba Lumba (Congo) 1 and 2 (Appellants) v Secretary of State for the Home Department (Respondent) [2011] UKSC 12",
      "keywords": ["immigration law", "asylum seekers", "refugees", "human rights", "deportation"],
  "summary": "<strong>Facts</strong><br>• Walumba Lumba, a national of the Democratic Republic of Congo, and Kadian Mighty, a Jamaican national, were detained pending deportation.<br>• Both appellants had criminal convictions and were detained under Immigration Act 1971, Schedule 3, paragraph 2(2) after the Secretary of State for the Home Department (SSHD) decided to deport them.<br>• However, the deportation orders could not be enforced immediately, and the appellants remained in detention.<br>• They challenged their detention, arguing it was unlawful under common law and Article 5 of the European Convention on Human Rights (ECHR).<br><br><strong>Issues</strong><br>• The appellants argued their detention was unlawful because the SSHD failed to follow her own published policy on detention and had a secret, more restrictive policy.<br>• The SSHD contended she had the power to detain pending deportation under the Immigration Act 1971 and did not need to follow the published policy.<br><br><strong>Decision</strong><br>• The UK Supreme Court held the detention of Lumba and Mighty was unlawful.<br>• The Court found that the SSHD's failure to follow her published policy amounted to a breach of the appellants' common law right to be treated fairly.<br>• Furthermore, the Court found that the appellant's detention was unlawful under Article 5 of the ECHR because it was arbitrary and therefore not 'in accordance with a procedure prescribed by law.'<br><br><strong>Key passage(s)</strong><br>• 'Where a published policy sets out how an individual's rights will be safeguarded, there is a legitimate expectation that the policy will be applied to that individual’s case.' (Lord Dyson)<br>• 'The failure to follow the published policy in the present case is a potent example of how unlawful conduct can infect executive decision-making with unfairness.' (Lord Dyson)<br>• 'In the circumstances of the present cases, the refusal of the Secretary of State to apply her published policy is, in my opinion, indeed an abuse of power. It is therefore a ground for quashing the decision to detain the appellants.' (Lord Rodger)"
    },
    {
      "name": "AXA General Insurance Ltd v HM Advocate and others (Scotland) [2011] UKSC 46",
      "keywords": ["criminal law", "insurance fraud", "prosecution", "evidence", "fraudulent claims"],
  "summary": "<strong>Facts</strong><br>• A group of claimants brought actions against AXA General Insurance Ltd and other insurers in the Scottish courts, alleging that the insurers were liable for personal injury caused by asbestos.<br>• In response, the insurance companies sought to rely on legislation passed by the Scottish Parliament which limited their liability by providing an exemption from liability for certain insurers (The Damages (Asbestos-related Conditions) (Scotland) Act 2009).<br>• The insurers argued that this legislation was rendered invalid by the Scotland Act 1998, as it engaged with the European Convention on Human Rights (ECHR) and the rights conferred under the EU law.<br><br><strong>Issues</strong><br>• The insurers argued that the Scottish legislation was incompatible with their rights under Article 1 of Protocol 1 to the ECHR (providing for the right to peaceful enjoyment of possessions).<br>• The claimants countered that the legislation was a proportionate means of achieving the legitimate aim of securing compensation for incurred personal injury.<br>• Both parties agreed that the compatibility of the legislation with EU law was not in question.<br><br><strong>Decision</strong><br>• The UK Supreme Court rejected the insurers' arguments and upheld the validity of the Scottish legislation.<br>• The Court held that the legislation pursued a legitimate aim - specifically, the protection of the rights of those suffering from asbestos-related diseases.<br>• The Court also found that the measures in the legislation were proportionate to that aim, falling within the margin of appreciation afforded to the Scottish Parliament in balancing competing interests.<br><br><strong>Key passage(s)</strong><br>• 'We do not consider that the 2009 Act has any effect on property rights that entitles the appellants to rely on A1P1.' (Lord Hope) <br>• 'The Scottish Parliament must have broad discretion when striking a balance between the competing public and private interests at stake, and it appears to us that it acted well within that discretion in passing the 2009 Act.' (Lord Hope) <br>"
    },
    {
      "name": "Radmacher (formerly Granatino) v Granatino [2010] UKSC 42",
      "keywords": ["family law", "prenuptial agreements", "financial settlements", "divorce", "marital assets"],
  "summary": "<strong>Facts</strong><br>• Katrin Radmacher (Radmacher), a German national, and Nicolas Granatino (Granatino), a French national, met in London in 1997.<br>• Radmacher was a wealthy heiress, while Granatino was a banker.<br>• They married in 1998 and had two children.<br>• Prior to their wedding, Radmacher asked Granatino to sign a prenuptial agreement (PNA) to protect her assets in the event of a divorce.<br>• Granatino signed the agreement without seeking legal advice.<br>• In 2006, the couple separated and divorced.<br>• Granatino contested the validity of the PNA, arguing that it was unfair and that he had signed it under duress.<br><br><strong>Issues</strong><br>• The main issue was whether the PNA should be enforced, given that Granatino had signed it without seeking legal advice and claimed that he had done so under duress.<br>• The Court of Appeal had held that the PNA was unenforceable, while Radmacher had appealed to the Supreme Court.<br><br><strong>Decision</strong><br>• The Supreme Court allowed Radmacher's appeal and held that the PNA was enforceable.<br>• The court noted that PNAs were not contrary to public policy and that the parties should be held to their agreements unless there were good reasons not to do so.<br>• The court held that the existence of the PNA did not indicate that the parties did not intend to be bound by it, and that Granatino had failed to establish that he had signed it under duress.<br>• The court also held that the fact that Granatino had not sought legal advice was not sufficient to render the agreement unenforceable.<br><br><strong>Key passage(s)</strong><br>• 'The court should give effect to a nuptial agreement that is freely entered into by each party with a full appreciation of its implications unless in the circumstances prevailing it would not be fair to hold the parties to their agreement' (Lord Phillips)<br>• 'In the present case, in my view, it is impossible to say that it was unfair to hold the husband to the agreement that he freely made and that was clearly understood by both parties to regulate their financial affairs in the event of divorce' (Lord Collins)"
    },
    {
      "name": "R (on the application of Cart) v The Upper Tribunal [2011] UKSC 28",
      "keywords": ["administrative law", "tribunals", "judicial review", "human rights", "procedural fairness"],
  "summary": "<strong>Facts</strong><br>• In this 2011 Supreme Court case, the claimant, Ms. Cart, sought judicial review of a decision made by the Upper Tribunal.<br>• The Upper Tribunal had dismissed her appeal against a decision of the Asylum and Immigration Tribunal regarding her entitlement to benefits.<br>• Ms. Cart argued that the Upper Tribunal's decision should be open to judicial review, as there was an error of law in the way the Upper Tribunal had reached its decision.<br><br><strong>Issues</strong><br>• The central issue in this case was whether decisions of the Upper Tribunal could be subject to judicial review.<br>• Ms. Cart argued that the decisions of the Upper Tribunal should be reviewable if they involved an error of law.<br>• The Upper Tribunal argued that its decisions should not be open to judicial review because it was a statutory appellate body, and its decisions were supposed to be final.<br>• Prior to this case, there had been conflicting interpretations in lower courts on what circumstances would allow for decisions of the Upper Tribunal to be subject to judicial review.<br><br><strong>Decision</strong><br>• The court ruled that decisions of the Upper Tribunal can be judicially reviewed, but only in limited circumstances.<br>• The court held that a decision of the Upper Tribunal would only be reviewable if it involved an error of law that was 'of truly exceptional public importance'.<br>• The court also clarified that the test for what constitutes 'truly exceptional public importance' would be similar to the test for the grant of leave to appeal from the Court of Appeal to the Supreme Court.<br><br><strong>Key passage(s)</strong><br>• 'It is for the courts to determine the extent of their supervisory jurisdiction over the Upper Tribunals. And it is for the courts to preserve, both in the law they declare and interpret, and in the extent of the relief they are prepared to grant, that balance between the rights of the individual and the demands of the efficient administration of justice which is the cornerstone of our public law.' (Lord Dyson)<br>• 'The more objectionable it would be, as a matter of constitutional principle, to exclude the supervisory jurisdiction of the High Court altogether, the more ready the court may be to recognise that an error of law is of such a kind as to justify the grant of permission.' (Lord Phillips)"
    },
    {
      "name": "R (on the application of E) (Respondent) v JFS Governing Body (Appellant) [2009] UKSC 15",
      "keywords": ["education law", "religious discrimination", "admissions policy", "equality", "religious freedom"],
  "summary": "<strong>Facts</strong><br>• The JFS Governing Body (JFS) is an Orthodox Jewish school in London that gives priority to children who are Jewish according to the Orthodox definition.<br>• E applied for admission to JFS but was rejected as her mother's mother was not Jewish according to the Orthodox definition.<br>• E challenged the decision, arguing that it was discriminatory.<br><br><strong>Issues</strong><br>• The main issue in this case was whether JFS's admissions policy, which gave priority to children who are Jewish according to the Orthodox definition, was discriminatory under the Race Relations Act 1976 (RRA) and the Equality Act 2006 (EA).<br>• E argued that the policy was discriminatory, while JFS argued that it was a legitimate way of maintaining a Jewish ethos.<br><br><strong>Decision</strong><br>• The Supreme Court held that JFS's admissions policy was discriminatory under the RRA and the EA.<br>• The Court found that the policy was not a proportionate means of achieving a legitimate aim, as it discriminated against children who were Jewish but did not meet the Orthodox definition.<br>• The Court also found that the policy was not necessary to maintain a Jewish ethos, as there were other ways of doing so that did not involve discrimination.<br><br><strong>Key passage(s)</strong><br>• Lord Phillips 'Direct discrimination on grounds of race or ethnic or national origins is unlawful. It is unlawful regardless of whether it is conscious or unconscious, intentional or unintentional. The fact that the criterion applied by JFS may have a religious connotation does not mean that it is not discriminatory' [para. 21].<br>• Lady Hale 'If a school such as JFS admits any pupils who are not Jewish according to the Orthodox definition, then the argument that it is necessary to admit only those who are in order to maintain a Jewish ethos is weakened. It is not the religion of the pupil which matters, but the religion of the school' [para. 88]."
    },
    {
      "name": "R (on the application of Purdy) v Director of Public Prosecutions [2009] UKHL 45",
      "keywords": ["criminal law", "assisted suicide", "prosecution policy", "human rights", "end of life"],
  "summary": "<strong>Facts</strong><br>• Debbie Purdy suffered from multiple sclerosis and wished to end her life at a time of her choosing.<br>• She sought clarification from the Director of Public Prosecutions (DPP) on whether her husband would be prosecuted for assisting her suicide if she travelled to Switzerland to end her life.<br>• The DPP refused to provide clarification, stating that each case would be decided on its own facts.<br>• Purdy brought a case seeking clarification on the law of assisted suicide.<br><br><strong>Issues</strong><br>• The issue in this case was whether the DPP's refusal to provide clarification on the law of assisted suicide was a breach of Purdy's right to respect for private life under Article 8 of the European Convention on Human Rights (ECHR).<br>• Purdy argued that the lack of clarity on the law made it impossible for her to make an informed decision about whether to end her life.<br><br><strong>Decision</strong><br>• The House of Lords held that the DPP's refusal to provide clarification on the law of assisted suicide was a breach of Purdy's Article 8 rights.<br>• The court held that the DPP had a duty to clarify the law to enable individuals to make an informed decision about whether to end their life.<br>• The court outlined a set of factors that the DPP should consider when deciding whether to prosecute someone for assisting suicide, including the motivation of the person assisting, the final acts of the deceased, and the overall circumstances of the case.<br><br><strong>Key passage(s)</strong><br>• 'Article 8 of the ECHR is engaged because the DPP's policy has an impact on the manner in which the applicant can exercise her right to autonomy and self-determination when deciding whether to end her life.' - Lord Hope (para. 9)<br>• 'The DPP must provide an indication of the factors that he would take into account in deciding whether or not to consent to a prosecution in cases of assisted suicide.' - Lord Hope (para. 40)"
    },
    {
      "name": "R (on the application of Gentle) v Prime Minister [2008] UKHL 20",
      "keywords": ["human rights", "armed conflict", "Iraq War", "state responsibility", "right to life"],
      "summary": "<strong>Facts</strong><br>• In this case, the appellants were relatives of UK service personnel killed whilst on duty during the conflict in Iraq in 2003.<br>• They sought a ruling that the UK government was under a procedural obligation, derived from Article 2 (right to life) of the European Convention on Human Rights (ECHR), to establish an independent and public inquiry into the lawfulness of the government’s decision to use military force against Iraq.<br><br><strong>Issues</strong><br>• The appellants argued that the disclosure obligations required by Article 2 under R (Middleton) v West Somerset Coroner [2004] UKHL 10, [2004] 2 AC 182 were not satisfied, as the investigations into the servicemen’s deaths did not address the underlying legality of the use of force.<br>• The government argued that Article 2 did not impose a duty to conduct an inquiry in these circumstances.<br><br><strong>Decision</strong><br>• The House of Lords rejected the appellants’ argument and found in favor of the government.<br>• Both the majority and the minority considered that the procedural obligation to investigate death under Article 2 was limited to cases where the victims had died “within the jurisdiction” of the UK, which extended only to cases where the victims were within the physical control of the UK authorities.<br>• The majority also pointed out that there was no substantive violation of Article 2 itself, which weakened the argument for the procedural obligation to investigate.<br>• The minority disagreed on this point, noting that the procedural obligations did not depend on a violation of the substantive right.<br><br><strong>Key passage(s)</strong><br>• 'The scope of the duty to investigate must depend on the relationship between the substantive right and the procedural obligation it is designed to promote.' (Baroness Hale)<br>• 'To the extent that Middleton, while not establishing any free-standing right of access to a court, demonstrates an incremental expansion of the procedural obligations under Article 2, that development is confined to situations with a proper UK jurisdictional nexus.' (Lord Brown)<br>• 'There is no reason to suppose that the procedural obligation extends beyond those cases where the substantive obligation extends.' (Lord Scott)"
    },
        {
      "name": "Stack v Dowden [2007] UKHL 17",
      "keywords": ["property law", "cohabitation", "trusts", "ownership", "family home"],
      "summary": "<strong>Facts</strong><br>• Stack v Dowden [2007] UKHL 17 concerns the division of the proceeds from the sale of a property between two cohabitants, Ms Dowden and Mr Stack.<br>• They had lived together for 18 years, had three children together, and had purchased the property in joint names.<br><br><strong>Issues</strong><br>• The main issue was the nature and extent of the parties' beneficial interests in the property.<br>• Ms Dowden argued that their interests were equal, as they had purchased the property in joint names and had contributed equally to the purchase price and mortgage payments.<br>• Mr Stack argued that he was entitled to a greater share of the proceeds, as he had made larger contributions to the property's purchase and maintenance.<br><br><strong>Decision</strong><br>• The House of Lords held that there was no presumption of joint beneficial ownership of the property, and that the extent of each party's interest would depend on their common intention at the time of purchase.<br>• In this case, the parties had intended to own the property jointly and equally, and therefore their beneficial interests were equal.<br>• However, the court recognized that the parties had conducted their financial affairs separately, and that this might indicate a contrary intention.<br>• Therefore, the court considered the parties' whole course of conduct, including their financial arrangements and contributions, to determine their common intention.<br><br><strong>Key passage(s)</strong><br>• 'It is not possible to lay down any hard and fast rule as to the identification of the relevant common intention. Everything depends on the context in which the question arises.' (Lord Walker)<br>• 'In most cases where there is evidence of joint legal ownership, it will readily be inferred, in the absence of evidence to the contrary, that the parties intended to beneficially own the property in equal shares.' (Baroness Hale)"
    },
    {
      "name": "R (on the application of Jackson) v Attorney General [2005] UKHL 56",
      "keywords": ["constitutional", "parliamentary sovereignty", "legislation", "judicial review", "Human Rights Act"],
      "summary": "<strong>Facts</strong><br>• The Hunting Act 2004 (the Act) banned hunting wild mammals with dogs.<br>• Mr Jackson challenged the Act, arguing that it was incompatible with the European Convention on Human Rights (ECHR) and that it was enacted using an improper parliamentary procedure.<br>• The case was heard by the House of Lords, which is now known as the Supreme Court.<br><br><strong>Issues</strong><br>• The main issues in the case were whether the Act was incompatible with the ECHR, particularly Article 1 of the First Protocol (A1P1), which protects the right to peaceful enjoyment of possessions, and whether the Act was enacted using an improper parliamentary procedure.<br><br><strong>Decision</strong><br>• The House of Lords held that the Act was not incompatible with A1P1 as it did not interfere with any existing property rights.<br>• The court also held that the Act was enacted using a proper parliamentary procedure and that the Parliament Act 1949 (which allows the House of Commons to override the House of Lords in certain circumstances) was not unconstitutional.<br><br><strong>Key passage(s)</strong><br>• Lord Hope, in his judgment, stated 'The question whether the Hunting Act 2004 is compatible with the Convention is one of substance, not procedure. The court is concerned with whether the effect of the legislation is to interfere with the rights protected by the Convention, not with whether the appropriate procedures have been followed in Parliament' [para. 49].<br>• Lord Bingham, in his judgment, stated 'The Hunting Act 2004 was passed in the way that Parliament prescribed for it. It has not been suggested that any provision of the Act was beyond the legislative competence of Parliament. The Act is not incompatible with the Convention. It must be accepted as law' [para. 1]."
    },
    {
      "name": "Campbell v Mirror Group Newspapers Ltd [2004] UKHL 22",
      "keywords": ["media law", "privacy", "defamation", "freedom of the press", "public interest"],
      "summary": "<strong>Facts</strong><br>• Naomi Campbell, a well-known model, attended Narcotics Anonymous meetings and it was reported in the Mirror newspaper that she was attending these meetings.<br>• Campbell sued the Mirror Group Newspapers Ltd for breach of confidence and claimed that her privacy had been violated.<br>• The Mirror Group Newspapers argued that Naomi Campbell had sought publicity of her attendance at the meetings in order to gain positive publicity for her image.<br><br><strong>Issues</strong><br>• The main issue in this case was whether Naomi Campbell's privacy had been violated when the Mirror Group Newspapers reported on her attendance at Narcotics Anonymous meetings.<br>• Additionally, the case raised questions about the balance between freedom of expression and the right to privacy.<br><br><strong>Decision</strong><br>• The House of Lords held that Naomi Campbell's privacy had been violated by the Mirror Group Newspapers.<br>• The court found that there was no public interest in publishing the information about Campbell's attendance at the meetings.<br>• The court also found that even if there was a public interest, it did not outweigh Campbell's right to privacy.<br><br><strong>Key passage(s)</strong><br>• 'Whether something is private must depend on all the circumstances. Although the circumstances in which the information comes into the public domain may be relevant, they are not determinative. For example, in some cases, the fact that information is already known to a section of the public may make it more likely that its further dissemination will not give rise to a reasonable expectation of privacy. But the fact that information is in the public domain does not necessarily mean that there is no reasonable expectation of privacy in relation to further dissemination of that information.' (Lord Nicholls)<br>• 'The touchstone of private life is not whether a person is in a public place or a private place but whether in all the circumstances the person has a reasonable expectation of privacy.' (Lord Hope)<br>• 'It is not necessary to show that the disclosure was motivated by a desire to injure the claimant or for any other improper purpose. It is sufficient if the disclosure is offensive to a reasonable person of ordinary sensibilities.' (Lord Nicholls)"
    },
    {
      "name": "R (on the application of Limbuela) v Secretary of State for the Home Department [2005] UKHL 66",
      "keywords": ["immigration law", "asylum seekers", "human rights", "destitution", "right to work"],
      "summary": "<strong>Facts</strong><br>• Three asylum seekers were denied support under section 55 of the Nationality, Immigration and Asylum Act 2002 (s.55) because they failed to make their claims 'as soon as reasonably practicable'.<br>• They were destitute, without access to food, clothing or shelter, and at risk of inhuman or degrading treatment.<br>• The claimants argued that the denial of support under s.55 violated their rights under Article 3 of the European Convention on Human Rights (ECHR), which prohibits inhuman or degrading treatment.<br><br><strong>Issues</strong><br>• The Secretary of State argued that s.55 did not engage Article 3 and that even if it did, support could be provided under section 95 of the Immigration and Asylum Act 1999 (s.95) to avoid a violation.<br>• The claimants argued that denial of support under s.55 amounted to inhuman or degrading treatment in violation of Article 3 ECHR.<br><br><strong>Decision</strong><br>• The House of Lords held that the denial of support under s.55 was capable of being inhuman or degrading treatment in violation of Article 3 ECHR.<br>• They found that the operation of s.55 in these circumstances did amount to inhuman or degrading treatment.<br>• The Lords held that s.95 support could be provided to avoid a violation of Article 3.<br><br><strong>Key passage(s)</strong><br>• 'The threshold may be crossed when a late applicant for asylum, who is genuinely hungry, cold and at risk of deteriorating mental and physical health, is denied even the most basic support' - (Lord Bingham).<br>• 'Section 55 does not apply to a claimant who is already being supported under s.95, but the Secretary of State may not deny support under s.55 in circumstances where it is required by the claimant's rights under Article 3' - (Lord Brown)."
    },
    {
      "name": "A v Secretary of State for the Home Department [2004] UKHL 56",
      "keywords": ["immigration law", "deportation", "refugees", "human rights", "statelessness"],
      "summary": "<strong>Facts</strong><br>• The 'A' in the case name refers to nine appellants who were all foreign nationals accused of terrorist acts in their home countries. The United Kingdom was not able to deport them due to the risk of them facing torture or inhumane treatment in their home countries. In response Parliament enacted the Anti-terrorism, Crime and Security Act 2001 (ATCSA).<br>• Under Part 4 of the ATCSA, the Secretary of State for the Home Department issued certificates naming the appellants as suspected international terrorists, leading to their detention without trial.<br>• The appellants appealed their detention under the ATCSA.<br><br><strong>Issues</strong><br>• The appellants claimed their detention was incompatible with their rights under the European Convention on Human Rights (ECHR), particularly Article 5 (the right to liberty and security) and Article 14 (prohibition of discrimination).<br>• The Secretary of State argued that the legislation was a justified and proportionate response to the public emergency threatening the life of UK citizens.<br><br><strong>Decision</strong><br>• The UK House of Lords held that the detention of the appellants without trial under Part 4 of the ATCSA was incompatible with their human rights under the ECHR.<br>• It found that the legislation was discriminatory because it only applied to foreign nationals and not to British citizens suspected of terrorist acts, contrary to Article 14.<br>• The Court also concluded that the detention powers were disproportionate and failed the test for legitimate derogations under Article 15 of the ECHR.<br><br><strong>Key passage(s)</strong><br>• 'The real threat to the life of the nation ... comes not from terrorism but from laws such as these.' (Lord Hoffmann)<br>• 'Even in situations when all values cherished by free societies are threatened, it is essential to uphold human rights to ensure that the foundations of these societies are not undermined.' (Lord Bingham)"
    },
    {
      "name": "R (on the application of H) v Mental Health Review Tribunal for the North and East London Region and the Secretary of State for Health [2005] UKHL 60",
      "keywords": ["mental health law", "detention", "human rights", "treatment", "patient rights"],
      "summary": "<strong>Facts</strong><br>• H was a patient detained under Section 3 of the Mental Health Act 1983 (MHA 1983) and sought her discharge from detention.<br>• The Mental Health Review Tribunal (MHRT) had not decided to discharge her.<br>• On judicial review, H challenged: (1) a decision of the MHRT, which refused to discharge her from detention, and (2) a decision by the Secretary of State for Health which upheld the tribunal's decision.<br><br><strong>Issues</strong><br>• H argued that the MHRT and the Secretary of State for Health contravened Article 5(4) of the European Convention on Human Rights (ECHR) by not providing a speedy review of the lawfulness of her detention.<br>• The respondents argued that there was no breach of Article 5(4) ECHR and that domestic law and procedure was compatible with the Article 5(4) right to a speedy review.<br><br><strong>Decision</strong><br>• The House of Lords held that the domestic law and procedure were compatible with Article 5(4) ECHR, ruling in favor of the respondents.<br>• Their Lordships dismissed H's appeal, stating that the process leading up to the MHRT's decision and the Secretary of State's executive review had been both thorough and expeditious.<br>• The House of Lords made clear that in order to comply with Article 5(4), speediness needs to be assessed in light of the thoroughness of the review process and the particular circumstances of each case.<br><br><strong>Key passage(s)</strong><br>• 'For the time being, the relation between the state's duty to provide institutions and facilities to discharge their duty to use reasonable dispatch in determining the lawfulness of detention under Article 5(4) and the rights of the patient admitted under s. 3 must be held to be sufficiently indicated by the requirement of procedural expeditiousness which I have endeavored to articulate above.' - Lord Hope (para 47)<br>• 'What is required by Art 5(4) is that the procedure before the tribunal should be conducted with all due expedition which the patient's circumstances allow.' - Lord Rodgers (para 128)"
    },
        {
      "name": "Regina v Bartle and the Commissioner of Police for the Metropolis and Others, Ex Parte Pinochet [1999] UKHL 1",
      "keywords": ["international law", "extradition", "crimes against humanity", "immunity", "universal jurisdiction"],
      "summary": "<strong>Facts</strong><br>• Augusto Pinochet, the former president of Chile, was arrested in London in 1998 on a Spanish warrant seeking his extradition to Spain to face charges of torture and conspiracy to torture during his regime.<br>• Pinochet claimed immunity as a former head of state.<br>• The case went to the House of Lords, which had to decide whether Pinochet was entitled to immunity from prosecution under international law.<br><br><strong>Issues</strong><br>• The main issue in this case was whether Pinochet was entitled to immunity from prosecution under international law.<br>• Pinochet argued that he was entitled to immunity as a former head of state.<br>• The other issue was whether the crimes Pinochet was accused of were extraditable offenses.<br><br><strong>Decision</strong><br>• The House of Lords ruled that Pinochet was not entitled to immunity from prosecution as a former head of state.<br>• The Lords held that the nature of the crimes Pinochet was accused of, namely torture and conspiracy to torture, were not covered by the doctrine of state immunity.<br>• Therefore, Pinochet could be extradited to Spain to face trial.<br>• However, the Lords also ruled that Pinochet was entitled to immunity in relation to acts committed in the exercise of his functions as a head of state.<br><br><strong>Key passage(s)</strong><br>• Lord Browne-Wilkinson 'Crimes such as torture, hostage-taking and genocide are crimes under international law, whether committed by rulers or private individuals. The principle of international law which excludes state immunity from jurisdiction in respect of such crimes thus reflects the fundamental moral principle that no state, no ruler, no official and no individual has licence to commit such crimes' (para. 13).<br>• Lord Millett 'Crimes against humanity are crimes against all mankind. No sovereign or head of state can claim immunity from the jurisdiction of the courts of another state where he is accused of committing such crimes' (para. 98)."
    },
    {
      "name": "Fairchild v Glenhaven Funeral Services Ltd and others [2002] UKHL 22",
      "keywords": ["tort law", "negligence", "causation", "liability", "asbestos-related diseases"],
      "summary": "<strong>Facts</strong><br>• Fairchild worked as an apprentice for various firms, including Glenhaven Funeral Services Ltd.<br>• During his employment, he was exposed to asbestos, which ultimately led to his contracting mesothelioma, a cancer of the lining of the lungs.<br>• The exposure to asbestos occurred during different periods of employment, and it was impossible to determine which exposure caused the illness.<br>• Fairchild brought a claim against all the firms he had worked for, alleging that each of them had contributed to his illness.<br><br><strong>Issues</strong><br>• The main issue was whether Fairchild could succeed in his claim against his employers despite the inability to prove which employer's exposure caused his illness.<br>• The employers argued that they should not be held liable for Fairchild's mesothelioma because it was impossible to establish which of them had caused the harm.<br>• Fairchild, on the other hand, argued that because he had contracted the illness due to the employers' negligence, each employer should be held liable for his injuries.<br><br><strong>Decision</strong><br>• The House of Lords held that in mesothelioma cases, where a claimant had been exposed to asbestos by more than one employer, and it was impossible to prove which exposure had caused the illness, each employer should be held liable for the full extent of the damage caused.<br>• This decision departed from the traditional 'but for' causation test, which requires a claimant to prove that the defendant's actions were the cause of the harm suffered.<br>• The court held that the burden of proof should be reversed in such cases, and the employers should bear the burden of proving that they did not cause the harm.<br><br><strong>Key passage(s)</strong><br>• 'The defendants' submission is that the chain of causation is broken because the mesothelioma could have been caused by exposure not attributable to any of them. I reject that submission. The mesothelioma was caused by a combination of factors, including the exposure to asbestos dust of each employer. Each exposure contributed to the mesothelioma and so to the damage suffered by the Claimant.' (Lord Bingham)<br>• 'In my view, the law should recognize that there are exceptional cases in which the 'but for' test of causation may properly be relaxed. The present case, in which the Claimant has worked for a number of different employers, each of whom has materially increased the risk of his developing mesothelioma, is one such case.' (Lord Hoffmann)"
    },
    {
      "name": "R (on the application of Anderson) v Secretary of State for the Home Department [2002] UKHL 46",
      "keywords": ["immigration law", "detention", "human rights", "asylum seekers", "unlawful detention"],
      "summary": "<strong>Facts</strong><br>• The applicant, Anthony Anderson, was convicted of murder in 1988 and sentenced to life imprisonment.<br>• Under UK law at the time, the minimum term to be served (tariff) was determined by the Secretary of State for the Home Department (SSHD) based on recommendations from the judiciary.<br>• Anderson's tariff was established at 15 years, and at the end of this period, he applied for a review of his continued detention by the Lord Chief Justice.<br>• The Lord Chief Justice recommended reducing his tariff to 10 years, but the SSHD disagreed and maintained it at 15 years.<br>• Anderson sought judicial review of the SSHD's decision.<br><br><strong>Issues</strong><br>• Anderson argued that the SSHD's decision-making process violated his right to a fair trial under Article 6(1) of the European Convention on Human Rights (ECHR) due to its lack of independence and impartiality.<br>• The SSHD argued that Article 6(1) did not apply as the decision was not a determination of a criminal charge, but rather a part of the sentence execution process.<br><br><strong>Decision</strong><br>• The House of Lords held that the SSHD's role in determining tariffs did in fact violate Anderson's right to a fair trial under Article 6(1) of the ECHR.<br>• The House of Lords followed the European Court of Human Rights' decisions in T v United Kingdom and V v United Kingdom, which stated that tariff decisions did come under the ambit of Article 6(1).<br>• They noted that the involvement of a political figure (SSHD) in making decisions on tariffs was inconsistent with the ECHR's requirements for impartiality and independence.<br>• The decision in Anderson led to the abolition of the SSHD's role in determining tariffs and the establishment of the independent Sentencing Guidelines Council.<br><br><strong>Key passage(s)</strong><br>• 'There is an obvious and fundamental difference between the role of the judge in sentencing, and that of the Secretary of State in setting the tariff.' (Lord Bingham)<br>• 'Where Convention rights are in issue, the courts must…only depart from the principles laid down by the Court [of Human Rights] if they are plainly wrong or inconsistent with some fundamental substantive or procedural aspect of our law.' (Lord Steyn)<br>• 'The fixing of the tariff is an integral part of the sentencing process. The Secretary of State is not a judicial body…he is not impartial…and his decision…are[sic] not appealable as of right.' (Lord Woolf)"
    },
    {
      "name": "R v Secretary of State for the Home Department, ex parte Simms [2000] UKHL 5",
      "keywords": ["human rights", "prisoners' rights", "freedom of expression", "restrictive measures", "right to information"],
      "summary": "<strong>Facts</strong><br>• The applicants, two prisoners, were convicted of separate murders and given life sentences.<br>• They sought to challenge the fairness of their trials through interviews with investigative journalists.<br>• The Home Secretary imposed restrictions under the Prison Rules, preventing prisoners from having oral or written communication with journalists unless the communication was in the public interest.<br>• The prisoners sought judicial review of these restrictions, arguing they violated their rights to freedom of expression under the European Convention on Human Rights.<br><br><strong>Issues</strong><br>• The applicants argued that the restrictions violated their rights to freedom of expression under the European Convention on Human Rights.<br>• The Home Secretary argued that the restrictions were necessary to maintain discipline and deter crime.<br><br><strong>Decision</strong><br>• The House of Lords allowed the prisoners' appeals and held that the restrictions were disproportionate and violated their rights to freedom of expression under the European Convention on Human Rights.<br>• The court applied the common law principle of legality: Parliament must expressly restrict fundamental rights, and courts should interpret statutes to preserve these rights where possible.<br>• The court found that the restrictions were not strictly necessary and had not been shown to be the least restrictive means of achieving their intended objectives.<br><br><strong>Key passage(s)</strong><br>• 'In the absence of express language or necessary implication to the contrary, the courts therefore presume that even the most general words were intended to be subject to the basic rights of the individual.' (Lord Hoffmann)<br>• 'Fundamental rights cannot be overridden by general or ambiguous words.' (Lord Steyn)"
    },
    {
      "name": "R v Secretary of State for the Home Department, ex parte Daly [2001] UKHL 26",
      "keywords": ["immigration law", "asylum seekers", "refugees", "human rights", "deportation"],
      "summary": "<strong>Facts</strong><br>• The applicants, two prisoners, were convicted of separate murders and given life sentences.<br>• They sought to challenge the fairness of their trials through interviews with investigative journalists.<br>• The Home Secretary imposed restrictions under the Prison Rules, preventing prisoners from having oral or written communication with journalists unless the communication was in the public interest.<br>• The prisoners sought judicial review of these restrictions, arguing they violated their rights to freedom of expression under the European Convention on Human Rights.<br><br><strong>Issues</strong><br>• The applicants argued that the restrictions violated their rights to freedom of expression under the European Convention on Human Rights.<br>• The Home Secretary argued that the restrictions were necessary to maintain discipline and deter crime.<br><br><strong>Decision</strong><br>• The House of Lords allowed the prisoners' appeals and held that the restrictions were disproportionate and violated their rights to freedom of expression under the European Convention on Human Rights.<br>• The court applied the common law principle of legality: Parliament must expressly restrict fundamental rights, and courts should interpret statutes to preserve these rights where possible.<br>• The court found that the restrictions were not strictly necessary and had not been shown to be the least restrictive means of achieving their intended objectives.<br><br><strong>Key passage(s)</strong><br>• 'In the absence of express language or necessary implication to the contrary, the courts therefore presume that even the most general words were intended to be subject to the basic rights of the individual.' (Lord Hoffmann)<br>• 'Fundamental rights cannot be overridden by general or ambiguous words.' (Lord Steyn)"
    },
   {
     "name": "McFarlane v Tayside Health Board (Scotland) [2000] 2 AC 59 (HL)",
     "keywords": ["tort", "negligence", "medical negligence", "wrongful birth"],
     "summary": "<strong>Facts</strong><br>• In McFarlane v Tayside Health Board, Mr. and Mrs. McFarlane, a married couple, sought damages for the cost of raising their child who was conceived as a result of a negligently performed vasectomy.<br>• Mr. McFarlane underwent a vasectomy in September 1990, and the Health Board failed to provide adequate advice on contraception after the operation.<br>• Upon being told that the operation was successful and no further contraception was required, the couple conceived a child later in the pregnancy.<br><br><strong>Issues</strong><br>• The main issue before the House of Lords was whether the parents could recover, as damages, the cost of raising the child from the Health Board who negligently performed the vasectomy.<br>• The claimants argued that the Health Board was responsible for the costs, as it was a direct consequence of their negligence.<br>• The Health Board contended that the damages should not be awarded on the grounds that the birth of a healthy child is not a loss which can be compensated.<br><br><strong>Decision</strong><br>• The House of Lords held that the parents could not recover the costs of raising the child. Although the Health Board had breached their duty of care, they were not liable to pay the expenses associated with raising the child, as the birth of a healthy child is not a loss capable of being remedied.<br>• They considered the case of Doyle v Olby Ironmongers Ltd [1969] 2 QB 158 and held that it was distinguishable from the present case, as it allowed for compensation for the loss of capacity to have children rather than for the birth of a child.<br>• Furthermore, awarding damages for raising a child would be against the public interest as it could potentially deter life-enhancing health care treatment.<br><br><strong>Key passage(s):</strong><br>• Lord Steyn: 'The general answer to the question whether a person may sue for damages for the costs of bringing up a child is that the law regards the birth of a normal, healthy child as a blessing and not as constituting a recognizable source of loss.'"
    },
    {
  "name": "Donoghue v Stevenson [1932] AC 562",
  "keywords": ["tort", "negligence", "duty of care", "neighbour principle"],
      "summary": "<strong>Facts</strong><br>• In 1928, Mrs. Donoghue (plaintiff) went to a café with a friend who bought her a ginger beer in an opaque bottle.<br>• After drinking some of the beer, she discovered a decomposing snail in the bottle, which made her ill.<br>• She sued Mr. Stevenson (defendant), the manufacturer, for damages.<br><br><strong>Issues</strong><br>• The main issue was whether the manufacturer of a product owed a duty of care to the ultimate consumer of the product.<br>• The plaintiff argued that the manufacturer was liable for the harm caused by the defective product, while the defendant argued that he had no duty to the plaintiff as she had not purchased the product from him.<br><br><strong>Decision</strong><br>• The House of Lords held that the manufacturer owed a duty of care to the ultimate consumer.<br>• Lord Atkin formulated the 'neighbour test' which provides that a person owes a duty of care to his neighbour, meaning those who are so closely and directly affected by his act that he ought reasonably to have them in contemplation as being so affected when he is directing his mind to the acts or omissions which are called in question.<br>• Applying this test, Lord Atkin found that a manufacturer owes a duty of care to the consumer of his products.<br><br><strong>Key passage(s)</strong><br>• 'The rule that you are to love your neighbour becomes in law, you must not injure your neighbour; and the lawyer's question, Who is my neighbour? receives a restricted reply. You must take reasonable care to avoid acts or omissions which you can reasonably foresee would be likely to injure your neighbour. Who, then, in law, is my neighbour? The answer seems to be - persons who are so closely and directly affected by my act that I ought reasonably to have them in contemplation as being so affected when I am directing my mind to the acts or omissions which are called in question.' (Lord Atkin)<br>• 'Where a manufacturer knows that the ultimate consumer of his product will not have the opportunity of examining the product for defects, the manufacturer owes a duty to the ultimate consumer to take reasonable care to ensure that the product is free from defects that may cause injury.' (Lord Macmillan)"
},
    {
  "name": "Caparo Industries plc v Dickman [1990] 2 AC 605",
  "keywords": ["tort", "negligence", "duty of care", "foreseeability", "proximity", "fairness"],
      "summary": "<strong>Facts</strong><br>• Caparo Industries (Caparo) acquired shares in Fidelity (a company vulnerable to takeover).<br>• Caparo relied on Fidelity's annual accounts, which showed a significant profit.<br>• However, accountants had negligently misstated Fidelity's financial position; actual profits were much less.<br>• Caparo sued the accountants, alleging negligence in shares evaluation.<br><br><strong>Issues</strong><br>• Could Caparo recover their losses due to the accountants' negligence?<br>• Was there sufficient proximity, foreseeability, and fairness to establish a duty of care?<br>• Caparo argued accountants owed them a duty considering their reliance on financial reports.<br>• Accountants asserted no such duty, as the relationship was too remote, and that auditors must prioritize shareholders.<br><br><strong>Decision</strong><br>• The House of Lords held no duty of care existed between accountants and Caparo.<br>• Despite the closeness and foreseeability, it would be irrational to impose a duty to all potential takeovers.<br>• The threefold test was adopted, meaning duty of care requires foreseeability, proximity, and fairness.<br>• Previous cases, such as Hedley Byrne & Co Ltd v Heller & Partners Ltd [1964] and Anns v Merton London Borough Council [1978], were referred to in the judgment.<br><br><strong>Key passage(s)</strong><br>• 'It is necessary to consider the particular circumstances and relationships which exist in each case having regard to these factors before it can be said that the duty is owed' (Lord Bridge).<br>• 'To demand less degree of proximity, the law would be in danger of creating a multitude of inconsistent decisions and undesirable anomalous consequences on auditors and their insurers' (Lord Oliver).<br>• 'The law has continued to develop on a case-by-case basis' (Lord Roskill)."
},
{
  "name": "Rylands v Fletcher [1868] UKHL 1",
  "keywords": ["tort", "strict liability", "non-natural use", "escape"],
  "summary": "<strong>Facts</strong><br>• In Rylands v Fletcher [1868] UKHL 1, the defendant owned a mill and constructed a reservoir on his land, which was near to the plaintiff’s (Rylands’) mine.<br>• The reservoir was built by independent contractors who were employed by the defendant, but who were careless in their construction.<br>• As a result, when the reservoir was filled with water, it burst and flooded Rylands’ mine, causing significant damage.<br><br><strong>Issues</strong><br>• The issue in this case was whether the defendant was liable for the damage caused by the flood.<br>• Rylands argued that the defendant was liable under the principle of nuisance, while the defendant argued that he was not liable because the reservoir was a natural use of his land.<br><br><strong>Decision</strong><br>• The House of Lords held that the defendant was liable for the damage caused by the flood.<br>• The court established a new principle of liability, known as the rule in Rylands v Fletcher, which states that a person who brings onto their land something that is likely to do damage if it escapes will be liable for any damage caused by that thing if it does escape.<br>• The court held that the reservoir was a non-natural use of the land, as it involved the accumulation of a large amount of water in an artificial manner, and that the defendant was therefore liable for the damage caused by the flood.<br><br><strong>Key passage(s)</strong><br>• '…the person who for his own purposes brings on his lands and collects and keeps there anything likely to do mischief if it escapes, must keep it in at his peril, and if he does not do so is prima facie answerable for all the damage which is the natural consequence of its escape.' (Baron Blackburn)<br>• 'The rule which I think is applicable to this case is, that the person who for his own purposes brings on his land and collects and keeps there anything likely to do mischief if it escapes, must keep it at his peril, and, if he does not do so, is prima facie answerable for all the damage which is the natural consequence of its escape.' (Baron Bramwell)"
},
{
  "name": "McLoughlin v O'Brian [1983] 1 AC 410",
  "keywords": ["tort", "negligence", "psychiatric harm", "secondary victims"],
      "summary": "<strong>Facts</strong><br>• The plaintiff, Mrs. McLoughlin, witnessed the aftermath of a car accident caused by the defendant, Mr. O'Brian.<br>• The accident resulted in the death of the plaintiff's daughter and serious injuries to her husband and children.<br>• The plaintiff developed nervous shock and sued the defendant for damages.<br><br><strong>Issues</strong><br>• The plaintiff submitted that the defendant owed her a duty of care due to the close relationship between them, the foreseeability of harm and her proximity to the event.<br>• The defendant argued that he owed no duty of care to the plaintiff on the basis that she was not directly involved in the accident and was not physically harmed.<br>• The courts considered whether a duty of care existed and if such a duty was owed to the plaintiff.<br><br><strong>Decision</strong><br>• The House of Lords held that the defendant owed a duty of care to the plaintiff.<br>• The majority, led by Lord Wilberforce, found that the foreseeability of psychiatric harm, the close relationship between the plaintiff and the injured parties, and the plaintiff's proximity to the accident were sufficient to establish a duty of care.<br>• Lord Edmund-Davies and Lord Denning dissented, arguing that there was no proximity between the plaintiff and the defendant, and thus no duty of care existed.<br><br><strong>Key passage(s)</strong><br>• 'Reasonable foreseeability of physical injury to the person claiming damages resulting from the defendant's negligence is certainly not the sole test of the existence of a duty of care, but nevertheless when it is present, as it is here, it is a vital step towards establishing such a duty.' (Lord Bridge)<br>• 'Proximity in this context means not simply physical nearness in space but proximity in circumstances which make it reasonable to say that the party to whom the duty is alleged to be owed either is immediately and directly affected by the act, or is so closely in touch with the act that he can reasonably be said to be in risk.' (Lord Wilberforce)"
},
{
  "name": "Bolam v Friern Hospital Management Committee [1957] 1 WLR 582",
  "keywords": ["tort", "negligence", "medical negligence", "standard of care", "Bolam test"],
  "summary": "<strong>Facts</strong><br>• The plaintiff underwent electroconvulsive therapy at the defendant's hospital for his mental illness.<br>• During the treatment, the plaintiff suffered a fracture to his hip.<br>• The plaintiff claimed that the hospital was negligent in failing to take the necessary precautions to prevent such an injury.<br><br><strong>Issues</strong><br>• The primary issue was whether the hospital was negligent in its duty of care towards the plaintiff.<br>• The plaintiff argued that the hospital failed to take the necessary precautions to prevent his injury, while the hospital argued that they had followed the accepted medical practice at the time.<br><br><strong>Decision</strong><br>• The court held that the hospital was not negligent in its duty of care towards the plaintiff.<br>• The court applied the Bolam test, which states that a doctor is not negligent if they act in accordance with a practice accepted as proper by a responsible body of medical men skilled in that particular art.<br>• The court found that the hospital had followed the accepted medical practice at the time, and therefore, was not negligent.<br><br><strong>Key passage(s)</strong><br>• 'The test is the standard of the ordinary skilled man exercising and professing to have that special skill. A man need not possess the highest expert skill; it is well established law that it is sufficient if he exercises the ordinary skill of an ordinary competent man exercising that particular art.' (McNair J)<br>• 'The true test for establishing negligence in diagnosis or treatment on the part of a doctor is whether he has been proved to be guilty of such failure as no doctor of ordinary skill would be guilty of if acting with ordinary care.' (Devlin J)"
},
{
  "name": "Bolton v Stone [1951] AC 850",
  "keywords": ["tort", "negligence", "risk", "reasonable person"],
      "summary": "<strong>Facts</strong><br>• In Bolton v Stone [1951] AC 850, the plaintiff, Miss Stone, was injured by a cricket ball that had been hit from a nearby cricket ground. <br>• The cricket ground had a fence that was 17 feet high. <br>• In the previous 30 years, a ball had only been hit out of the ground six times, and this particular hit was estimated to have been a one in 100,000 chance. <br>• Miss Stone sued the cricket club for negligence. <br><br><strong>Issues</strong><br>• The issue in the case was whether the cricket club was negligent in not taking further precautions to prevent the rare occurrence of a cricket ball hitting a passer-by outside the ground. <br>• The plaintiff argued that the club was negligent in failing to take reasonable precautions to protect passers-by from injury. <br>• The defendant contended that the risk of injury was so small that it was not reasonably foreseeable, and therefore they were not negligent. <br><br><strong>Decision</strong><br>• The House of Lords held that there was no negligence on the part of the cricket club. <br>• They found that the risk of injury was so small that it was not reasonably foreseeable and that the club had taken sufficient precautions. <br>• The case distinguished between the magnitude of the risk and the likelihood of its occurrence. <br>• This decision was influenced by the Court of Appeal's decision in Miller v Jackson [1977] QB 966, which involved a similar situation and dealt with the concept of reasonable foreseeability.<br><br><strong>Key passage(s)</strong><br>• 'It is not every risk of the occurrence of which a person can reasonably foresee that imposes a duty of taking preventative action... where the risk is small, and the incidents are few and far between, the law does not require a person, ... in the management of his property, to guard against that risk.' (Lord Oaksey) <br>• 'You must balance the risk against the measures necessary to eliminate the risk... and if the risk is so small, that it can properly be regarded as fanciful, and, in any event, the measures necessary to eliminate the possibility of any danger would be wholly unreasonable, then no duty to take such measures arises at all.' (Lord Porter)"
},
{
  "name": "Hedley Byrne & Co Ltd v Heller & Partners Ltd [1964] AC 465",
  "keywords": ["tort", "negligent misstatement", "economic loss", "duty of care"],
  "summary": "<strong>Facts</strong><br>• Hedley Byrne &amp; Co Ltd (plaintiff) was a firm of advertising agents who relied on financial information provided by Heller &amp; Partners Ltd (defendant), a bank.<br>• Hedley Byrne sought advice from Heller regarding the financial position of a client who subsequently went into liquidation.<br>• Heller provided the advice, but it turned out to be incorrect, and Hedley Byrne suffered losses.<br>• Hedley Byrne sued Heller for negligent misstatement.<br><br><strong>Issues</strong><br>• The key issue was whether a duty of care existed between Heller and Hedley Byrne.<br>• The defendant argued that it had not assumed responsibility for the accuracy of the information it provided and that there was no special relationship between the parties that gave rise to a duty of care.<br><br><strong>Decision</strong><br>• The House of Lords held that a duty of care was owed by Heller to Hedley Byrne.<br>• The court found that a special relationship existed between the parties, as Hedley Byrne had made it clear that it was relying on Heller’s advice and had provided information about the use to which the advice would be put.<br>• The court stated that a duty of care could arise even in the absence of a contractual relationship and that a negligent misstatement could be actionable if it was made in circumstances where the speaker knew or ought to have known that the statement would be relied on by the recipient.<br><br><strong>Key passage(s)</strong><br>• Lord Devlin stated 'If someone possessed of a special skill undertakes, quite irrespective of contract, to apply that skill for the assistance of another person who relies upon such skill, a duty of care will arise. The fact that the service is to be given by means of or by the instrumentality of words can make no difference.'<br>• Lord Reid stated 'It is the law of Scotland that a person who, in the course of his business, profession or employment, gives advice to another person who relies upon it may in certain circumstances be liable to that person if the advice is negligently given. I think that this is also the law of England, but it is not necessary to decide that in this case.'<br>• Relevance<br>• This case established the principle of negligent misstatement, which has since been applied in many other cases. It also clarified the circumstances in which a duty of care could arise in the absence of a contractual relationship."
},
{
  "name": "Wilkinson v Downton [1897] 2 QB 57",
  "keywords": ["tort", "intentional infliction of harm", "psychiatric harm"],
      "summary": "<strong>Facts</strong><br>• The plaintiff, Mrs. Wilkinson, was tricked by the defendant, Downton, into believing that her husband had suffered a terrible accident at the defendant's pub.<br>• The defendant told her that her husband had fractured both of his legs and was lying in the pub, helpless and in great agony.<br>• As a result, the plaintiff experienced severe physical and emotional distress and ultimately sued Downton for damages.<br><br><strong>Issues</strong><br>• The plaintiff argued that the defendant's intentional and fraudulent misrepresentation caused her physical and emotional harm.<br>• The defendant contended that there was no actionable wrong as no physical force was used, and mental suffering alone is not a sufficient ground for liability.<br><br><strong>Decision</strong><br>• The court held that the defendant was liable as his conduct was a willful act unlawfully causing harm to the plaintiff.<br>• The court found that the defendant's conduct was a willful, malicious, and unlawful act that resulted in direct and immediate harm to the plaintiff.<br>• Though mental suffering alone is not sufficient for a tortious claim, the plaintiff's physical suffering in response to the defendant's misrepresentation was actionable.<br>• The court ultimately awarded £100 in damages to the plaintiff.<br><br><strong>Key passage(s)</strong><br>• 'A malicious falsehood, unattended with damage, might not be the ground of an action; but here there was palpable damage proximately caused by what the learned judge termed an act of willful misfeasance in wrongfully and maliciously procuring the plaintiff's illness.' (Wright J)<br>• 'The defendant by his wilful and wanton act, done with the knowledge that it would injure the plaintiff in her nervous system, has caused her to suffer by the shock of hearing the false statement.' (Lord Esher MR)<br>• 'The defendant has made a false and malicious statement calculated to cause physical injury to the plaintiff, a highly nervous woman, which does in fact cause immediate physical injury to her, and I think the rule is satisfied.' (Bowen LJ)"
},
{
  "name": "Home Office v Dorset Yacht Co Ltd [1970] AC 1004",
  "keywords": ["tort", "negligence", "duty of care", "omissions", "third parties"],
  "summary": "<strong>Facts</strong><br>• In Home Office v Dorset Yacht Co Ltd [1970] AC 1004, a group of young offenders who were being held in Borstal training (an open institution for offenders) were placed on a small island to complete some repair work under the supervision of prison officers.<br>• The officers negligently failed to supervise the young offenders, who then escaped from the island and ended up causing significant damage to the claimant's yachts moored in the harbor nearby.<br><br><strong>Issues</strong><br>• The main issue in this case was whether the Home Office could be held liable for the damages incurred by the claimant due to the negligent supervision of the young offenders.<br>• The Home Office argued that there was no duty of care owed by them to the claimant, as the harm caused was too remote from the negligent act of supervision.<br>• The claimant contended that the Home Office was liable as the damage was foreseeable and a direct result of their negligent supervision.<br><br><strong>Decision</strong><br>• The House of Lords held that the Home Office was liable for the damages incurred by the claimant.<br>• It was held that the Home Office did owe a duty of care to the claimant, as it was reasonably foreseeable that the young offenders could cause damage to the yachts if they were not adequately caused was also deemed to be a natural and probable consequence of the negligent supervision.<br><br><strong>Key passage(s)</strong><br>• '[W]hen a new point arises one should ask oneself not whether the alleged liability is covered by authority but whether recognised principles apply to the case. ... The crucial question in the present case is, in my opinion not whether the appellant's officers' intervention can be brought under one or other of the words 'escaped or been let loose' but whether they created a source of danger which they ought to have known might, unless controlled, cause damage to the respondents' property.' (Lord Reid)<br>• 'In cases where the damage is brought about by the deliberate act of a third party, it is relevant in determining whether a duty of care existed to consider the likelihood of such an intervening act: if the whole course of events is likely, the existence of a duty of care may be established but not otherwise.' (Lord Morris)<br>• 'Once it is established that the man who creates a source of danger is potentially liable to anyone, whether he be an adult or a child or a madman or a criminal, - who can reasonably be anticipated to be exposed to that risk, it might logically be thought that the creator of the danger should also be liable to anyone who acts just as foreseeably in response to the temptation which the danger presents.' (Lord Diplock)"
},
{
  "name": "Anns v Merton London Borough Council [1978] AC 728",
  "keywords": ["tort", "negligence", "duty of care", "building regulations"],
      "summary": "<strong>Facts</strong><br>• In Anns v Merton London Borough Council, a local authority was sued because a building they inspected and certified as safe had defects, causing it to be demolished.<br>• The plaintiffs were lessees of the flats, who claimed that the council was negligent.<br>• The council argued that they owed no duty of care to the plaintiffs.<br><br><strong>Issues</strong><br>• The plaintiffs argued that the council owed them a duty of care because they relied on their inspection and approval.<br>• The council contended that they owed no such duty because they had not directly assumed responsibility for the plaintiffs.<br><br><strong>Decision</strong><br>• The House of Lords held in favour of the plaintiffs, finding the council owed a duty of care to them.<br>• This decision introduced a two-stage test of proximity and policy, determining that a duty of care existed.<br>• The court considered the case of Donoghue v Stevenson, wherein a duty of care was established due to the neighbour principle, and expanded on this principle.<br><br><strong>Key passage(s)</strong><br>• 'Through the trilogy ofcases running from Hedley Byrne & Co Ltd v Heller & Partners Ltd [1964] AC 465, through Dorset Yacht Co Ltd v Home Office [1970] AC 1004, to Home Office v Dorset Yacht Co Ltd [1970] AC 1004, the conception of proximity has been further refined so as to embrace not only physical proximity, temporal proximity and circumstantial proximity, but also proximity of relationship.' (Lord Wilberforce)<br>• '[W]hether, to adopt the phrase first used by Lord Atkin, the matter in respect of which a duty of care was sought...will in the generality of cases have been something sufficiently proximate in the Donoghue v Stevenson sense.' (Lord Keith of Kinkel)"
},
{
  "name": "Nettleship v Weston [1971] 2 QB 691",
  "keywords": ["tort", "negligence", "standard of care", "learner driver"],
      "summary": "<strong>Facts</strong><br>• Nettleship v Weston [1971] 2 QB 691 is an English tort law case concerning the standard of care required by learners in negligence.<br>• Mrs. Weston was a learner driver under the supervision of Mr. Nettleship, who was an experienced driver.<br>• Mrs. Weston negligently lost control of the vehicle, causing an accident that resulted in Mr. Nettleship's injury.<br>• Mr. Nettleship sued Mrs. Weston for negligence.<br><br><strong>Issues</strong><br>• The main issue was whether a learner driver, Mrs. Weston, should be held to the same standard of care as an experienced driver in a negligence claim.<br>• Mrs. Weston's argument was that, as a learner driver, she should only be expected to exercise the level of skill reasonably expected for a beginner driver – not the same level expected from a fully qualified and experienced driver.<br>• Mr. Nettleship argued that Mrs. Weston should be held to the same standard of care as an experienced driver.<br><br><strong>Decision</strong><br>• The Court of Appeal held that Mrs. Weston was liable for the negligence as she should be held to the same standard of care as an experienced driver.<br>• The court reasoned that imposing a lower standard of care for learners would not be fair to the rest of the road users who expect a minimum standard of care from everyone on the road.<br>• The court also referenced the principle established in Paris v Stepney [1951] AC 367, that a defendant can only be held to a standard of reasonable care which was objective, not subjective to the individual.<br><br><strong>Key passage(s)</strong><br>• 'The learner driver must attain at least the objective standard of the reasonable driver, for the safety of other road users demands no less.' (Lord Denning MR)<br>• 'All who go on the road must exercise their skill and care, so as not needlessly to imperil others… The only standard is the standard of the reasonable man.'"
},
{
  "name": "Paris v Stepney Borough Council [1951] AC 367",
  "keywords": ["tort", "negligence", "standard of care", "employer's duty"],
      "summary": "<strong>Facts</strong><br>• The plaintiff, Mr. Edmund Paris, was a one-eyed car mechanic employed by Stepney Borough Council.<br>• The defendant provided protective goggles to employees performing welding work, but not to those doing general mechanical work.<br>• An accident occurred in the course of Paris's employment in which a metal shaving entered his only good eye, leading to total blindness.<br>• Paris brought an action against the Council for negligence, claiming a duty to provide protective goggles.<br><br><strong>Issues</strong><br>• Paris argued that the employer had a duty to provide goggles due to the foreseeability of harm and the gravity of potential injury.<br>• The Council argued that no such duty existed, given the rarity of such accidents and the added cost of providing goggles for all employees.<br>• The court needed to address whether the employer breached its duty of care by not providing goggles to Paris, even if the risk was minimal.<br><br><strong>Decision</strong><br>• The House of Lords held that the Council was liable for Paris's injuries.<br>• The Council breached its duty of care by not providing Paris with protective goggles, given the foreseeable risk of serious injury.</strong><br>• The employer's knowledge of the plaintiff's vulnerability was a crucial factor in finding a breach of duty.<br><br><strong>Key passage(s)</strong><br>• Lord Oaksey: 'In considering...whether there has been any want of due care, one of the most important factors must be the degree of the risk that injury would result.'<br>• Lord Normand: 'The calculation of risk and the relationship of risk to expense may sometimes require further refinement; for sometimes the injured person is peculiarly exposed to risk and then the question is whether the precautions were so expensive as to leave a reasonable employer to accept the risk.'<br>• Lord MacDermott: 'The degree of the risk must indeed be an important, if not the main, element in determining whether there has been an actionable want of due care.'"
},
{
  "name": "Overseas Tankship (UK) Ltd v Morts Dock and Engineering Co Ltd (The Wagon Mound) [1961] AC 388",
  "keywords": ["tort", "negligence", "remoteness of damage", "reasonable foreseeability"],
      "summary": "<strong>Facts</strong><br>• In the case of Overseas Tankship (UK) Ltd v Morts Dock and Engineering Co Ltd (The Wagon Mound) [1961] AC 388, the defendant's vessel, the Wagon Mound, was moored in the claimant's wharf in Sydney Harbour to undergo repairs.<br>•During these repairs, a piece of cotton waste saturated with oil caught fire, with sparks igniting oil which had leaked into the harbor water from the Wagon Mound.<br>•The fire caused significant damage to two of the claimant's vessels as well as their wharf.<br><br><strong>Issues</strong><br>• The issue in this case was whether the defendant was liable for the damage caused by the fire.<br>• The claimant argued that the defendant was negligent in allowing the oil to leak into the harbor, which caused the fire.<br>• The defendant argued that the fire was not foreseeable, and thus they should not be held liable for the damages.<br><br><strong>Decision</strong><br>• The House of Lords held that the defendant was not liable for the damage.<br>• The court applied the test of foreseeability, established in Donoghue v Stevenson [1932] UKHL 100, and found that the defendant could not have reasonably foreseen that their negligence would lead to the fire and consequent damages.<br>• In reaching this decision, the court also overruled the case of Re Polemis & Furness Withy & Co Ltd [1921] 3 KB 560, which held that once negligence was established, a defendant would be liable for all direct consequences of their actions, regardless of whether the consequences were foreseeable.<br><br><strong>Key passage(s)</strong><br>• 'It is sufficient to say that in their Lordships' opinion 'the essential factor in determining liability is whether the damage is of such a kind as the reasonable man should have foreseen.' Which means, of course, whether the reasonable man would have foreseen, not the exact sequence of events, but that kind of damage.' (Viscount Simonds)<br>• 'A man must be regarded as responsible for the probable consequences of his act. To demand more of him is too harsh a rule, to demand less is to endanger the public interest.' (Lord Reid)"
},
{
  "name": "Page v Smith [1996] AC 155",
  "keywords": ["tort", "negligence", "psychiatric harm", "foreseeability"],
      "summary": "<strong>Facts</strong><br>• Page sustained a depressive illness as a result of the 1988 accident when Smith lost control of his car which hit Page's vehicle.<br>• Page was suffering from myalgic encephalomyelitis (ME) at the time, but Smith was not aware of this.<br>• The depressive illness worsened Page's ME resulting in severe disability, and he claimed damages from Smith.<br><br><strong>Issues</strong><br>• The main issue was whether Smith was liable for Page's worsening ME condition resulting from the depressive illness.<br>• Smith argued that he should not be held liable as the ME was an unforeseeable consequence of the accident, and the psychiatric injury was a mere materialization of an existing disease.<br>• Page argued that his ME condition would not have worsened if not for the accident.<br><br><strong>Decision</strong><br>• The House of Lords held Smith liable for the worsening of Page's ME condition as a result of the injury sustained in the accident.<br>• The Lords applied the eggshell skull rule and reasoned that finding liability did not depend on whether the consequences were foreseeable or not.<br>• The Lords also referred to the case of Bourhill v Young [1943] AC 92, where no duty of care arose regarding unforeseen psychiatric harm.<br>• However, in this case, a duty of care existed as the physical injury caused by Smith's negligence worsened Page's ME condition.<br><br><strong>Key passage(s)</strong><br>• '[T]he law gives effect to the 'egg-shell skull' rule which requires a tortfeasor to take his victim as he finds him' (Lord Clyde).<br>• 'If one accepts that there is a risk of injury from such an accident, I do not see how one can divorce the consequences flowing from Page's particular reaction to the accident from the risk of injury involved in the accident' (Lord Lloyd)."
},
{
  "name": "Smith v Leech Brain & Co Ltd [1962] 2 QB 405",
  "keywords": ["tort", "negligence", "thin skull rule", "remoteness of damage"],
      "summary": "<strong>Facts</strong><br>• In Smith v Leech Brain & Co Ltd [1962] 2 QB 405, the claimant, Mr. Smith, worked in the defendant's factory.<br>• An accident occurred whereby the claimant was splashed with a small amount of molten metal.<br>• The metal burned Mr. Smith's lip, leading to the development of cancer and his subsequent death.<br>• The claimant's widow brought an action for damages.<br><br><strong>Issues</strong><br>• The key issue in the case was whether the defendant could be held liable for Mr. Smith's death.<br>• The defendant argued that his death resulted from an unforeseeable consequence of the accident, and therefore they should not be held liable.<br>• Conversely, the claimant's widow argued that the defendant was liable as they had breached their duty of care by allowing the accident to happen.<br><br><strong>Decision</strong><br>• The court held that the defendants were liable for Mr. Smith's death. <br>• The court applied the principle established in Hughes v Lord Advocate [1963] AC 837, which stated that if the injury was foreseeable, the defendant would be liable for the entire consequences of their actions, even if the extent of the harm was not foreseeable.<br>• In this case, it was foreseeable that the claimant could suffer burn injuries from the molten metal.<br>• Thus, the defendant was held liable for the full extent of the harm caused to the claimant.<br><br><strong>Key passage(s)</strong><br>• 'If a man is negligently run over when he is suffering from some internal disease which makes it likely that the injuries sustained will be graver than they would be to a healthy man, the motorist is not excused from paying for the grave consequences' (Lord Morris of Borth-Y-Gest).<br>• 'If A negligently injures B, I do not believe that A can escape liability merely because matters take a turn not contemplated' (Lord Pearce).<br>• 'It is true that in some cases the disease can be regarded as the real cause of the loss, but there are too many cases where it is difficult or impossible to say whether the disease or the accident is the effective cause for one to draw any line of demarcation between the two cases' (Lord Guest)."
},
{
  "name": "Cambridge Water Co Ltd v Eastern Counties Leather plc [1994] 2 AC 264",
  "keywords": ["tort", "negligence", "remoteness of damage", "foreseeability", "environmental pollution"],
      "summary": "<strong>Facts</strong><br>• Cambridge Water Co Ltd (Cambridge Water) provided water to customers and owned a nearby borehole.<br>• Eastern Counties Leather plc (ECL) owned a tannery that contaminated the borehole's groundwater with solvents.<br>• The chemicals were found to be too high for consumption, rendering the borehole unusable.<br>• Cambridge Water sued ECL for the loss of their water supply.<br><br><strong>Issues</strong><br>• Whether ECL should be held liable for negligently causing contamination to the groundwater.<br>• The foreseeability of the harm caused.<br>• ECL's argument that they should not be held liable due to the unknown long-term effects of the chemicals used, and lack of knowledge that the chemicals would contaminate the borehole.<br>• Cambridge Water's argument that ECL should be held liable for the contamination, as they were negligent in disposing the chemicals.<br><br><strong>Decision</strong><br>• The House of Lords held that ECL was not liable for Cambridge Water's losses due to the contamination of the borehole.<br>• The court found that the harmful effects of the contaminants were not reasonably foreseeable by ECL, as neither party knew, or should have known, about the harmful relationship between the chemicals and groundwater.<br>• Additionally, the court held that a reasonable person in ECL's position would not have taken any additional precautions in disposing of the chemicals.<br>• The court applied the 'reasonable foreseeability of harm' test from Rylands v Fletcher (1868) LR 3 HL 330, stating that foreseeability was a significant factor in determining ECL’s responsibility.<br><br><strong>Key passage(s)</strong><br>• 'In my judgment, the requirement that the damage should have been reasonably foreseeable in the sense I have indicated accords both with principle and with the doctrine of Rylands v. Fletcher itself. It is also consistent with this House's decisions in Albery v. B.G.C. Ltd. [1985] A.C. 1044 and Maher v. Southern Water Authority.' (Lord Goff)"
},
{
  "name": "Hill v Chief Constable of West Yorkshire [1989] AC 53",
  "keywords": ["tort", "negligence", "police", "duty of care"],
      "summary": "<strong>Facts</strong><br>• In 1980, Jacqueline Hill was the 13th victim of the notorious 'Yorkshire Ripper,' Peter Sutcliffe.<br>• The police investigation had been severely criticized for its handling of the case, including failure to arrest Sutcliffe earlier.<br>• Hill's mother sued West Yorkshire's Chief Constable, alleging negligence and seeking damages.<br>• The case ultimately reached the House of Lords in 1989.<br><br><strong>Issues</strong><br>• The central issue was whether the police owed a duty of care to individual members of the public, specifically to potential victims of serial killers.<br>• The plaintiff argued that the police were negligent in their investigation and breached their duty, leading to the death of Ms. Hill.<br>• Conversely, the defendant contended that there was no duty of care owed to individual members of the public in relation to the detection and prevention of crimes.<br><br><strong>Decision</strong><br>• The House of Lords ruled in favor of the defendant, holding that the police do not owe a duty of care to individual members of the public in relation to the investigation and prevention of crime.<br>• This was based on public policy considerations, including the risk that imposing such a duty would divert police resources and impede effective law enforcement.<br>• The Court also relied on the precedent set in Anns v Merton London Borough Council [1978] AC 728, which established a two-stage test for determining whether a duty of care exists.<br><br><strong>Key passage(s)</strong><br>• 'It is indeed clear that this is a field in which the imposition of a duty of care may lead not to greater care but to defensive practices having the consequence that the police turned their energies to the avoidance of such liability instead of concentrating on their responsibilities for the prevention and detection of crime.' (Lord Keith)<br>• 'It would be contrary to the public interest to impose on police forces and their officers a liability in damages which would entail that they might from time to time be called on to account in the ordinary courts for the way in which they had performed their functions.' (Lord Keith)<br>• 'I can find no threat to the proficiency of the police in the ambit within which they are at present answerable to the law.' (Lord Oliver)"
},
{
  "name": "Murphy v Brentwood District Council [1991] 1 AC 398",
  "keywords": ["tort", "negligence", "economic loss", "duty of care", "property damage"],
      "summary": "<strong>Facts</strong><br>• The plaintiff, Mr. Murphy, purchased a house from Brentwood District Council, the defendants.<br>• Drainage works related to the house were not properly constructed, causing the house to be damaged and unsafe for habitation.<br>• Mr. Murphy sued the council for the cost of repairing the house and won in the lower courts, relying on the principle of negligence established in Anns v Merton London Borough Council (1978).<br><br><strong>Issues</strong><br>• The council argued that it did not owe a duty of care to Mr. Murphy, as any loss was purely economic.<br>• Mr. Murphy claimed that the council owed a duty of care in construction resulting in physical damage to the house.<br><br><strong>Decision</strong><br>• The House of Lords unanimously overturned the lower courts' decisions.<br>• They held that the damage was purely economic rather than physical, as the house itself was not damaged but rather reduced in value due to the negligent construction.<br>• In doing so, the House of Lords overruled the Anns case, holding that the local authority does not owe a duty of care to protect against purely economic loss arising from construction defects.<br><br><strong>Key passage(s)</strong><br>• 'The time has now come for the Anns test to be laid to rest'[...]The purpose of such liability is to afford compensation for loss;' (Lord Keith of Kinkel)"
},
{
  "name": "Watson v British Boxing Board of Control [2001] QB 1134",
  "keywords": ["tort", "negligence", "duty of care", "sporting injury"],
      "summary": "<strong>Facts</strong><br>• In this case, Michael Watson, a professional boxer, sustained severe brain damage during a world title fight against Chris Eubank.<br>• The British Boxing Board of Control (BBBC) was the body responsible for regulating the sport, including the safety measures enforced during fights.<br>• Watson argued that the BBBC was in breach of the duty of care that they owed him as a participant, and he sought damages for personal injury.<br><br><strong>Issues</strong><br>• Watson's legal team argued that the BBBC owed a duty of care to ensure his safety, which was breached by inadequate safety regulations such as the lack of medical staff present at the event, as well as the absence of proper procedures to manage head injuries during the fight.<br>• The BBBC denied that such a duty of care existed, and contended that Watson voluntarily participated in a dangerous sport and thus assumed the risk of injury.<br><br><strong>Decision</strong><br>• The court held that the BBBC did indeed owe a duty of care to Watson, and was in breach of this duty because of its inadequate safety measures.<br>• Watson was awarded damages for his injuries.<br>• The court established that governing bodies of sports can be held liable for breaching their duty of care to participants if they fail to take reasonable steps to ensure safety.<br><br><strong>Key passage(s)</strong><br>• 'In those circumstances the Board does, in our judgment, owe a duty to exercise reasonable care in carrying out its regulatory functions in relation to the promotion of the safety of professional boxers' (Lord Justice Phillips).<br>• 'The rules of the Board and its enforcement of them may actually have the effect of increasing the risk to the boxer by encouraging him to continue a contest when, but for the referee's intervention, he would have retired' (Lord Justice Phillips)."
},
  {
    "name": "R v Dudley and Stephens (1884) 14 QBD 273 DC",
    "keywords": ["criminal", "necessity", "murder", "cannibalism", "shipwreck"],
    "summary": "<strong>Facts</strong><br>• In 1884, four men, including Thomas Dudley and Edwin Stephens, were stranded at sea for 20 days after their yacht sank.<br>• They were without food or water for several days and became delirious.<br>• In their desperation, Dudley and Stephens killed and ate the cabin boy, Richard Parker, who was 17 years old.<br>• Upon their rescue, they were charged with murder.<br><br><strong>Issues</strong><br>• The main issue was whether the men were guilty of murder or if they could rely on the defence of necessity.<br>• The defence argued that they had acted out of necessity to save their own lives, and that the boy would have died anyway.<br>• The prosecution argued that the men had committed murder and that there was no defence for their actions.<br><br><strong>Decision</strong><br>• The court held that the men were guilty of murder and rejected the defence of necessity.<br>• The judges stated that there was no absolute rule that the preservation of a person's own life justified taking the life of an innocent person.<br>• The court emphasized the importance of the sanctity of human life and the need to maintain social order, even in extreme circumstances.<br><br><strong>Key passage(s)</strong><br>• 'It is not necessary to consider whether the killing of the boy was or was not a murder if the killing was a necessity, because that necessity did not arise. The prisoners before killing the boy had not reduced themselves to the last extremity of hunger, thirst, and exhaustion.' (Lord Coleridge CJ)<br>• 'I cannot see any sufficient reason for extending the rule which permits acts of self-defence to cases such as this, and I think that the plea of necessity cannot be supported.' (Lord Huddleston)<br>• 'In my opinion the whole law on the subject of necessity is extremely unsatisfactory. It is founded partly on mistaken analogies, partly on a too literal and narrow reading of decided cases.' (Lord Blackburn)"
  },
  {
    "name": "R v R [1992] 1 AC 599, HL",
    "keywords": ["criminal", "rape", "marital rape", "consent"],
      "summary": "<strong>Facts</strong><br>• In 1991, a husband and wife separated but were not yet divorced.<br>• The husband raped his wife against her will after they separated.<br>• The husband was charged with rape.<br>• Before this case, it was widely accepted that a husband could not be charged with raping his wife ('marital rape exemption').<br><br><strong>Issues</strong><br>• The prosecution argued that the marital rape exemption should no longer exist in law, as it is outdated and contrary to modern society's recognition of equal rights for women.<br>• The defense argued that the marital rape exemption is a well-established principle and should continue to apply.<br><br><strong>Decision</strong><br>• The House of Lords (HL) decided that the marital rape exemption should no longer apply.<br>• The husband was found guilty of rape, and the decision effectively abolished the marital rape exemption in English law.<br>• There was no need to wait for Parliament to legislate changes.<br><br><strong>Key passage(s)</strong><br>'Nowadays it cannot seriously be maintained that by marriage a wife submits herself irrevocably to sexual intercourse in all circumstances and to any act of physical intimacy on the part of her husband which may be involved.' (Lord Keith of Kinkel)<br>• 'It is the essence of the common law to respond to changing social conditions by adapting and modifying its rules.' (Lord Keith of Kinkel)<br>• 'There is no longer any rational justification for continuing to treat sexual intercourse in marriage as a category of conduct to which special rules apply.' (Lord Lowry)"
  },
  {
    "name": "R v Gnango [2011] UKSC 59",
    "keywords": ["criminal", "joint enterprise", "murder", "transferred malice"],
      "summary": "<strong>Facts</strong><br>• In R v Gnango [2011] UKSC 59, the appellant, Gnango, was involved in a shootout with another man known as 'Bandana Man'.<br>• Both fired guns at each other in a public place, however neither of them was harmed.<br>• While Bandana Man was aiming at Gnango, a stray bullet struck and killed an innocent bystander.<br>• Gnango was subsequently charged and convicted with murder based on the doctrine of joint enterprise.<br>• He appealed, arguing that the trial judge failed to properly direct the jury on the issue of joint enterprise, which resulted in his conviction.<br><br><strong>Issues</strong><br>• The main issue was whether Gnango could be held liable for the murder, even though he did not directly cause the death of the bystander.<br>• The prosecution argued that both men were engaged in a criminal enterprise, namely a gunfight, which resulted in the murder, and therefore both were liable for the crime.<br>• The defense argued that Gnango could not be held liable as he was neither the principal offender nor had the intention to assist or encourage Bandana Man in committing the murder.<br><br><strong>Decision</strong><br>• The Supreme Court, in a 5-2 majority, upheld Gnango's conviction for murder.<br>• The Court found that both participants in the criminal joint enterprise, assuming that each intended to kill or cause serious harm, could be held liable for the murder that arose from the execution of that enterprise.<br>• The Court also rejected the argument that jury's verdict was inconsistent, finding that the joint enterprise requirement of necessary foresight had been satisfied in Gnango's case.<br><br><strong>Key passage(s)</strong><br>• 'There can be no doubt that both appellants were engaged together in a violent gunfight [...] Their agreement to fight each other provided assistance and encouragement for the commission of their respective individual acts of violence' (Lord Phillips).<br>• 'In my judgment the unlawfulness of the criminal joint enterprise lies not in the absence of such an agreement, but in the fact that the principal and the secondary party have unlawfully combined together, intending that each should commit a specified unlawful act or a specified type of unlawful act.' (Lord Dyson)."
  },
  {
    "name": "R v Brown [1994] 1 AC 212",
    "keywords": ["criminal", "consent", "sadomasochistic", "assault"],
      "summary": "<strong>Facts</strong><br>• In R v Brown, a group of five participants engaged in consensual sado-masochistic acts, causing each other varying degrees of physical harm.<br>• The acts included beatings, brandings, and genital torture, but the participants had all willingly consented to the harm.<br>• They were convicted under the Offences Against the Person Act 1861 (OAPA) for assault occasioning actual bodily harm (ABH) and unlawful wounding.<br>• The defendants appealed, arguing that consent was a valid defence.<br><br><strong>Issues</strong><br>• The main issue was whether the defendants' consent to the harm could serve as a valid defence to the charges under the OAPA.<br>• The defendants argued that because the acts were conducted in private, between consenting adults, and without any lasting harm, consent should be a valid defence.<br>• The prosecution argued that, considering the serious nature of the inflicted harm, public policy required that consent be invalid as a defence.<br><br><strong>Decision</strong><br>• The House of Lords upheld the convictions, ruling that consent was not a valid defence to ABH and unlawful wounding in these circumstances.<br>• The judges held that, even though the acts were consensual, the public policy concerns regarding violent and dangerous behaviour prevailed over the interests of individual privacy and autonomy.<br>• The court referred to R v Donovan (1934) and R v Wilson (1996), finding that, previously, consent had not been considered a valid defence in cases involving such serious harm.<br><br><strong>Key passage(s)</strong><br>• 'Society is entitled and bound to protect itself against a cult of violence. Pleasure derived from the infliction of pain is an evil thing. Cruelty is uncivilised.' (Lord Templeman)<br>• 'The state has an interest in maintaining a decent society, and that means controlling the extent to which one citizen can cause harm to another.' (Lord Lowry)"
  },
  {
    "name": "R v Woolin [1999] 1 AC 82, HL",
    "keywords": ["criminal", "murder", "mens rea", "oblique intention"],
      "summary": "<strong>Facts</strong><br>• The appellant, Mr. Woolin, threw his three-month-old son across the room, who consequently suffered a fatal head injury.<br>• Woolin was charged with murder and the trial judge directed the jury using the test for oblique intention provided in R v Nedrick [1986] 3 All ER 1 (the defendant should foresee that the prohibited result is 'virtually certain' to occur).<br>• Woolin was convicted of murder, but the Court of Appeal reduced the conviction to manslaughter.<br>• The Crown appealed this decision to the House of Lords.<br><br><strong>Issues</strong><br>• The key issue was whether the Nedrick test for oblique intention was correct in directing juries in cases of murder where direct intent could not be proven.<br>• The Crown argued that the test was correct and that Woolin's conviction for murder should be reinstated.<br>• Woolin argued that the test was not correct and that his conviction for manslaughter should stand.<br><br><strong>Decision</strong><br>• The House of Lords held that the Nedrick test should not be regarded as a separate test for intent, but rather a clarification of the ordinary meaning of intention.<br>• It was decided that a jury should find intention if satisfied that the defendant foresaw death or serious bodily harm as a 'virtual certainty' but that foreseeing a result is not the same as intending it.<br>• The Lords dismissed the Crown's appeal and upheld Woolin's conviction for manslaughter.<br><br><strong>Key passage(s)</strong><br>• 'Where the charge is murder and in the rare cases where the simple direction is not enough, the jury should be directed that they are not entitled to infer the necessary intention, unless they feel sure that death or serious bodily harm was a virtual certainty (barring some unforeseen intervention) as a result of the defendant's actions and that the defendant appreciated that such was the case.' (Lord Steyn)<br>• 'We take the opportunity of affirming the decision of the Court of Appeal in this case that to substitute 'a substantial risk' for 'a virtual certainty' is a misdirection.' (Lord Hope)"
  },
  {
    "name": "R v Ireland; R v Burstow [1998] AC 147",
    "keywords": ["criminal", "harassment", "psychological harm", "assault"],
      "summary": "<strong>Facts</strong><br>• R v Ireland and R v Burstow were two separate cases that were heard together by the House of Lords (HL).<br>• Ireland was accused of making silent phone calls to three women, causing them psychological harm.<br>• Burstow stalked a woman and engaged in acts such as making harassing phone calls, entering her home without permission, and sending her offensive mail.<br>• Both women suffered from psychological harm as a result of their respective ordeals, with the victim of Burstow developing clinical depression.<br><br><strong>Issues</strong><br>• The issue was whether in the offences of assault occasioning actual bodily harm (ABH) under the s47 Offences Against the Person Act 1861 and malicious wounding or infliction of grievous bodily harm (GBH) under the s20 Offences Against the Person Act 1861, 'bodily harm' could include psychological harm.<br>• The defendants argued that only physical harm should be considered 'bodily harm'.<br>• The prosecution argued that psychological harm should be included within the definition of 'bodily harm'.<br><br><strong>Decision</strong><br>• The HL, in a unanimous decision, held that 'bodily harm' could include psychological harm.<br>• The convictions for Ireland and Burstow were upheld.<br>• The Lords distinguished R v Donovan [1934] 2 KB 498, ruling that Donovan's reasoning that 'bodily harm' was limited to physical harm could not stand.<br><br><strong>Key passage(s)</strong><br>• 'I would therefore construe the word 'inflict' as requiring neither assault nor battery and as extending to the case where the harm is done by any unlawful act.' (Lord Steyn)<br>• 'We have, therefore, reached the conclusion that psychiatric injury comes within the expression 'bodily harm'.' (Lord Steyn)<br>• 'If the words 'actual bodily harm' are to be limited to physical bodily harm, that limitation must derive from the word 'bodily', because the natural meaning of 'actual harm' is simply real or substantial harm, as opposed to harm which is merely transient or trifling. It seems to us that to attach to the word 'bodily' such connotations is not warranted in the context of the Act.' (Lord Steyn)"
  },
  {
    "name": "DPP v Majewski [1977] AC 443",
    "keywords": ["criminal", "voluntary intoxication", "basic intent", "assault"],
      "summary": ""
  },
  {
    "name": "R v Blaue [1975] 1 WLR 1411",
    "keywords": ["criminal", "thin skull rule", "manslaughter", "religious belief"],
      "summary": ""
  },
  {
    "name": "R v Savage; DPP v Parmenter [1992] 1 AC 699",
    "keywords": ["criminal", "mens rea", "assault", "grievous bodily harm"],
      "summary": ""
  },
  {
    "name": "R v G and Another [2004] 1 AC 1034",
    "keywords": ["criminal", "arson", "recklessness", "youth"],
      "summary": ""
  },
  {
    "name": "R v Mohan [1976] QB 1",
    "keywords": ["criminal", "mens rea", "driving", "intent"],
      "summary": ""
  },
  {
    "name": "R v Moloney [1985] 1 AC 905",
    "keywords": ["criminal", "murder", "mens rea", "intent"],
      "summary": ""
  },
  {
    "name": "R v Nedrick [1986] 1 WLR 1025",
    "keywords": ["criminal", "murder", "mens rea", "intent"],
      "summary": ""
  },
  {
    "name": "R v Hancock and Shankland [1986] AC 455",
    "keywords": ["criminal", "murder", "mens rea", "intent"],
      "summary": ""
  },
  {
    "name": "R v Matthews and Alleyne [2003] EWCA Crim 192",
    "keywords": ["criminal", "murder", "mens rea", "foresight"],
      "summary": ""
  },
    {
  "name": "Ashburn Anstalt v Arnold [1989] Ch 1",
  "keywords": ["land law", "proprietary estoppel", "unconscionability"],
      "summary": ""
},
{
  "name": "Baker v Baker [1993] 1 WLR 925",
  "keywords": ["land law", "trusts of land", "overreaching"],
      "summary": ""
},
{
  "name": "Bolton v Mahadeva [1972] 1 WLR 1009",
  "keywords": ["land law", "contractual obligations", "building contract"],
      "summary": ""
},
{
  "name": "Birmingham Midshires Mortgage Services Ltd v Sabherwal [2000] All ER (D) 180",
  "keywords": ["land law", "mortgages", "priorities"],
      "summary": ""
},
{
  "name": "Bruton v London and Quadrant Housing Trust [2000] 1 AC 406",
  "keywords": ["land law", "leases", "non-proprietary leases"],
      "summary": ""
},
{
  "name": "Carlton Credit Corporation Ltd v Wishaw Metal Co [1972] AC 661",
  "keywords": ["land law", "mortgages", "creditors"],
      "summary": ""
},
{
  "name": "City of London Building Society v Flegg [1988] AC 54",
  "keywords": ["land law", "overreaching", "trusts of land"],
      "summary": ""
},
{
  "name": "Cobbe v Yeoman's Row Management Ltd [2008] UKHL 55",
  "keywords": ["land law", "proprietary estoppel", "contracts for land"],
      "summary": ""
},
{
  "name": "Collins v Hertfordshire County Council [1947] Ch 598",
  "keywords": ["land law", "highways", "public rights of way"],
      "summary": ""
},
{
  "name": "Dillwyn v Llewelyn [1862] EWHC Ch J67",
  "keywords": ["land law", "gifts of land", "deeds"],
      "summary": ""
},
{
  "name": "Etridge (No.2) [2002] 2 AC 773",
  "keywords": ["land law", "undue influence", "mortgages"],
      "summary": ""
},
    {
"name": "Carlill v Carbolic Smoke Ball Company [1893] 1 QB 256",
"keywords": ["contract", "offer and acceptance", "unilateral contract", "consideration", "performance"],
      "summary": ""
},
{
"name": "Pharmaceutical Society of Great Britain v Boots Cash Chemists [1953] 1 QB 401",
"keywords": ["contract", "offer and acceptance", "self-service", "invitation to treat", "retail"],
      "summary": ""
},
{
"name": "Partridge v Crittenden [1968] 1 WLR 1204",
"keywords": ["contract", "offer and acceptance", "advertisement", "invitation to treat"],
      "summary": ""
},
{
"name": "Fisher v Bell [1961] 1 QB 394",
"keywords": ["contract", "offer and acceptance", "sale of goods", "invitation to treat", "criminal law"],
      "summary": ""
},
{
"name": "Smith v Hughes [1871] LR 6 QB 597",
"keywords": ["contract", "offer and acceptance", "mistake", "subjective intent", "objective intent"],
      "summary": ""
},
{
"name": "Harvey v Facey [1893] AC 552",
"keywords": ["contract", "offer and acceptance", "communication", "land", "reply"],
      "summary": ""
},
{
"name": "Entores Ltd v Miles Far East Corporation [1955] 2 QB 327",
"keywords": ["contract", "offer and acceptance", "communication", "telex", "crossed messages"],
      "summary": ""
},
{
"name": "Hyde v Wrench [1840] EWHC Ch J90",
"keywords": ["contract", "offer and acceptance", "counter-offer", "rejection", "bilateral contract"],
      "summary": ""
},
{
"name": "Household Fire and Carriage Accident Insurance Co Ltd v Grant [1879] 4 Ex D 216",
"keywords": ["contract", "offer and acceptance", "postal rule", "communication", "share allocation"],
      "summary": ""
},
{
"name": "Dunlop Pneumatic Tyre Co Ltd v Selfridge & Co Ltd [1915] AC 847",
"keywords": ["contract", "consideration", "third party rights", "privity", "restrictive covenant"],
      "summary": ""
},
{
"name": "Tweddle v Atkinson [1861] EWHC QB J57",
"keywords": ["contract", "consideration", "third party rights", "privity", "marriage"],
      "summary": ""
},
{
"name": "Williams v Roffey Bros & Nicholls (Contractors) Ltd [1991] 1 QB 1",
"keywords": ["contract", "consideration", "economic duress", "modification", "performance"],
      "summary": ""
},
{
"name": "Foakes v Beer [1884] UKHL 1",
"keywords": ["contract", "consideration", "part payment", "debt", "judgment"],
      "summary": ""
},
{
"name": "Hadley v Baxendale [1854] EWHC J70",
"keywords": ["contract", "damages", "foreseeability", "breach", "mitigation"],
      "summary": ""
},
    {
  "name": "Penn v Lord Baltimore (1750) 1 Ves Sen 444",
  "keywords": ["equity", "specific performance", "contract enforcement"],
      "summary": ""
},
{
  "name": "Tulk v Moxhay [1848] EWHC Ch J34",
  "keywords": ["equity", "real property", "covenant", "burden of covenant", "third party rights"],
      "summary": ""
},
{
  "name": "Errington v Errington & Woods [1952] 1 KB 290",
  "keywords": ["equity", "constructive trust", "contract", "part performance"],
      "summary": ""
},
{
  "name": "Walsh v Lonsdale (1882) 21 Ch D 9",
  "keywords": ["equity", "lease", "specific performance", "legal estate", "equitable estate"],
      "summary": ""
},
{
  "name": "Re Rose [1952] EWCA Civ 4",
  "keywords": ["equity", "trust", "voluntary settlement", "complete constitution of trusts"],
      "summary": ""
},
{
  "name": "Lloyds Bank v Rosset [1991] 1 AC 107",
  "keywords": ["equity", "constructive trust", "matrimonial home", "beneficial interest"],
      "summary": ""
},
{
  "name": "Re Vandervell’s Trusts (No 2) [1974] Ch 269",
  "keywords": ["equity", "trust", "resulting trust", "bare trust", "taxation"],
      "summary": ""
},
{
  "name": "Factortame Ltd v Secretary of State for Transport (No 2) [1991] 1 AC 603",
  "keywords": ["EU", "constitutional", "fishing rights", "supremacy of EU law", "interim relief"],
      "summary": ""
},
{
  "name": "R v Secretary of State for Transport, ex p Factortame (No 5) [2000] 1 AC 524",
  "keywords": ["EU", "constitutional", "damages", "fishing rights", "state liability"],
      "summary": ""
},
{
  "name": "Van Gend en Loos v Nederlandse Administratie der Belastingen [1963] ECR 1",
  "keywords": ["EU", "constitutional", "customs duties", "direct effect"],
      "summary": ""
},
{
  "name": "Costa v ENEL [1964] ECR 585",
  "keywords": ["EU", "constitutional", "nationalisation", "supremacy of EU law"],
      "summary": ""
},
{
  "name": "Marleasing SA v La Comercial Internacional de Alimentacion SA [1990] ECR I-4135",
  "keywords": ["EU", "constitutional", "interpretation", "indirect effect"],
      "summary": ""
},
{
  "name": "Unibet (London) Ltd v Justitiekanslern [2007] ECR I-2271",
  "keywords": ["EU", "gambling", "free movement of services", "proportionality"],
      "summary": ""
},
{
  "name": "Thoburn v Sunderland City Council [2002] EWHC 195 (Admin)",
  "keywords": ["EU", "constitutional", "metric weights", "implied repeal", "supremacy of EU law"],
      "summary": ""
},
  {
  "name": "Osman v United Kingdom [1998] ECHR 101",
  "keywords": ["duty to protect", "negligence", "right to life", "human rights"],
      "summary": ""
},
    {
  "name": "Douglas v Hello! Ltd [2001] EWCA Civ 595",
  "keywords": ["privacy", "freedom of expression", "celebrity", "copyright", "human rights"],
      "summary": ""
},
    {
  "name": "Hirst v United Kingdom (No 2) [2005] ECHR 681",
  "keywords": ["prisoners' rights", "right to vote", "democracy", "human rights"],
      "summary": ""
},
    {
"name": "Donovan v R [1934] AC 498",
"keywords": ["criminal law", "attempted crime", "actus reus", "mens rea"],
      "summary": ""
},
    {
"name": "Pepper v Hart [1993] AC 593",
"keywords": ["constitutional law", "legislative intent", "parliamentary debates", "statutory interpretation"],
      "summary": ""
},
    {
"name": "Balfour v Balfour [1919] 2 KB 571",
"keywords": ["contract law", "domestic agreements", "intention to create legal relations", "binding contracts"],
      "summary": ""
},
    {
"name": "Lloyds Bank v Bundy [1975] QB 326",
"keywords": ["property law", "proprietary estoppel", "promissory estoppel", "equitable rights"],
      "summary": ""
},
    {
"name": "Sturges v Bridgman (1879) 11 Ch D 852",
"keywords": ["tort law", "nuisance", "reasonableness", "injunctive relief"],
      "summary": ""
},
    {
"name": "Donoghue v Folkestone Properties [2003] EWCA Civ 231",
"keywords": ["tort law", "occupier's liability", "duty of care", "trespassers"],
      "summary": ""
},
    {
"name": "R v Williams [1923] 1 KB 340",
"keywords": ["criminal law", "theft", "appropriation", "dishonesty"],
      "summary": ""
},
    {
"name": "Hunter v Canary Wharf [1997] AC 655",
"keywords": ["property law", "nuisance", "interference", "economic loss"],
      "summary": ""
},
   {
"name": "Thornton v Shoe Lane Parking [1971] 2 QB 163",
"keywords": ["contract law", "exemption clauses", "unfair terms", "noticeability"],
      "summary": ""
}, 
    {
"name": "R v Collins [1973] QB 100",
"keywords": ["criminal law", "possession of drugs", "custody and control", "knowledge"],
      "summary": ""
},
    {
"name": "R v Collins [1972] AC 307",
"keywords": ["criminal law", "theft", "appropriation", "dishonesty"],
      "summary": ""
},
    {
"name": "R (Pretty) v DPP [2001] UKHL 61",
"keywords": ["human rights law", "assisted suicide", "right to life", "proportionality"],
      "summary": ""
},
{
"name": "R v Cunningham [1957] 2 QB 396",
"keywords": ["criminal law", "maliciously", "reckless", "unlawful act manslaughter"],
      "summary": ""
},
    {
"name": "Attorney General v Blake [2000] 1 AC 268",
"keywords": ["contract law", "breach of confidence", "public interest", "damages"],
      "summary": ""
},
{
"name": "R v Hinks [2000] UKHL 53",
"keywords": ["criminal law", "theft", "appropriation", "property rights"],
      "summary": ""
},
{
"name": "Ashby v White [1703] 92 ER 126",
"keywords": ["constitutional law", "voting rights", "disenfranchisement", "tortious interference"],
      "summary": ""
},
{
"name": "Pinnel's Case (1602) 5 Co Rep 117a",
"keywords": ["contract law", "consideration", "part payment", "practical benefit"],
      "summary": ""
},
    {
"name": "White v Jones [1995] 2 AC 207",
"keywords": ["tort law", "negligence", "duty of care", "third-party liability"],
      "summary": ""
},
{
"name": "R v Paradine (1647) Aleyn 26",
"keywords": ["contract law", "frustration", "impossibility", "force majeure"],
      "summary": ""
},
{
"name": "McGhee v National Coal Board [1973] 1 WLR 1",
"keywords": ["tort law", "causation", "material contribution", "foreseeable harm"],
      "summary": ""
},
    {
"name": "R v Cambridge [1990] 3 All ER 219",
"keywords": ["criminal law", "attempted crime", "proximity test", "impossibility"],
      "summary": ""
},
{
"name": "Attorney-General's Reference (No 2 of 1992) [1993] 4 All ER 593",
"keywords": ["criminal law", "attempted crime", "substantial step", "inchoate offenses"],
      "summary": ""
},
{
"name": "R v Golding [2014] EWCA Crim 889",
"keywords": ["criminal law", "recklessness", "criminal damage", "foreseeable risk"],
      "summary": ""
},
{
"name": "Bell v Lever Bros [1932] AC 161",
"keywords": ["contract law", "offer and acceptance", "communication", "invitation to treat"],
      "summary": ""
},
{
"name": "Stannard v Gore [2012] EWHC 1655",
"keywords": ["tort law", "vicarious liability", "employee's personal motive", "course of employment"],
      "summary": ""
},
    {
"name": "Entick v Carrington [1765] EWHC KB J98",
"keywords": ["constitutional law", "unlawful search and seizure", "privacy"],
      "summary": ""
},
    {
"name": "Airedale NHS Trust v Bland [1993] AC 789",
"keywords": ["medical law", "end of life decisions", "best interests"],
      "summary": ""
},
    {
"name": "Ghaidan v Godin-Mendoza [2004] UKHL 30",
"keywords": ["human rights law", "discrimination", "sexual orientation", "civil partnerships"],
      "summary": ""
},
{
"name": "Henderson v Merrett Syndicates Ltd [1995] 2 AC 145",
"keywords": ["contract law", "vicarious liability", "employees", "negligent acts"],
      "summary": ""
},
    {
"name": "Mortgage Corporation v Shaire [2001] EWCA Civ 1758",
"keywords": ["land law", "mortgages", "priority", "equitable interests"],
      "summary": ""
},
{
"name": "R (ProLife Alliance) v BBC [2004] UKHL 23",
"keywords": ["media law", "freedom of expression", "political advertising", "broadcasting"],
      "summary": ""
},
{
"name": "Attorney General v Guardian Newspapers (No 2) [1990] 1 AC 109",
"keywords": ["media law", "freedom of the press", "national security", "publication of classified information"],
      "summary": ""
},
    {
"name": "Central London Property Trust Ltd v High Trees House Ltd [1947] KB 130",
"keywords": ["contract law", "promissory estoppel", "part payment of debt", "reliance"],
      "summary": ""
},
    {
"name": "R v Gibbons and Proctor [1918] 13 Cr App R 134",
"keywords": ["criminal law", "omission", "duty to act", "parental responsibility"],
      "summary": ""
},
    {
"name": "R v Walker [1963] 1 QB 779",
"keywords": ["criminal law", "self-defense", "reasonable force", "immediate threat"],
      "summary": ""
},
    {
"name": "R (Hicks) v Commissioner of Police for the Metropolis [2017] UKSC 9",
"keywords": ["human rights law", "protest", "freedom of expression", "Article 10 ECHR"]
},
    {
"name": "R v Wilson [1996] 2 Cr App R 241",
"keywords": ["criminal law", "consent", "body modification", "grievous bodily harm"],
      "summary": ""
},
    {
"name": "Barton v Armstrong [1976] AC 104",
"keywords": ["tort law", "vicarious liability", "employee misconduct", "course of employment"],
      "summary": ""
},
    {
"name": "R (Al-Saadoon) v Secretary of State for Defence [2010] UKSC 2",
"keywords": ["human rights law", "deprivation of liberty", "internment", "Article 5 ECHR"],
      "summary": ""
},
    {
      "name": "McDonald's Corporation v Steel & Morris [1997] EWHC 366 (QB)",
      "keywords": ["tort", "libel", "right to a fair trial", "environmental"],
      "summary": ""
    },
{
"name": "Société Générale v Geys [2012] UKSC 63",
"keywords": ["financial services", "misrepresentation", "contractual terms", "banking transactions", "liability limitation"],
      "summary": ""
}
  ]
}
