{
  "concepts": [
{
   "name": "Ultra vires",
   "field": "constitutional",
   "explanation": "<strong>What is ultra vires?</strong><br>• Ultra vires is a Latin term which translates to 'beyond the powers'.<br>• In the context of UK constitutional law, it refers to actions taken by public authorities that exceed the powers granted to them by the law.<br>• When an authority acts ultra vires, its actions are considered void and may be nullified by a court.<br><br><strong>Why is it important?</strong><br>• The concept of ultra vires is an important tool for ensuring that public authorities are held accountable and operate within the confines of the law.<br>• By preventing authorities from exceeding their powers, ultra vires helps to maintain the rule of law and uphold the principle of legality.<br>• Judicial review, a key mechanism for holding public authorities accountable, often involves determining whether an authority has acted ultra vires.<br><br><strong>Example cases</strong><br>• Anisminic v Foreign Compensation Commission (1969): This landmark case established that even decisions of expert tribunals could be subject to judicial review for ultra vires.<br>• Council of Civil Service Unions v Minister for the Civil Service (1985) (GCHQ case): This case held that even decisions made by the Prime Minister can be subject to judicial review for ultra vires.<br>• R (on the application of Miller) v Secretary of State for Exiting the European Union (2017): In this case, the UK Supreme Court ruled that the Government could not trigger Article 50 (notice to leave the European Union) without an Act of Parliament, as doing so would be ultra vires the executive's powers."
},
{
   "name": "Parliamentary sovereignty",
   "field": "constitutional",
   "explanation": "<strong>What is Parliamentary sovereignty?</strong><br>• Parliamentary sovereignty is a fundamental principle of the UK constitution.<br>• It establishes the supremacy of Parliament over other branches of government (executive and judiciary) as well as over the legal system itself.<br>• Parliament, comprising the House of Commons and the House of Lords, can make, amend, or repeal any law, and no other institution can override or challenge its decisions.<br><br><strong>Why is it important?</strong><br>• Parliamentary sovereignty underpins the democratic legitimacy of the UK legal system, ensuring that the elected representatives in Parliament ultimately make the laws governing the country.<br>• It provides for legal certainty, as there can be no confusion or doubt regarding the ultimate source of authority for any legal rule in the UK.<br>• Parliamentary sovereignty allows for necessary legal changes to be made promptly and effectively by Parliament, either in response to societal developments or in order to address pressing issues.<br><br><strong>Example cases</strong><br>• R (Jackson) v Attorney General [2005] UKHL 56: This case concerned the validity of the Hunting Act 2004 and its potential impact on the principle of Parliamentary sovereignty. The House of Lords affirmed that statutes that restrict Parliamentary sovereignty would be void.<br>• AXA General Insurance Ltd v HM Advocate [2011] UKSC 46: The Supreme Court held that courts could review acts of the Scottish Parliament for compatibility with common law, though they recognized its competence and supremacy in its legislative capacity.<br>• R (Miller) v Secretary of State for Exiting the European Union [2017] UKSC 5: This case determined that the government could not trigger the UK's exit from the European Union (EU) without parliamentary authorization, highlighting that Parliamentary sovereignty is retained even when dealing with international agreements and treaties."
},
{
   "name": "Rule of law",
   "field": "constitutional",
   "explanation": "<strong>What is the rule of law?</strong><br>• The rule of law is a fundamental principle of UK constitutional law, which upholds that no person or organization is above the law and everyone must be subject to it.<br>• It ensures that laws are applied equally, fairly, and consistently to all citizens, limiting the arbitrary exercise of power by state authorities.<br><br><strong>Why is it important?</strong><br>• The concept of the rule of law is essential to maintain democratic governance, as it guarantees the protection of individual liberties, rights, and access to justice.<br>• It promotes transparency, accountability, and legal certainty, which are necessary for the stability and development of a society.<br>• The rule of law acts as a crucial check on the abuse of power, preventing arbitrary or discriminatory actions by public authorities.<br><br><strong>Example cases</strong><br>• In <em>Entick v. Carrington</em> (1765), the court held that state agents cannot enter and search private property without proper legal authority, thus emphasizing the importance of individual rights and the limits on state power.<br>• In the <em>Belmarsh</em> case (A v. Secretary of State for the Home Department [2004] UKHL 56), the House of Lords ruled that indefinite detention of foreign terrorist suspects without trial breached the European Convention on Human Rights, illustrating the rule of law's role in ensuring government actions adhere to human rights principles.<br>• The <em>Miller</em> case (R (Miller) v. Secretary of State for Exiting the European Union [2017] UKSC 5) confirmed that the executive could not bypass Parliament when triggering Article 50 (the process of leaving the European Union), highlighting the importance of respecting legal processes and the separation of powers."
},
{
   "name": "Separation of powers",
   "field": "constitutional",
   "explanation": "<strong>What is the separation of powers?</strong><br>• The Separation of powers is a fundamental principle of UK constitutional law that maintains a balance of power among three branches of government: the executive (led by the Prime Minister and Cabinet), the legislature (Parliament), and the judiciary (courts).<br>• The concept aims to prevent the concentration of power in a single institution and to protect the liberty and rights of the citizen.<br><br><strong>Why is it important?</strong><br>• The importance of the Separation of powers lies in its role as a safeguard against arbitrary and oppressive governance.<br>• It prevents the abuse of power by ensuring that no single branch has unlimited authority, and that each branch serves as a check on the actions of the others.<br>• The principle ensures an efficient and balanced system of government, where each branch can fulfill its functions effectively and independently.<br><br><strong>Example cases</strong><br>• <em>R v Home Secretary ex parte Fire Brigades Union (FBU)</em> (1995): The House of Lords ruled that the executive could not use its prerogative powers to introduce a new compensation scheme without approval from the legislature.<br>• <em>R (Jackson) v Attorney General</em> (2005): The House of Lords considered the validity of the Parliament Acts, which allow the House of Commons to bypass the House of Lords in certain cases. The case highlighted the ongoing debate surrounding the powers of the Parliament and potential threats to the Separation of powers in the UK.<br>• <em>R (Miller) v The Prime Minister and Cherry v Advocate General for Scotland</em> (2019): The Supreme Court ruled that the Prime Minister's advice to the Queen to prorogue Parliament was unlawful, as it had the effect of frustrating the constitutional power of Parliament to scrutinize the executive."
},
{
   "name": "Constitutional conventions",
   "field": "constitutional",
   "explanation": "<strong>What are constitutional conventions?</strong><br>• Constitutional conventions are unwritten rules and principles that have evolved over time in the United Kingdom's (UK) constitutional system.<br>• They regulate the exercise of power and form the backbone of the UK's uncodified constitution, influencing how the government operates and the relationship between different government branches.<br>• Conventions are based on historical precedents, political practices, and values, reflecting the gradual development of the UK's constitution.<br><br><strong>Why is it important?</strong><br>• They ensure the functioning and stability of the political system, providing a flexible framework for the government to adapt to changing circumstances.<br>• Conventions limit the powers of various actors within the political system, ensuring that they operate within established norms and checks and balances.<br>• While not legally enforceable, conventions carry significant political weight, and violations can lead to political and constitutional crises or demands for reform.<br>• They reflect the UK's unique constitutional history and its preference for an evolutionary, rather than codified, approach to constitutional change.<br><br><strong>Example cases</strong><br>• Attorney General v Jonathan Cape Ltd [1975]: This case highlighted the Ministerial responsibility convention, which holds that ministers are accountable to Parliament for the actions and decisions of their departments.<br>• R (Miller) v Secretary of State for Exiting the European Union [2017] (Miller I): In this case, the Supreme Court held that the government could not trigger Article 50 of the Treaty on European Union (TEU) to initiate Brexit without Parliament's approval, as it involves the removal of rights under UK law.<br>• R (Miller) v Prime Minister [2019] (Miller II): The case involved the principle of parliamentary sovereignty and the convention that the Prime Minister should not seek to prorogue Parliament for an improper purpose or an excessive length of time; the Supreme Court held that the Prime Minister's advice to the Queen to prorogue Parliament was unlawful."
},
{
   "name": "Devolution",
   "field": "constitutional",
   "explanation": "<strong>What is Devolution?</strong><br> • Devolution is a constitutional concept in the United Kingdom relating to the distribution of powers amongst distinct regional governments and the central UK government.<br> • It involves the transfer of legislative, administrative, and financial powers from Westminster (the central UK Parliament) to regional parliaments and assemblies.<br> • The extent of the devolved powers varies across the UK regions, including Scotland, Wales, and Northern Ireland, which have their own parliamentary and administrative institutions.<br><br> <strong>Why is it important?</strong><br> • Maintains a balance of power and promotes a sense of regional autonomy and decision-making.<br> • Reduces the administrative burden on the central government and allows regional diversity.<br> • Encourages cultural, social, and political pluralism across the nation, thereby promoting unity.<br> • Provides a counterweight to the centralising forces in the system of UK governance.<br><br><strong>Example cases</strong><br> • R (Miller) v Secretary of State for Exiting the European Union [2017] UKSC 5: The UK Government required Parliament’s approval to initiate Brexit; raised issues relating to the legislative competence of devolved legislatures in relation to Brexit.<br> • A Reference by the Attorney General for England and Wales [2019] UKSC 41 (commonly known as 'The Scottish Continuity Bill case'): The UK Supreme Court assessed the legislative competence of the Scottish Parliament regarding the UK’s withdrawal from the European Union and determined that certain provisions of the Scottish bill were beyond the legislative competence of the Scottish Parliament.<br> • R (Factortame Ltd) v Secretary of State for Transport [1991]1 AC 603: Demonstrated the limits of parliamentary sovereignty in the UK in the context of European law, highlighting the potential interplay of devolution issues and emerging constitutional principles."
},
{
   "name": "Royal prerogative",
   "field": "constitutional",
   "explanation": "<strong>What is the royal prerogative?</strong><br>• The royal prerogative refers to a set of powers, privileges, and immunities historically exercised by the monarch, which have now mainly transferred to the executive branch of the UK government (specifically, the Prime Minister and government ministers).<br>• These prerogative powers are exercised without the need for parliamentary approval and include matters related to foreign affairs, defense, and appointment or dismissal of ministers.<br><br><strong>Why is it important?</strong><br>• The royal prerogative plays a significant role in the functioning of the UK constitution, as it provides the executive with certain discretionary powers that enable efficient and timely decision-making.<br>• However, the prerogative is subject to judicial review and the rule of law, which ensures that these powers are not abused or exercised arbitrarily.<br>• The scope and limits of the royal prerogative are important in maintaining the balance of power between the executive, the legislature, and the judiciary.<br><br><strong>Example cases</strong><br>• In <em>Case of Proclamations</em> (1611), the court limited the monarch's power to legislate through proclamations, asserting that prerogative powers cannot be used to create new laws or alter existing laws.<br>• In <em>Council of Civil Service Unions v. Minister for the Civil Service</em> (1985), the court held that the exercise of the royal prerogative is reviewable in certain circumstances, highlighting the principle of accountability in the use of prerogative powers.<br>• The aforementioned <em>Miller</em> case (R (Miller) v. Secretary of State for Exiting the European Union [2017] UKSC 5) demonstrated that the government cannot rely on the royal prerogative to bypass Parliament when triggering Article 50, emphasising the importance of parliamentary sovereignty and the limitations of prerogative powers."
},
{
   "name": "Constitutional monarchy",
   "field": "constitutional",
   "explanation": "<strong>What is a Constitutional monarchy?</strong><br>• A Constitutional monarchy is a form of government in which a monarch acts as the head of state within the parameters of a written or unwritten constitution.<br>• In this system, the monarch's powers are limited and regulated, ensuring they do not wield absolute authority.<br>• The United Kingdom is an example of a constitutional monarchy, with the Queen as the head of state and the Prime Minister as the head of government.<br><br><strong>Why is it important?</strong><br>• A Constitutional monarchy balances tradition with democratic principles by retaining the symbolic role of the monarch while vesting executive power in an elected government.<br>• It serves as a unifying figurehead and stabilizing force, particularly in times of political turbulence.<br>• The constitutional limitations placed on the monarch promote the rule of law and protection of individual rights.<br><br><strong>Example cases</strong><br>• <em>A v B (Flitcroft) and others</em> (2002): The courts ruled that the monarch had the constitutional power to grant pardons, and this power was not subject to judicial review.<br>• <em>R (Miller) v The Prime Minister and Cherry v Advocate General for Scotland</em> (2019): The cases confirmed that the Prime Minister, rather than the monarch, holds the authority to prorogue Parliament, and determined the limits of this power in relation to the UK's constitution.<br>• <em>Re Petition of Right Act 1628</em>: This historical Act placed limits on the monarch's power to impose taxes, imprisonment, or property seizures without due process, illustrating the early development of the UK as a constitutional monarchy."
},
{
   "name": "Judicial review",
   "field": "constitutional",
   "explanation": "<strong>What is Judicial Review?</strong><br>• Judicial review is a legal process through which the courts scrutinize the decisions, actions, or omissions of public bodies to ensure they are lawful, rational, and procedurally fair.<br>• It is a key mechanism in the United Kingdom's (UK) constitutional system to uphold the rule of law and protect individuals' rights against arbitrary or unlawful state actions.<br>• Judicial review focuses on the decision-making process, rather than the merits of the decision itself, ensuring that public bodies exercise their powers within the bounds of the law and do not exceed their authority.<br><br><strong>Why is it important?</strong><br>• It serves as a crucial check on the exercise of state power and helps maintain a balance between the government's authority and individuals' rights.<br>• Judicial review ensures that public bodies, officials, and decision-makers remain accountable to the law and follow proper procedures in their actions.<br>• It fosters legal certainty and predictability, promoting adherence to legal norms and principles by public bodies.<br>• Judicial review can serve as a catalyst for legal and policy reforms, as it can highlight shortcomings and areas for improvement in public administration.<br><br><strong>Example cases</strong><br>• Anisminic Ltd v Foreign Compensation Commission [1969]: This landmark case established the 'Anisminic Principle,' asserting that any legal error made by a public body renders its decision ultra vires, or beyond its power, making judicial review appropriate.<br>• Council of Civil Service Unions v Minister for the Civil Service [1985] (GCHQ case): This case recognized the 'Royal Prerogative' as subject to judicial review, symbolizing a significant constitutional shift that emphasized the rule of law and enhanced the judiciary's power to scrutinize executive actions.<br>• R (UNISON) v Lord Chancellor [2017]: In this case, the Supreme Court ruled that employment tribunal fees introduced by the government were unlawful, as they impeded access to justice and disproportionately affected lower income individuals, highlighting the role of judicial review in protecting fundamental rights."
},
{
   "name": "Statutory interpretation",
   "field": "constitutional",
   "explanation": "<strong>What is Statutory Interpretation?</strong><br> • Statutory interpretation is the process of interpreting and applying legislation to legal disputes.<br> • It involves deciphering the meaning of the words used in a statute and understanding the intention of the legislature in passing the law.<br> • Judges are primarily responsible for interpreting statutes and applying them to specific cases that come before the court.<br> • Various rules and principles of interpretation are employed by judges to determine the meaning and scope of a statute.<br><br> <strong>Why is it important?</strong><br> • Ensures that legislation is applied correctly and consistently to legal disputes.<br> • Promotes the rule of law and provides legal certainty for both individuals and society.<br> • Handles ambiguity, inconsistencies, or gaps in the statutory language, taking into account the intention of the legislature.<br> • Contributes to the development and evolution of legal precedents in common law systems.<br><br><strong>Example cases</strong><br> • Pepper (Inspector of Taxes) v Hart [1993] AC 593: Established that judges may refer to Hansard, the official parliamentary record, to aid in statutory interpretation when the language of a statute is ambiguous or unclear.<br> • R v Secretary of State for the Environment, Transport and the Regions, ex parte Spath Holme Ltd [2001] 2 AC 349: Demonstrated the application of the 'purposive approach' to statutory interpretation, which seeks to determine the underlying purpose of legislation and interpret it accordingly.<br> • Fisher v Bell [1961] 1 QB 394: Illustrated the 'literal approach' to statutory interpretation, in which the court applies the ordinary, plain meaning of the statutory language, even if it produces an absurd or unintended result."
},
{
   "name": "The Crown in Parliament",
   "field": "constitutional",
   "explanation": "<strong>What is the Crown in Parliament?</strong><br>• The Crown in Parliament is a key principle of the UK constitution, representing the concept of parliamentary sovereignty.<br>• It embodies the complete fusion of the three components of the UK Parliament: the monarch (the Crown), the House of Commons (representing the people), and the House of Lords (representing the nobility and the spiritual community).<br>• The Crown in Parliament signifies that the constitutional authority of Parliament is supreme over the executive and judiciary branches, and it is the source of all legitimate political power.<br><br><strong>Why is it important?</strong><br>• The Crown in Parliament highlights the central role of Parliament in the UK constitution, asserting its power to make, unmake, or alter any law without any external constraints.<br>• As a symbol of parliamentary sovereignty, it ensures a system of democratic governance and protects the rights and freedoms of citizens.<br>• The principle emphasizes the necessary collaboration between the different components of Parliament to create, amend, or repeal legislation.<br><br><strong>Example cases</strong><br>• In <em>Parliament Act 1911</em>, the Parliament Act limited the powers of the House of Lords and reinforced the supremacy of the House of Commons, aligning the Crown in Parliament concept with the principle of democratic representation.<br>• The <em>Factortame</em> case (R v. Secretary of State for Transport, ex parte Factortame [1990] UKHL 13) demonstrated that UK courts were obliged to give effect to European Community law over domestic legislation, which raised questions about the extent of parliamentary sovereignty under the Crown in Parliament principle.<br>• The <em>European Union (Withdrawal) Act 2018</em> restored the supremacy of the Crown in Parliament, as it repealed the European Communities Act 1972 and reaffirmed the principle of parliamentary sovereignty following the UK's decision to leave the European Union."
},
{
   "name": "Judicial independence",
   "field": "constitutional",
   "explanation": "<strong>What is Judicial independence?</strong><br>• Judicial independence is the principle that judges and courts must be free from external influence, allowing them to impartially and fairly adjudicate disputes based on the law.<br>• It ensures that judges can make decisions without fear of retaliation, political pressure, or personal bias, safeguarding the rule of law and the fair administration of justice.<br><br><strong>Why is it important?</strong><br>• Judicial independence is essential for maintaining public trust and confidence in the legal system, as it guarantees that decisions are made fairly, consistently, and without prejudice.<br>• It upholds the balance of power and the separation of powers between the judiciary, executive, and legislature, preventing undue interference from other branches of government.<br>• By fostering impartiality and objectivity, judicial independence supports the protection of individual rights and the preservation of democratic principles.<br><br><strong>Example cases</strong><br>• <em>R v Bow Street Metropolitan Stipendiary Magistrate, ex parte Pinochet Ugarte</em> (1998): The House of Lords invalidated its earlier decision due to concerns about the appearance of judicial bias, emphasizing the importance of judicial independence and impartiality.<br>• <em>Re Pinochet</em> (1999): The case highlighted the importance of safeguarding judicial independence when international political pressures are involved, as it concerned the extradition of former Chilean dictator Augusto Pinochet.<br>• <em>Browne v Dunn</em> (1893): This case established the rules governing the cross-examination of witnesses, illustrating the judiciary's role in upholding procedural safeguards that ensure the administration of fair and impartial justice."
},
{
   "name": "Fairness and natural justice",
   "field": "constitutional",
   "explanation": "<strong>What are Fairness and Natural Justice?</strong><br>• Fairness and natural justice are fundamental principles in the United Kingdom's (UK) legal system that ensure individuals are treated fairly and equitably in decision-making processes, particularly in administrative and judicial settings.<br>• These principles guarantee the right to a fair hearing and the right to be judged impartially, ensuring that decision-makers act without bias and provide affected parties with an opportunity to present their case.<br>• The twin pillars of natural justice are the rule against bias (nemo judex in causa sua) and the right to a fair hearing (audi alteram partem).<br><br><strong>Why are they important?</strong><br>• Fairness and natural justice are essential to upholding the rule of law and maintaining public trust in the legal system and decision-making processes.<br>• They provide a framework for fair and transparent decision-making, ensuring that individuals are afforded due process and equal treatment before the law.<br>• The principles can act as safeguards against potential abuses of power by public authorities and decision-makers.<br>• Fairness and natural justice promote consistency and predictability in legal proceedings, enhancing legal certainty and the effective functioning of the legal system.<br><br><strong>Example cases</strong><br>• Ridge v Baldwin [1964]: This case established that the principles of natural justice apply to administrative decision-making, and a failure to observe them will render a decision invalid.<br>• R v Sussex Justices, Ex parte McCarthy [1924]: This case emphasized the rule against bias, with the famous maxim 'justice should not only be done but also be seen to be done,' highlighting the importance of impartial decision-making.<br>• R v Secretary of State for the Home Department, Ex parte Doody [1993]: In this case, the court highlighted the importance of providing reasons for a decision, emphasizing that the parties affected should be sufficiently informed to understand and contest decisions affecting their rights."
},
{
   "name": "Parliamentary privilege",
   "field": "constitutional",
   "explanation": "<strong>What is Parliamentary Privilege?</strong><br> • Parliamentary Privilege is a set of legal immunities and protections granted to Members of Parliament (MPs) and Members of the House of Lords, which allows them to perform their duties without interference or fear of legal repercussions.<br> • Its origins can be traced back to the English Bill of Rights in 1689, and it forms an essential part of the UK's unwritten constitution.<br> • Key aspects of Parliamentary Privilege include Freedom of Speech, Exclusive Cognisance (the inherent jurisdiction of each House to regulate its own affairs), and protection from arrest in certain cases.<br><br> <strong>Why is it important?</strong><br> • Ensures that MPs and Lords can engage in open and robust debates in Parliament, allowing them to address critical issues and hold the government accountable without the fear of legal consequences.<br> • Safeguards Parliament's independence and separation of powers in the UK constitutional framework.<br> • Ensures the proper functioning of parliamentary democracy by allowing parliamentarians to effectively represent their constituents and scrutinise legislation.<br><br><strong>Example cases</strong><br> • R v Chaytor [2010] UKSC 52: Members of Parliament were unsuccessfully claiming Parliamentary Privilege to prevent prosecution for expenses fraud, the Supreme Court held that privilege does not extend to MPs' conduct outside parliamentary proceedings.<br> • Stockdale v Hansard [1839]9 Ad & El 1: The House of Commons' publication of a defamatory statement was not covered by parliamentary privilege, leading to the enactment of the Parliamentary Papers Act 1840.<br> • Pepper (Inspector of Taxes) v Hart [1993] AC 593: This landmark case established the principle of using Hansard (the official report of parliamentary proceedings) to aid statutory interpretation in certain circumstances, raising issues of the boundaries and operation of parliamentary privilege."
},
{
   "name": "Sovereign immunity",
   "field": "constitutional",
   "explanation": "<strong>What is Sovereign immunity?</strong><br>• Sovereign immunity, often referred to as Crown immunity in the UK, is a legal doctrine that prevents the state or its authorities from being subject to judicial action, such as lawsuits or criminal prosecution without their consent.<br>• In the UK, the concept of Crown immunity is based on an old maxim that 'the King (or Queen) can do no wrong'.<br>• This doctrine applies to central and local government bodies and their officers, as well as the Crown in its public and private capacities.<br><br><strong>Why is it important?</strong><br>• Sovereign immunity is important because it maintains the balance of power between the state and its citizens and prevents the government from being hindered by legal disputes.<br>• It also enables the government to execute its functions effectively and efficiently without the fear of constant legal challenges.<br>• However, the concept has been criticised for allowing potential abuse of power, leading to necessary exceptions and limitations on sovereign immunity.<br><br><strong>Example cases</strong><br>• <em>Adams & Anr v UK Atomic Energy Authority</em> (1998) – A case involving the employment rights of two individuals, where the court held that Crown immunity did not extend to the British forces.<br>• <em>R v Chelmsford Justices, ex parte Henry</em> (1985) – A case concerning the jurisdiction of the police to arrest a man on a roadside, where the court confirmed that police actions are subject to judicial review since they are public authorities despite Crown immunity.<br>• <em>R v Chief Constable of Thames Valley Police & Anor</em> (1997) – A significant case for public authorities' responsibilities, as it held that police officers were no longer immune from the action of trespass whilst carrying out their duties."
},
{
    "name": "Actus reus",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Mens rea",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Illegality",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Self-defence",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Volenti non fit iniuria",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Strict liability",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Vicarious liability",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Intention",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Recklessness",
    "field": "criminal",
    "explanation": ""
},
{
    "name": "Duty of care",
    "field": "tort",
    "explanation": ""
},
{
    "name": "Contributory negligence",
    "field": "tort",
    "explanation": ""
},
{
    "name": "Vicarious liability",
    "field": "tort",
    "explanation": ""
},
{
    "name": "Ex turpi causa non oritur actio",
    "field": "tort",
    "explanation": ""
},
{
    "name": "Pure economic loss",
    "field": "tort",
    "explanation": ""
},
{
    "name": "Statutory duties",
    "field": "tort",
    "explanation": ""
},
{
    "name": "Independent contractor",
    "field": "tort",
    "explanation": ""
},
{
    "name": "Overreaching",
    "field": "land",
    "explanation": ""
},

{
    "name": "Freehold ownership",
    "field": "land",
    "explanation": ""
},

{
    "name": "Leasehold ownership",
    "field": "land",
    "explanation": ""
},

{
    "name": "Easements",
    "field": "land",
    "explanation": ""
},

{
    "name": "Covenants",
    "field": "land",
    "explanation": ""
},

{
    "name": "Mortgages",
    "field": "land",
    "explanation": ""
},

{
    "name": "Adverse possession",
    "field": "land",
    "explanation": ""
},
{
"name": "Consideration",
"field": "contract",
"explanation": ""
},

{
"name": "Intention to create legal relations",
"field": "contract",
"explanation": ""
},

{
"name": "Capacity",
"field": "contract",
"explanation": ""
},

{
"name": "Misrepresentation",
"field": "contract",
"explanation": ""
},

{
"name": "Duress",
"field": "contract",
"explanation": ""
},

{
"name": "Undue influence",
"field": "contract",
"explanation": ""
},

{
"name": "Frustration",
"field": "contract",
"explanation": ""
},
{
"name": "Mergers and acquisitions",
"field": "corporate",
"explanation": ""
},

{
"name": "Environmental, Social and Governance (ESG)",
"field": "corporate",
"explanation": ""
},

{
"name": "Greenwashing",
"field": "corporate",
"explanation": ""
},

{
"name": "Corporate governance",
"field": "corporate",
"explanation": ""
},
{
"name": "Insolvency and restructuring",
"field": "corporate",
"explanation": ""
},
{
"name": "Securities regulation",
"field": "corporate",
"explanation": ""
},
{
"name": "Arbitration",
"field": "corporate",
"explanation": ""
},
{
"name": "Non-disclosure agreement (NDA)",
"field": "corporate",
"explanation": ""
},
{
"name": "Audit",
"field": "corporate",
"explanation": ""
},
{
"name": "Collateral",
"field": "corporate",
"explanation": ""
}
]
}
